{
  "Completed": [
    {
      "Title": "When Your Heart Stops Beating",
      "Artist": "+44",
      "ReviewBody": "The first and only album from +44, starts off rather strong with _Lycanthrope_. The Energy of this song tells you that that you are in for a classic pop punk album, and it continues for a couple songs until you remember that half of the band is [Blink-182](../../Blink-182/Blink-182_Artist_Review.md) and their last album was [Blink-182](../../Blink-182/Blink-182/Blink-182_Album_Review.md)... The album drops off after _When your Heart Stops Beating_ moving into the more slow, experimental nature that is featured on _Blink-182_. The songs _Little Death_ and _No It Isn't_ are both about the breakup of _Blink-182_, while _Little Death_ isn't a bad song by any means it can start to drag a bit on repeat listens. _No It Isn't_ on the other hand is fantastic build from the more experimental tracks back to the higher energy the album started with. _Make You Smile_ is the absolute best song on the album, the duet nature makes this song an absolute joy.\n\nOverall I think the album is a solid mix of pre-breakup _Blink-182_ and a new evolution of pop punk. The album starts high then dips, but on the oathg the end starts to ramp, in my opinion, higher than the start. Sometimes the more experimental nature feels to drag, but overall I think the album is a solid 3 out of 5",
      "AlbumRating": 3,
      "TrackList": [
        "Lycanthrope",
        3,
        "Baby, Come On",
        3,
        "When Your Heart Stops Beating",
        2,
        "Little Death",
        2,
        "155",
        2,
        "Lillian",
        2,
        "Cliff Diving",
        3,
        "Interlude",
        2,
        "Weatherman",
        2,
        "No It Isn't",
        4,
        "Make You Smile",
        4,
        "Chapter 13",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\+44\\When Your Heart Stops Beating\\Cover.jpg",
      "Blurb": "",
      "NextUpText": "Oh and Next weeks album is a blast from the past\n\nJustice - (Cross)",
      "DatePosted": "2020-09-27T10:00:00,000"
    },
    {
      "Title": "(Cross)",
      "Artist": "Justice",
      "ReviewBody": "Justice, I haven't thought about this band or this album in years, coming back to it though it doesn't really hold the same place for me. The album starts out with _Genesis_ its a nice buildup, telling you what to expect for the next 48 minutes, but feels as though it takes a bit too long to get to its point, this was a tough one since I do like it with the album as a whole but I don't think it holds up on its own merits. _Let There Be Light_ has some interesting charactists, but the extended distorted organ starts to wear thing fairly quickly. The transition between the previous and the next track, _D.A.N.C.E_ is also a little wonky. The radio changing effect between songs is always a little jarring for me, but I guess its not a bad way to transiiton from a slower song to a classic pop bop. Probably the only actual song people know off this album, it is quite the fun dance track bringing in funk elements with a classic 4 on the flour house beat. I do n the whole enjoy this song, but it can be a bit saccharine at times.\nNext up is _Newjack_ and while it does fit with the ascethitic of the album; the consistant high pass filters make it a fairly annoying listen on its own. _Phantom_ is a bit on the noise-y side, which I typically like, but it felt almost a little Jam-y which is not quite what the rest of the album feels like. What else needs to be said about _Phantom Part II_ that hasn't been covered by _Phantom_, it is just a continuation of the previous track and really should just be combined. _Valentine_ is a nice palette cleanser from the previous blocks of tracks. I feel its needed, but the song on its own is not really that great.\nThis album so far might sound like a big miss rather than a nice trip down memory lane, that is until it hits with the next block of tracks, starting with _TThhee PPaarrttyy_. I have mixed feelings about this song, it is quite a great buildup to the next block of tracks, but as a solo play it doesn't really hold its own. _DVNO_ on the other hand, is a straight up jam. Such a fun bop, it almost jumped itself up a whole place. I know what I said about the previous noise-y, jam-y track, but _Stress_ owns it. It almost has a sythwave vibe, even though this album is about 15 years to young for that genre. _Waters Of Nazareth_ continues on the trend of the previous track, but picks up the pace a bit. The ending few tracks of this album are really what solidify the entire albums rating. Finally _One Minute to Midnight_ closes the album out, a nice respite from the last few tracks. Would be a lot higher if it didn't do that stupid minute of dead space at the end.\nOverall I do enjoy the album but it is on the low end of 3 out of 5. The strength of the last half of the album really carries it higher.",
      "AlbumRating": 3,
      "TrackList": [
        "Genesis",
        2,
        "Let There Be Light",
        2,
        "D.A.N.C.E.",
        3,
        "Newjack",
        2,
        "Phantom",
        2,
        "Phantom Part II",
        2,
        "Valentine",
        2,
        "TThhee PPaarrttyy",
        3,
        "DVNO",
        4,
        "Stress",
        3,
        "Waters Of Nazareth",
        3,
        "One Minute To Midnight",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Justice\\(Cross)\\Cover.jpg",
      "Blurb": "Oh and Next weeks album is a blast from the past",
      "NextUpText": "NEXT UP:\n\nits (ONe) by The Panic Channel\n\nWoo, get ready for some but rock",
      "DatePosted": "2020-10-05T10:00:00,000"
    },
    {
      "Title": "(ONe)",
      "Artist": "The Panic Channel",
      "ReviewBody": "This album is absolutely atrocious. `But Rock` at its... finest? Do you listen to [_Foo Fighters_](../../Foo%20Fighters/Foo_Fighters_Artist_Review.md) and wish they were more Generic? Then this is the band for you. Unlike most reviews where I listen 3-4 times to get ratings and really see what I think about the album, this time I think 2 listens is really enough. Ranging anywhere from \"this is fine\" to \"please make it stop\" this is not an album I will ever revisit. Its so bad in fact that I am seriously contemplating removing it from my library entirely.",
      "AlbumRating": 1,
      "TrackList": [
        "Teahouse Of The Spirits",
        2,
        "Left To Lose",
        2,
        "Bloody Mary",
        2,
        "Why Cry",
        1,
        "Awake",
        2,
        "She Won't Last",
        1,
        "Said You'd Be",
        2,
        "Outsider",
        1,
        "Blue Bruises",
        1,
        "Night One (From Planchette)",
        1,
        "Listen",
        1,
        "Lie Next To Me",
        1,
        "Untitled",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Panic Channel, The\\(ONe)\\Cover.jpg",
      "Blurb": "Woo, get ready for some but rock",
      "NextUpText": "NEXT UP:\n\n*.WAV SLAVE by BANDETTO",
      "DatePosted": "2020-10-12T10:00:00,000"
    },
    {
      "Title": "*.WAV SLAVE",
      "Artist": "BANDETTO",
      "ReviewBody": "It turns out that I do not have as high a tolerance for Breakcore as I thought I did. The album overall isn't bad but I would like it better if I had a dance pad or some other foux instrument to go along with it. I feel like I don't have too much to say about each of the individual tracks since they blend together so much. With few standouts like _barf city_ and _amnesiac_ the album is fun but its really nothing special. A good listen if you are in the mood to party, but as an album to just listen to its just mediocre. ",
      "AlbumRating": 3,
      "TrackList": [
        "bouncy castle boogie",
        2,
        "disco bombing",
        2,
        "gameshark",
        2,
        "barf city",
        3,
        "fierce fortune",
        3,
        "amnesiac",
        3,
        "need u",
        2,
        "scorch shuffle",
        2,
        "on the hunt",
        2,
        "rhythm guide",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\BANDETTO\\-.WAV SLAVE\\BANDETTO - -.WAV SLAVE - cover.png",
      "Blurb": "",
      "NextUpText": "NEXT UP:\n\n...And Out Come the Wolves by Rancid",
      "DatePosted": "2020-10-19T10:00:00,000"
    },
    {
      "Title": "...And Out Come The Wolves",
      "Artist": "Rancid",
      "ReviewBody": "This album hops from absolute banger to banger. Not a dead spot to be found. Starts out strong with _Maxwell Murder_, pulling into the power chord chorus of _The 11th Hour_. The ablum starts to really pick up with _Time Bomb_, its got that catchy chorus that breaks right into that classic ska breakdown. _Olympia WA_ has that shredding solo to prove that they can do more than just power chords. You can really feel the punk roots showing in _Lock, Step & Gone_, sounds just like a Clash song turned just a little more modern. And the titular track of the album, _Junkie Man_, even though the title is just part of of the outro of the song. _Listed M.I.A._ brings home how different, yet the same every track on this album is. I am definitely showing my bias towards loud, fast, punk music here. _Ruby Soho_ The best track on the album, even though Punk isn't supposed to be chorus heavy, Ska is on the other hand. So far this also marks the first 5 star song rating I have given out, hopefully got some more coming. The next few songs: _Daily City Train_, _Journey to the End of East Bay_, and _She's Automatic_; are all not bad songs, but nothing worth really pointing out. _Old Friend_ really starts to brings back the classic ska stroke.  _Disorder and Disarray_ Is in my opinion the last hurrah of this album, everything after is still good but nothing super memorable.\n\nOverall this has been my favorite album of the relisten so far. This album hits every chord for a fun, ska-punk, album should. This album is definitely going back into heavy rotation.",
      "AlbumRating": 4,
      "TrackList": [
        "Maxwell Murder",
        3,
        "The 11th Hour",
        3,
        "Roots Radicals",
        3,
        "Time Bomb",
        4,
        "Olympia WA",
        3,
        "Lock, Step & Gone",
        4,
        "Junkie Man",
        3,
        "Listed M.I.A.",
        4,
        "Ruby Soho",
        5,
        "Daily City Train",
        3,
        "Journey to the end of the East Bay",
        3,
        "She's Automatic",
        3,
        "Old Friend",
        3,
        "Disorder and Disarray",
        4,
        "The Wars End",
        3,
        "You Don't Care Nothin'",
        3,
        "As Wicked",
        3,
        "Avenues & Alleyways",
        3,
        "The Way I Feel",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Rancid\\And Out Come the Wolves\\Cover.jpg",
      "Blurb": "",
      "NextUpText": "NEXT UP:\n\n[ Movements ] by Solar Fields\n\nI think this is a video game soundtrack, idk?",
      "DatePosted": "2020-10-26T10:00:00,000"
    },
    {
      "Title": "[ Movements ]",
      "Artist": "Solar Fields",
      "ReviewBody": "So Heres the hard part about reviewing Ambient Albums, I like ambient but only in certain situations and moods. So while I do enjoy this album, it is not something I could see myself really listening to all that often. The Album does start strong with a nice long build on _Sol_, then kind of chills out and meanders a while for tracks like _Circles of Motion_ and _Discovering_. _The Stones are not too Busy_ starts to pick it back up over its 10 minute duration, but then again starts to chill out again. I have a hard time of coming up with new things to say about an ambient track, becuase you aren't really supposed to _Listen_ to them, so much as they are supposed to be background noise to help you focus or put you in a mood. Its the same way with a lot of Post rock for me as well. _Das Bungalow_ is pulling me back in, I like a bit of up-tempo with my ambient. I could very easily see this album being the OST for a space puzzle game. Its got that nice open sound while still holding you in the moment, it has a nice air-y breath-y sound qualities as well.",
      "AlbumRating": 3,
      "TrackList": [
        "Sol",
        3,
        "Circles of Motion",
        2,
        "Discovering",
        2,
        "Sky Trees",
        2,
        "The Stones are not too Busy",
        3,
        "Dust",
        2,
        "Das Bungalow",
        3,
        "Feeling (Album edit)",
        2,
        "Patterns",
        2,
        "The Road to Nothingness",
        3,
        "Breeze",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Solar Fields\\[ Movements ]\\Cover.jpg",
      "Blurb": "I think this is a video game soundtrack, idk?",
      "NextUpText": "NEXT UP:\n\n10,000 Days by Tool\n\ny'all are seriously sleeping on Tool",
      "DatePosted": "2020-11-02T10:00:00,000"
    },
    {
      "Title": "10,000 Days",
      "Artist": "Tool",
      "ReviewBody": "This album was my introduction to Tool. I liked it at the time but I didn't quite appreciate it until I got older. The way they bend progressive tendancies with metal is jaw dropping. The opening track, _Vicarious_, has this awesome slow build until it gets into the song proper. I think a lot of people just associate Tool with the people who like Tool, instead of necassarily appreciating the music for what it is. The album meanders a bit for a few tracks, it has an interesting build with _Wings For Marie_ but the payoff in _10,000 Days_ isn't quite enough for me. The Everything changes when we get to the song _The Pot_ this song is fantastic, and the first Tool song I ever heard. remember how I said everything was changing, that was wishful thinking. The next two tracks _Lipan Conjuring_ and _Lost Keys (Blame Hofmann)_, are just noise/intermission tracks. Have I ever mentioned how much I hate when artists do this. HOOO BOYYY. Next up is _Rosetta Stoned_, eleven minutes and eleven seconds of pure jam, if it was shorter it might get the coveted five out of five. The album keeps doing this flip flop of really solid tracks with just noise, it would be different if the noise tracks led into the others, but they seem to be there just to be there. _Right in Two_ brings the album back right into that groove. The last track on the album, _Viginti Tres_, is another just noise track.\n\nI really like the album overall, but the noise tracks really hamper it from being a fantastic album.",
      "AlbumRating": 3,
      "TrackList": [
        "Vicarious",
        3,
        "Jambi",
        3,
        "Wings For Marie (Part 1)",
        3,
        "10,000 Days (Wings Part 2)",
        2,
        "The Pot",
        5,
        "Lipan Conjuring",
        1,
        "Lost Keys (Blame Hofmann)",
        1,
        "Rosetta Stoned",
        4,
        "Intension",
        2,
        "Right In Two",
        4,
        "Viginti Tres",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Tool\\10,000 Days\\Cover.jpg",
      "Blurb": "y'all are seriously sleeping on Tool",
      "NextUpText": "NEXT UP:\n\n1039 SMoothed Out Slappy Hours by Green Day\n\nit's basically a compilation of all their early albums and eps",
      "DatePosted": "2020-11-06T10:00:00,000"
    },
    {
      "Title": "1039 Smoothed Out Slappy Hours",
      "Artist": "Green Day",
      "ReviewBody": "This album is a compilation of Green Days Frist album and a few of their early EPs. As far as it goes it is a great listen, theres a few notable tracks, but for the most part it is just bog standard Punk. _The Judge's Daughter_ is a notable standout for me, the shredding solo at the end really kicks the song up a notch. HOLY SHIT, I take it all back. The second half of this album fucking kicks ass, _Dry Ice_ to _The One I Want_ are absolute bangers, this album might skew higher than my initial reactions. Nice mix of catchy but also in your face. You can definitely see how Green Day will transition to pop punk as they get older, but right now this album is exactl waht Late 80s, early 90s punk was about. This album really shows the musicianship of the group, it starts off with power chord after power chord, but then it evolves over the course of the album and you can see those roots and then see how it grows past them.",
      "AlbumRating": 3,
      "TrackList": [
        "At the Library",
        3,
        "Don't Leave Me",
        3,
        "I was There",
        3,
        "Disappearing Boy",
        2,
        "Green Day",
        3,
        "Going to Pasalacqua",
        2,
        "16",
        3,
        "Road to Acceptance",
        3,
        "Rest",
        1,
        "The Judge's Daughter",
        4,
        "Paper Lanters",
        3,
        "Why do you Want Him",
        4,
        "409 in Your Coffeemaker",
        3,
        "Knowledge",
        2,
        "1000 Hours",
        3,
        "Dry Ice",
        4,
        "Only of You",
        4,
        "The One I Want",
        4,
        "I Want to Be Alone",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Green Day\\1039 Smoothed Out Slappy Hours\\Cover.jpg",
      "Blurb": "it's basically a compilation of all their early albums and eps",
      "NextUpText": "NEXT UP:\n\n13 by Blur\n\nthis is not the album with Track 2",
      "DatePosted": "2020-11-09T10:00:00,000"
    },
    {
      "Title": "13",
      "Artist": "Blur",
      "ReviewBody": "I've never actually listened to this Blur album all the way through before. I can't say I've ever really found myself so wishy washy on an album before. I seemed to alternate every track, with either liking it or hating it. _Coffee & TV_ was surprising hit on the album for me, but apart from that it was pretty touch and go. _Optigan 1_ was your standard noise interlude, which I hate, and then _Tender_, seven minutes of a boring slow song, no thank you. Overall I didn't hate this album, but I didn't really find anything special in it that I really liked.",
      "AlbumRating": 2,
      "TrackList": [
        "B.L.U.R.E.M.I.",
        3,
        "Battle",
        2,
        "Bugman",
        3,
        "Caramel",
        2,
        "Coffee & TV",
        3,
        "Mellow Song",
        2,
        "No Distance Left To Run",
        3,
        "Optigan 1",
        1,
        "Swamp Song",
        3,
        "Tender",
        1,
        "Trailerpark",
        3,
        "Trimm Trabb",
        2,
        "1992",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Blur\\13\\Cover.jpg",
      "Blurb": "this is not the album with Track 2",
      "NextUpText": "NEXT UP:\n\n18 by Moby\n\nI wonder if this is the album with the Bourne Theme Song (it is)",
      "DatePosted": "2020-11-13T10:00:00,000"
    },
    {
      "Title": "18",
      "Artist": "Moby",
      "ReviewBody": "I've listened to a bunch of moby tracks before this, never a full album, and liked what I've listened too. This album feels very swing-y too me; in the sense that it swings from good to bad throughout the album. It starts out pretty space-y with _We Are All Made of Stars_ but slowely transitions to another just boring slow track _The Great Escape_. After this track the album starts to build up again until it gets to _Extreme Ways_ this was the Bourne trilogy theme song and what initially got me into Moby, and its followed up with _Jam for the Ladies_ which I really like but doesn't fit the theme of the album at all. Unfortunately after this the album really drops off for me. If it wasn't for the two songs I mentioned above this album would be a solid 2, but with those additions it just barely eeks out a 3.",
      "AlbumRating": 3,
      "TrackList": [
        "We Are All Made of Stars",
        3,
        "In This World",
        2,
        "In My Heart",
        2,
        "The Great Escape",
        1,
        "Signs of Love",
        2,
        "One of These Mornings",
        3,
        "Another Woman",
        3,
        "Fireworks",
        2,
        "Extreme Ways",
        4,
        "Jam for the Ladies",
        4,
        "Sunday (the Day before My Birthday)",
        3,
        "18",
        2,
        "Sleep Alone",
        2,
        "At Least We Tried",
        1,
        "Harbour",
        1,
        "Look Back In",
        2,
        "The Rafters",
        2,
        "I'm Not Worried At All",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Moby\\18\\Cover.jpg",
      "Blurb": "I wonder if this is the album with the Bourne Theme Song (it is)",
      "NextUpText": "NEXT UP:\n\n1983 by Flying Lotus\n\nThe first album, arguably one of the greatest showings of his raw talent",
      "DatePosted": "2020-11-16T10:00:00,000"
    },
    {
      "Title": "1983",
      "Artist": "Flying Lotus",
      "ReviewBody": "The first full length album for Flying Flotus. It shows off his talent, but still leaves some room to grow. Overall this album has clear space-y connatations. This album is a mix of finding a groove and then leaving the groove when it starts to get boring. The titular track, _1983_, is a build on the groove, it takes its time to find it and then slowely builds and adds new elements to it over the course of its duration. The complex beat structure with the glitch like fill; makes for a very interesting listen. As soon as you think you understand the tracks, you find something new to enjoy. _Babble_, while not a bad track, I feel is just too short and doesn't really accomplish what it sets out to. One of my few issues with the album is some of the transistions are a little too hard. _Unexpected Delight_ really lives up to its name. The volicity of the backing track makes combined with the haunting vocals by Laura; make for a hypnotic track that doesn't let go of your attention.",
      "AlbumRating": 3,
      "TrackList": [
        "1983",
        3,
        "Sao Paulo",
        3,
        "Bad Actors",
        3,
        "Orbit Brazil",
        3,
        "Shifty",
        3,
        "Babble",
        2,
        "Pet Monster Shotglass",
        3,
        "Hello",
        3,
        "Untitled #7",
        3,
        "Unexpected Delight (Feat. Laura Darlington)",
        4,
        "1983 (Daedulus's Odd-Dance Party Remix)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Flying Lotus\\1983\\Cover.jpg",
      "Blurb": "The first album, arguably one of the greatest showings of his raw talent",
      "NextUpText": "NEXT UP:\n\n200 Million Thousand by The Black Lips\n\nI've never listened to this album in its entirety before",
      "DatePosted": "2020-11-20T10:07:00,000"
    },
    {
      "Title": "200 Million Thousand",
      "Artist": "The Black Lips",
      "ReviewBody": "I had never listened to this album all the way through before. Its a great entry to the garage rock genre in my library. On my first listen I found myself really liking the album. I think on the whole it does better than the individual tracks would suggest, which I don't think is uncommon for this genre. What is a misnomer on this album is the songs I gave a 2 star too. While I enjoyed all these tracks I feel like on a shuffle I would most likely skip them. But this album is fuzzy, warm, and a great jam album. Every track gets you in a groove and then just holds you there until it decides its time to move on. _Short Fuse_ is very reminiscient of a [The Hives](../../Hives,%20TheHives_Artist_Review.md) track, but a little more on the lo-fi side. _Meltdown_, the hidden track on the album (based MusicBee filters out the minutes of silence), would have been a lot lower if I couldn't have filterd the white noise out.",
      "AlbumRating": 4,
      "TrackList": [
        "Take My Heart",
        3,
        "Drugs",
        4,
        "Starting Over",
        2,
        "Let It Grow",
        2,
        "Trapped In A Basement",
        3,
        "Short Fuse",
        4,
        "I'll Be With You",
        2,
        "Big Black Jesus of Today",
        3,
        "Again & Again",
        4,
        "Old Man",
        3,
        "The Drop I Hold",
        3,
        "Body Combat",
        4,
        "Elijah",
        4,
        "I Saw God",
        2,
        "Meltdown (Hidden Track)",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Black Lips, The\\200 Million Thousand\\Cover.jpg",
      "Blurb": "I've never listened to this album in its entirety before",
      "NextUpText": "NEXT UP:\n\n30 Seconds to Mars by 30 Seconds to Mars\n\nDOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "DatePosted": "2020-11-23T10:00:08.413456"
    },
    {
      "Title": "30 Seconds to Mars",
      "Artist": "30 Seconds to Mars",
      "ReviewBody": "Going into this album, I could really only remember their single off their next album [A Beautiful Life](../A%20Beautiful%20Lie/A_Beautiful_Lie_Album_Review.md), _the Kill_, and its more alternative leanings. This album on the other hand has much more of a progressive blend to its sound than I remember of the next album. The song _Edge of the Earth_ is the first track that makes me realize that this album is something special. They managed to make the sound very open, while still keeping that heaviness associated with metal. _Fallen_ really amps up on the space theme. For a first showing from 30 Seconds to Mars, this is a great showing. While not as much to talk about since the album fits the theme it sets pretty well. Overall this album is fantastic and is definitely going back into the rotation.",
      "AlbumRating": 4,
      "TrackList": [
        "Capricorn (A Brand New Name)",
        3,
        "Edge of the Earth",
        4,
        "Fallen",
        3,
        "Oblivion",
        3,
        "Buddha for Mary",
        4,
        "Echelon",
        3,
        "Welcome to the Universe",
        4,
        "The Mission",
        4,
        "End of the Beginning",
        3,
        "93 Million Miles",
        3,
        "Year Zero",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\30 Seconds To Mars\\30 Seconds To Mars\\Cover.jpg",
      "Blurb": "DOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "NextUpText": "NEXT UP:\n\n21st Century Breakdown by Green Day\n\nI hate 21 guns, but let's do this",
      "DatePosted": "2020-11-29T09:36:41.363882"
    }
  ]
}