{
  "Completed": [
    {
      "id": 0,
      "Title": "When Your Heart Stops Beating",
      "Artist": "+44",
      "ReviewBody": "The first and only album from +44, starts off rather strong with _Lycanthrope_. The Energy of this song tells you that that you are in for a classic pop punk album, and it continues for a couple songs until you remember that half of the band is [Blink-182](../../Blink-182/Blink-182_Artist_Review.md) and their last album was [Blink-182](../../Blink-182/Blink-182/Blink-182_Album_Review.md)... The album drops off after _When your Heart Stops Beating_ moving into the more slow, experimental nature that is featured on _Blink-182_. The songs _Little Death_ and _No It Isn't_ are both about the breakup of _Blink-182_, while _Little Death_ isn't a bad song by any means it can start to drag a bit on repeat listens. _No It Isn't_ on the other hand is fantastic build from the more experimental tracks back to the higher energy the album started with. _Make You Smile_ is the absolute best song on the album, the duet nature makes this song an absolute joy.\n\nOverall I think the album is a solid mix of pre-breakup _Blink-182_ and a new evolution of pop punk. The album starts high then dips, but on the oathg the end starts to ramp, in my opinion, higher than the start. Sometimes the more experimental nature feels to drag, but overall I think the album is a solid 3 out of 5",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Lycanthrope",
        3,
        "Baby, Come On",
        3,
        "When Your Heart Stops Beating",
        2,
        "Little Death",
        2,
        "155",
        2,
        "Lillian",
        2,
        "Cliff Diving",
        3,
        "Interlude",
        2,
        "Weatherman",
        2,
        "No It Isn't",
        4,
        "Make You Smile",
        4,
        "Chapter 13",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\+44\\When Your Heart Stops Beating\\Cover.jpg",
      "Genre": [
        "Pop Punk"
      ],
      "Blurb": "",
      "NextUpText": "Oh and Next weeks album is a blast from the past\n\nJustice - (Cross)",
      "DatePosted": "2020-09-27T10:00:00,000"
    },
    {
      "id": 1,
      "Title": "(Cross)",
      "Artist": "Justice",
      "ReviewBody": "Justice, I haven't thought about this band or this album in years, coming back to it though it doesn't really hold the same place for me. The album starts out with _Genesis_ its a nice buildup, telling you what to expect for the next 48 minutes, but feels as though it takes a bit too long to get to its point, this was a tough one since I do like it with the album as a whole but I don't think it holds up on its own merits. _Let There Be Light_ has some interesting charactists, but the extended distorted organ starts to wear thing fairly quickly. The transition between the previous and the next track, _D.A.N.C.E_ is also a little wonky. The radio changing effect between songs is always a little jarring for me, but I guess its not a bad way to transiiton from a slower song to a classic pop bop. Probably the only actual song people know off this album, it is quite the fun dance track bringing in funk elements with a classic 4 on the flour house beat. I do n the whole enjoy this song, but it can be a bit saccharine at times.\nNext up is _Newjack_ and while it does fit with the ascethitic of the album; the consistant high pass filters make it a fairly annoying listen on its own. _Phantom_ is a bit on the noise-y side, which I typically like, but it felt almost a little Jam-y which is not quite what the rest of the album feels like. What else needs to be said about _Phantom Part II_ that hasn't been covered by _Phantom_, it is just a continuation of the previous track and really should just be combined. _Valentine_ is a nice palette cleanser from the previous blocks of tracks. I feel its needed, but the song on its own is not really that great.\nThis album so far might sound like a big miss rather than a nice trip down memory lane, that is until it hits with the next block of tracks, starting with _TThhee PPaarrttyy_. I have mixed feelings about this song, it is quite a great buildup to the next block of tracks, but as a solo play it doesn't really hold its own. _DVNO_ on the other hand, is a straight up jam. Such a fun bop, it almost jumped itself up a whole place. I know what I said about the previous noise-y, jam-y track, but _Stress_ owns it. It almost has a sythwave vibe, even though this album is about 15 years to young for that genre. _Waters Of Nazareth_ continues on the trend of the previous track, but picks up the pace a bit. The ending few tracks of this album are really what solidify the entire albums rating. Finally _One Minute to Midnight_ closes the album out, a nice respite from the last few tracks. Would be a lot higher if it didn't do that stupid minute of dead space at the end.\nOverall I do enjoy the album but it is on the low end of 3 out of 5. The strength of the last half of the album really carries it higher.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.5,
      "TrackList": [
        "Genesis",
        2,
        "Let There Be Light",
        2,
        "D.A.N.C.E.",
        3,
        "Newjack",
        2,
        "Phantom",
        2,
        "Phantom Part II",
        2,
        "Valentine",
        2,
        "TThhee PPaarrttyy",
        3,
        "DVNO",
        4,
        "Stress",
        3,
        "Waters Of Nazareth",
        3,
        "One Minute To Midnight",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Justice\\(Cross)\\Cover.jpg",
      "Genre": [
        "House",
        "Nu-Disco"
      ],
      "Blurb": "Oh and Next weeks album is a blast from the past",
      "NextUpText": "NEXT UP:\n\nits (ONe) by The Panic Channel\n\nWoo, get ready for some but rock",
      "DatePosted": "2020-10-05T10:00:00,000"
    },
    {
      "id": 2,
      "Title": "(ONe)",
      "Artist": "The Panic Channel",
      "ReviewBody": "This album is absolutely atrocious. `But Rock` at its... finest? Do you listen to [_Foo Fighters_](../../Foo%20Fighters/Foo_Fighters_Artist_Review.md) and wish they were more Generic? Then this is the band for you. Unlike most reviews where I listen 3-4 times to get ratings and really see what I think about the album, this time I think 2 listens is really enough. Ranging anywhere from \"this is fine\" to \"please make it stop\" this is not an album I will ever revisit. Its so bad in fact that I am seriously contemplating removing it from my library entirely.",
      "AlbumRating": 1,
      "AlbumFeelingRating": 1,
      "SongAvg": 1,
      "TrackList": [
        "Teahouse Of The Spirits",
        2,
        "Left To Lose",
        2,
        "Bloody Mary",
        2,
        "Why Cry",
        1,
        "Awake",
        2,
        "She Won't Last",
        1,
        "Said You'd Be",
        2,
        "Outsider",
        1,
        "Blue Bruises",
        1,
        "Night One (From Planchette)",
        1,
        "Listen",
        1,
        "Lie Next To Me",
        1,
        "Untitled",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Panic Channel, The\\(ONe)\\Cover.jpg",
      "Genre": [
        "Rock",
        "Alternative",
        "But Rock"
      ],
      "Blurb": "Woo, get ready for some but rock",
      "NextUpText": "NEXT UP:\n\n*.WAV SLAVE by BANDETTO",
      "DatePosted": "2020-10-12T10:00:00,000"
    },
    {
      "id": 3,
      "Title": "*.WAV SLAVE",
      "Artist": "BANDETTO",
      "ReviewBody": "It turns out that I do not have as high a tolerance for Breakcore as I thought I did. The album overall isn't bad but I would like it better if I had a dance pad or some other foux instrument to go along with it. I feel like I don't have too much to say about each of the individual tracks since they blend together so much. With few standouts like _barf city_ and _amnesiac_ the album is fun but its really nothing special. A good listen if you are in the mood to party, but as an album to just listen to its just mediocre. ",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2,
      "TrackList": [
        "bouncy castle boogie",
        2,
        "disco bombing",
        2,
        "gameshark",
        2,
        "barf city",
        3,
        "fierce fortune",
        3,
        "amnesiac",
        3,
        "need u",
        2,
        "scorch shuffle",
        2,
        "on the hunt",
        2,
        "rhythm guide",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\BANDETTO\\-.WAV SLAVE\\BANDETTO - -.WAV SLAVE - cover.png",
      "Genre": [
        "Experimental Breakcore"
      ],
      "Blurb": "",
      "NextUpText": "NEXT UP:\n\n...And Out Come the Wolves by Rancid",
      "DatePosted": "2020-10-19T10:00:00,000"
    },
    {
      "id": 4,
      "Title": "...And Out Come The Wolves",
      "Artist": "Rancid",
      "ReviewBody": "This album hops from absolute banger to banger. Not a dead spot to be found. Starts out strong with _Maxwell Murder_, pulling into the power chord chorus of _The 11th Hour_. The ablum starts to really pick up with _Time Bomb_, its got that catchy chorus that breaks right into that classic ska breakdown. _Olympia WA_ has that shredding solo to prove that they can do more than just power chords. You can really feel the punk roots showing in _Lock, Step & Gone_, sounds just like a Clash song turned just a little more modern. And the titular track of the album, _Junkie Man_, even though the title is just part of of the outro of the song. _Listed M.I.A._ brings home how different, yet the same every track on this album is. I am definitely showing my bias towards loud, fast, punk music here. _Ruby Soho_ The best track on the album, even though Punk isn't supposed to be chorus heavy, Ska is on the other hand. So far this also marks the first 5 star song rating I have given out, hopefully got some more coming. The next few songs: _Daily City Train_, _Journey to the End of East Bay_, and _She's Automatic_; are all not bad songs, but nothing worth really pointing out. _Old Friend_ really starts to brings back the classic ska stroke.  _Disorder and Disarray_ Is in my opinion the last hurrah of this album, everything after is still good but nothing super memorable.\n\nOverall this has been my favorite album of the relisten so far. This album hits every chord for a fun, ska-punk, album should. This album is definitely going back into heavy rotation.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "Maxwell Murder",
        3,
        "The 11th Hour",
        3,
        "Roots Radicals",
        3,
        "Time Bomb",
        4,
        "Olympia WA",
        3,
        "Lock, Step & Gone",
        4,
        "Junkie Man",
        3,
        "Listed M.I.A.",
        4,
        "Ruby Soho",
        5,
        "Daily City Train",
        3,
        "Journey to the end of the East Bay",
        3,
        "She's Automatic",
        3,
        "Old Friend",
        3,
        "Disorder and Disarray",
        4,
        "The Wars End",
        3,
        "You Don't Care Nothin'",
        3,
        "As Wicked",
        3,
        "Avenues & Alleyways",
        3,
        "The Way I Feel",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Rancid\\And Out Come the Wolves\\Cover.jpg",
      "Genre": [
        "Punk Rock",
        "Ska Punk"
      ],
      "Blurb": "",
      "NextUpText": "NEXT UP:\n\n[ Movements ] by Solar Fields\n\nI think this is a video game soundtrack, idk?",
      "DatePosted": "2020-10-26T10:00:00,000"
    },
    {
      "id": 5,
      "Title": "[ Movements ]",
      "Artist": "Solar Fields",
      "ReviewBody": "So Heres the hard part about reviewing Ambient Albums, I like ambient but only in certain situations and moods. So while I do enjoy this album, it is not something I could see myself really listening to all that often. The Album does start strong with a nice long build on _Sol_, then kind of chills out and meanders a while for tracks like _Circles of Motion_ and _Discovering_. _The Stones are not too Busy_ starts to pick it back up over its 10 minute duration, but then again starts to chill out again. I have a hard time of coming up with new things to say about an ambient track, becuase you aren't really supposed to _Listen_ to them, so much as they are supposed to be background noise to help you focus or put you in a mood. Its the same way with a lot of Post rock for me as well. _Das Bungalow_ is pulling me back in, I like a bit of up-tempo with my ambient. I could very easily see this album being the OST for a space puzzle game. Its got that nice open sound while still holding you in the moment, it has a nice air-y breath-y sound qualities as well.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2,
      "TrackList": [
        "Sol",
        3,
        "Circles of Motion",
        2,
        "Discovering",
        2,
        "Sky Trees",
        2,
        "The Stones are not too Busy",
        3,
        "Dust",
        2,
        "Das Bungalow",
        3,
        "Feeling (Album edit)",
        2,
        "Patterns",
        2,
        "The Road to Nothingness",
        3,
        "Breeze",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Solar Fields\\[ Movements ]\\Cover.jpg",
      "Genre": [
        "Ambient"
      ],
      "Blurb": "I think this is a video game soundtrack, idk?",
      "NextUpText": "NEXT UP:\n\n10,000 Days by Tool\n\ny'all are seriously sleeping on Tool",
      "DatePosted": "2020-11-02T10:00:00,000"
    },
    {
      "id": 6,
      "Title": "10,000 Days",
      "Artist": "Tool",
      "ReviewBody": "This album was my introduction to Tool. I liked it at the time but I didn't quite appreciate it until I got older. The way they bend progressive tendancies with metal is jaw dropping. The opening track, _Vicarious_, has this awesome slow build until it gets into the song proper. I think a lot of people just associate Tool with the people who like Tool, instead of necassarily appreciating the music for what it is. The album meanders a bit for a few tracks, it has an interesting build with _Wings For Marie_ but the payoff in _10,000 Days_ isn't quite enough for me. The Everything changes when we get to the song _The Pot_ this song is fantastic, and the first Tool song I ever heard. remember how I said everything was changing, that was wishful thinking. The next two tracks _Lipan Conjuring_ and _Lost Keys (Blame Hofmann)_, are just noise/intermission tracks. Have I ever mentioned how much I hate when artists do this. HOOO BOYYY. Next up is _Rosetta Stoned_, eleven minutes and eleven seconds of pure jam, if it was shorter it might get the coveted five out of five. The album keeps doing this flip flop of really solid tracks with just noise, it would be different if the noise tracks led into the others, but they seem to be there just to be there. _Right in Two_ brings the album back right into that groove. The last track on the album, _Viginti Tres_, is another just noise track.\n\nI really like the album overall, but the noise tracks really hamper it from being a fantastic album.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 4,
      "SongAvg": 2.6,
      "TrackList": [
        "Vicarious",
        3,
        "Jambi",
        3,
        "Wings For Marie (Part 1)",
        3,
        "10,000 Days (Wings Part 2)",
        2,
        "The Pot",
        5,
        "Lipan Conjuring",
        1,
        "Lost Keys (Blame Hofmann)",
        1,
        "Rosetta Stoned",
        4,
        "Intension",
        2,
        "Right In Two",
        4,
        "Viginti Tres",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Tool\\10,000 Days\\Cover.jpg",
      "Genre": [
        "Progressive Metal"
      ],
      "Blurb": "y'all are seriously sleeping on Tool",
      "NextUpText": "NEXT UP:\n\n1039 SMoothed Out Slappy Hours by Green Day\n\nit's basically a compilation of all their early albums and eps",
      "DatePosted": "2020-11-06T10:00:00,000"
    },
    {
      "id": 7,
      "Title": "1039 Smoothed Out Slappy Hours",
      "Artist": "Green Day",
      "ReviewBody": "This album is a compilation of Green Days Frist album and a few of their early EPs. As far as it goes it is a great listen, theres a few notable tracks, but for the most part it is just bog standard Punk. _The Judge's Daughter_ is a notable standout for me, the shredding solo at the end really kicks the song up a notch. HOLY SHIT, I take it all back. The second half of this album fucking kicks ass, _Dry Ice_ to _The One I Want_ are absolute bangers, this album might skew higher than my initial reactions. Nice mix of catchy but also in your face. You can definitely see how Green Day will transition to pop punk as they get older, but right now this album is exactl waht Late 80s, early 90s punk was about. This album really shows the musicianship of the group, it starts off with power chord after power chord, but then it evolves over the course of the album and you can see those roots and then see how it grows past them.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "At the Library",
        3,
        "Don't Leave Me",
        3,
        "I was There",
        3,
        "Disappearing Boy",
        2,
        "Green Day",
        3,
        "Going to Pasalacqua",
        2,
        "16",
        3,
        "Road to Acceptance",
        3,
        "Rest",
        1,
        "The Judge's Daughter",
        4,
        "Paper Lanters",
        3,
        "Why do you Want Him",
        4,
        "409 in Your Coffeemaker",
        3,
        "Knowledge",
        2,
        "1000 Hours",
        3,
        "Dry Ice",
        4,
        "Only of You",
        4,
        "The One I Want",
        4,
        "I Want to Be Alone",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Green Day\\1039 Smoothed Out Slappy Hours\\Cover.jpg",
      "Genre": [
        "Punk Rock"
      ],
      "Blurb": "it's basically a compilation of all their early albums and eps",
      "NextUpText": "NEXT UP:\n\n13 by Blur\n\nthis is not the album with Track 2",
      "DatePosted": "2020-11-09T10:00:00,000"
    },
    {
      "id": 8,
      "Title": "13",
      "Artist": "Blur",
      "ReviewBody": "I've never actually listened to this Blur album all the way through before. I can't say I've ever really found myself so wishy washy on an album before. I seemed to alternate every track, with either liking it or hating it. _Coffee & TV_ was surprising hit on the album for me, but apart from that it was pretty touch and go. _Optigan 1_ was your standard noise interlude, which I hate, and then _Tender_, seven minutes of a boring slow song, no thank you. Overall I didn't hate this album, but I didn't really find anything special in it that I really liked.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2.3,
      "TrackList": [
        "B.L.U.R.E.M.I.",
        3,
        "Battle",
        2,
        "Bugman",
        3,
        "Caramel",
        2,
        "Coffee & TV",
        3,
        "Mellow Song",
        2,
        "No Distance Left To Run",
        3,
        "Optigan 1",
        1,
        "Swamp Song",
        3,
        "Tender",
        1,
        "Trailerpark",
        3,
        "Trimm Trabb",
        2,
        "1992",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Blur\\13\\Cover.jpg",
      "Genre": [
        "Art Rock",
        "Experimental Rock"
      ],
      "Blurb": "this is not the album with Track 2",
      "NextUpText": "NEXT UP:\n\n18 by Moby\n\nI wonder if this is the album with the Bourne Theme Song (it is)",
      "DatePosted": "2020-11-13T10:00:00,000"
    },
    {
      "id": 9,
      "Title": "18",
      "Artist": "Moby",
      "ReviewBody": "I've listened to a bunch of moby tracks before this, never a full album, and liked what I've listened too. This album feels very swing-y too me; in the sense that it swings from good to bad throughout the album. It starts out pretty space-y with _We Are All Made of Stars_ but slowely transitions to another just boring slow track _The Great Escape_. After this track the album starts to build up again until it gets to _Extreme Ways_ this was the Bourne trilogy theme song and what initially got me into Moby, and its followed up with _Jam for the Ladies_ which I really like but doesn't fit the theme of the album at all. Unfortunately after this the album really drops off for me. If it wasn't for the two songs I mentioned above this album would be a solid 2, but with those additions it just barely eeks out a 3.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.3,
      "TrackList": [
        "We Are All Made of Stars",
        3,
        "In This World",
        2,
        "In My Heart",
        2,
        "The Great Escape",
        1,
        "Signs of Love",
        2,
        "One of These Mornings",
        3,
        "Another Woman",
        3,
        "Fireworks",
        2,
        "Extreme Ways",
        4,
        "Jam for the Ladies",
        4,
        "Sunday (the Day before My Birthday)",
        3,
        "18",
        2,
        "Sleep Alone",
        2,
        "At Least We Tried",
        1,
        "Harbour",
        1,
        "Look Back In",
        2,
        "The Rafters",
        2,
        "I'm Not Worried At All",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Moby\\18\\Cover.jpg",
      "Genre": [
        "Electronica",
        "Downtempo"
      ],
      "Blurb": "I wonder if this is the album with the Bourne Theme Song (it is)",
      "NextUpText": "NEXT UP:\n\n1983 by Flying Lotus\n\nThe first album, arguably one of the greatest showings of his raw talent",
      "DatePosted": "2020-11-16T10:00:00,000"
    },
    {
      "id": 10,
      "Title": "1983",
      "Artist": "Flying Lotus",
      "ReviewBody": "The first full length album for Flying Flotus. It shows off his talent, but still leaves some room to grow. Overall this album has clear space-y connatations. This album is a mix of finding a groove and then leaving the groove when it starts to get boring. The titular track, _1983_, is a build on the groove, it takes its time to find it and then slowely builds and adds new elements to it over the course of its duration. The complex beat structure with the glitch like fill; makes for a very interesting listen. As soon as you think you understand the tracks, you find something new to enjoy. _Babble_, while not a bad track, I feel is just too short and doesn't really accomplish what it sets out to. One of my few issues with the album is some of the transistions are a little too hard. _Unexpected Delight_ really lives up to its name. The volicity of the backing track makes combined with the haunting vocals by Laura; make for a hypnotic track that doesn't let go of your attention.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "1983",
        3,
        "Sao Paulo",
        3,
        "Bad Actors",
        3,
        "Orbit Brazil",
        3,
        "Shifty",
        3,
        "Babble",
        2,
        "Pet Monster Shotglass",
        3,
        "Hello",
        3,
        "Untitled #7",
        3,
        "Unexpected Delight (Feat. Laura Darlington)",
        4,
        "1983 (Daedulus's Odd-Dance Party Remix)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Flying Lotus\\1983\\Cover.jpg",
      "Genre": [
        "Trip Hop"
      ],
      "Blurb": "The first album, arguably one of the greatest showings of his raw talent",
      "NextUpText": "NEXT UP:\n\n200 Million Thousand by The Black Lips\n\nI've never listened to this album in its entirety before",
      "DatePosted": "2020-11-20T10:07:00,000"
    },
    {
      "id": 11,
      "Title": "200 Million Thousand",
      "Artist": "The Black Lips",
      "ReviewBody": "I had never listened to this album all the way through before. Its a great entry to the garage rock genre in my library. On my first listen I found myself really liking the album. I think on the whole it does better than the individual tracks would suggest, which I don't think is uncommon for this genre. What is a misnomer on this album is the songs I gave a 2 star too. While I enjoyed all these tracks I feel like on a shuffle I would most likely skip them. But this album is fuzzy, warm, and a great jam album. Every track gets you in a groove and then just holds you there until it decides its time to move on. _Short Fuse_ is very reminiscient of a [The Hives](../../Hives,%20TheHives_Artist_Review.md) track, but a little more on the lo-fi side. _Meltdown_, the hidden track on the album (based MusicBee filters out the minutes of silence), would have been a lot lower if I couldn't have filterd the white noise out.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Take My Heart",
        3,
        "Drugs",
        4,
        "Starting Over",
        2,
        "Let It Grow",
        2,
        "Trapped In A Basement",
        3,
        "Short Fuse",
        4,
        "I'll Be With You",
        2,
        "Big Black Jesus of Today",
        3,
        "Again & Again",
        4,
        "Old Man",
        3,
        "The Drop I Hold",
        3,
        "Body Combat",
        4,
        "Elijah",
        4,
        "I Saw God",
        2,
        "Meltdown (Hidden Track)",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Black Lips, The\\200 Million Thousand\\Cover.jpg",
      "Genre": [
        "Garage Punk",
        "Psychedelic Rock"
      ],
      "Blurb": "I've never listened to this album in its entirety before",
      "NextUpText": "NEXT UP:\n\n30 Seconds to Mars by 30 Seconds to Mars\n\nDOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "DatePosted": "2020-11-23T10:00:08.413456"
    },
    {
      "id": 12,
      "Title": "30 Seconds to Mars",
      "Artist": "30 Seconds to Mars",
      "ReviewBody": "Going into this album, I could really only remember their single off their next album [A Beautiful Life](../A%20Beautiful%20Lie/A_Beautiful_Lie_Album_Review.md), _the Kill_, and its more alternative leanings. This album on the other hand has much more of a progressive blend to its sound than I remember of the next album. The song _Edge of the Earth_ is the first track that makes me realize that this album is something special. They managed to make the sound very open, while still keeping that heaviness associated with metal. _Fallen_ really amps up on the space theme. For a first showing from 30 Seconds to Mars, this is a great showing. While not as much to talk about since the album fits the theme it sets pretty well. Overall this album is fantastic and is definitely going back into the rotation.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Capricorn (A Brand New Name)",
        3,
        "Edge of the Earth",
        4,
        "Fallen",
        3,
        "Oblivion",
        3,
        "Buddha for Mary",
        4,
        "Echelon",
        3,
        "Welcome to the Universe",
        4,
        "The Mission",
        4,
        "End of the Beginning",
        3,
        "93 Million Miles",
        3,
        "Year Zero",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\30 Seconds To Mars\\30 Seconds To Mars\\Cover.jpg",
      "Genre": [
        "Progressive Metal"
      ],
      "Blurb": "DOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "NextUpText": "NEXT UP:\n\n21st Century Breakdown by Green Day\n\nI hate 21 guns, but let's do this",
      "DatePosted": "2020-11-29T09:36:41.363882"
    },
    {
      "id": 13,
      "Title": "21st Century Breakdown",
      "Artist": "Green Day",
      "ReviewBody": "This album should have been called `Billie Armstrong Wants to Make The Black Parade`. I think this album was so supposed to be reminiscient of the the entire 2000-2010 decade. Listening through you can tell the obvious influences with _Murder City_ being something off of [The Black Parade](../../My%20Chemical%20Romance/The%20Black%20Parade/The_Black_Parade_Album_Review.md). Off the same album _21st Century Breakdown_ feels like it wants to be that bombastic anthem that _Welcome to the Black Parade_ is. _Know Your Enemy_ is reminiscient of some of their own earlier work, like something off of [Warning](../Warning/Warning_Album_Review.md). Even the next track _Viva La Gloria!_ sounds familair to their older work, specifically [American Idiot](../American%20Idiot/American_Idiot_Album_Review.md). Skipping a bit ahead _Last of the American Girls_ sounds like the intro song to a mid 2000s teen girl movie. _Restless Heart Syndrome_, even though it has such a ripping solo, it just takes too long to get anywhere that I don't find myself wanting to wait to get to the good part. _Horseshoes and Handgrenades_ feels like a straight rip off of [The Hives](../../Hives,%20The/The_Hives_Artist_Review.md).\n\tThis is the second album by Green Day that is supposed to be a \"Punk Rock Opera\", the first being _American Idiot_, but this album feels a bit disengenous to me. Maybe I am being too harsh on this album; if you think it about it another way this album came out at the end of the decade so maybe they were just trying to highlight the previous decades punk, emo, and emo anthems into a rock opera. To me though I think it feels more like they are apeing the sounds they are trying to pay homage too.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 1.9,
      "TrackList": [
        "Song of the Century",
        1,
        "21st Century Breakdown",
        2,
        "Know Your Enemy",
        2,
        "Viva La Gloria!",
        2,
        "Before the Lobotomy",
        1,
        "Christian's Inferno",
        3,
        "Last Night on Earth",
        1,
        "East Jesus Nowhere",
        3,
        "Peacemaker",
        2,
        "Last of the American Girls",
        2,
        "Murder City",
        3,
        "Viva La Gloria? (Little Girl)",
        1,
        "Restless Heart Syndrome",
        2,
        "Horseshoes and Handgrenades",
        3,
        "The Static Age",
        2,
        "21 Guns",
        1,
        "American Eulogy: Mass Hysteria/Modern World",
        2,
        "See the Light",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Green Day\\21st Century Breakdown\\Cover.jpg",
      "Genre": [
        "Pop Punk",
        "Alternative"
      ],
      "Blurb": "I hate 21 guns, but let's do this",
      "NextUpText": "NEXT UP:\n\n40oz. to Freedom by Sublime\n\nThis is not the one with all the bangers",
      "DatePosted": "2020-11-30T10:00:07.132488"
    },
    {
      "id": 14,
      "Title": "40oz. to Freedom",
      "Artist": "Sublime",
      "ReviewBody": "The first album from Sublime. Who knew they would be such a break out hit after this. The album doesn't feel very cohesive throughout, seeing as the genre shifts each track. This album did a few standouts that I don't think I had listened too before, such as: _We're Only Gonna Die for our Arrogance_, _54-46 That's My Number/Ball and Chain_, and _What Happened_. The mix of sampling on this album is a reall interesting, typically somethign I really enjoy and that holds true here as well. It was fun to relisten to this album and hear some tracks I haven't listened to in years. Although songs like _Badfish_ or _Smoke Two Joints_ have just been played so many times growing up that Idk if I can really listen to them anymore. But this album deserves it's four star rating not much to say other than who hasn't listened to this album and who doesn't think it's good.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.2,
      "TrackList": [
        "Waiting for My Ruca",
        2,
        "40oz. to Freedom",
        3,
        "Smoke Two Joints",
        3,
        "We're Only Gonna Die for Our Arrogance",
        5,
        "Don't Push",
        4,
        "54-46 That's My Number/Ball and Chain",
        4,
        "Badfish",
        2,
        "Let's Go Get Stoned",
        3,
        "New Thrash",
        4,
        "Scarlet Begonias",
        3,
        "Live at E's",
        3,
        "D.J.s",
        3,
        "Chica Me Tipo",
        4,
        "Right Back",
        3,
        "What Happened",
        4,
        "New Song",
        3,
        "Ebin",
        4,
        "Date Rape",
        3,
        "Hope",
        3,
        "KRS-One",
        3,
        "Rivers of Babylon",
        2,
        "Thanx",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Sublime\\40oz. to Freedom\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Reggae Rock"
      ],
      "Blurb": "This is not the one with all the bangers",
      "NextUpText": "NEXT UP:\n\n44 by The Mayan Factor\n\nImagine Tool, but Weirder",
      "DatePosted": "2020-12-04T10:00:02.889284"
    },
    {
      "id": 15,
      "Title": "44",
      "Artist": "The Mayan Factor",
      "ReviewBody": "My intial thoughts on the album was that it was just another Tool clone, but that is not entirely true. The album has a more experimental feel to it, then even Tool does. The whole album has a really ancient feel to it, with the chanting and marracas. in some songs it has this nice blend of the progressive with some alternative bent to it. Some songs almost feel like Tool x R.E.M.. _44_ is definitely stronger in the first half then the second half. While I don't have a ton to say about this album, I think it's really good and is definitely worth checking out.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.9,
      "TrackList": [
        "To Kill a Priest",
        4,
        "Terrorist",
        4,
        "Propaganda",
        3,
        "Hopi Elders",
        3,
        "Ventriloquist",
        3,
        "Gosia",
        2,
        "Yesterdays Son",
        2,
        "Bondage",
        4,
        "A Red Gone Blue",
        3,
        "Jack Nicholson",
        2,
        "Recon",
        2,
        "Self Storage",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mayan Factor, The\\44\\Cover.jpg",
      "Genre": [
        "Progressive Rock",
        "Art Rock"
      ],
      "Blurb": "Imagine Tool, but Weirder",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-11T11:37:34.644246"
    },
    {
      "id": 16,
      "Title": "99 songs of Revolution",
      "Artist": "Streetlight Manifesto",
      "ReviewBody": "An Album of Covers, the project was initally started by Bandits of the Acoutstic Revolution. Seeing as this album was called Volume 1 I was kind of assuming there would be a volume 2 but I have not read anything about a potential volume 2 anywhere. Each track on this album is a cover, redone in the signature stye of Streetlight Manifesto. The covers are, in order: Mason Jennings, Squirrel Nut Zippers, Radiohead, Bad Religion, The Dead Milkmen, NOFX, Paul Simon, Bandits of the Acoustic Revolution, Paul Simon, Luis Jordan, and The Postal Service. The Cover of the Bad Religion song will be really interesting to compare to the orignal since I have that track in the library somehwere. What's really interesting about this album is they do a good job of making the covers sound different, but they still have the soul of the original. I think the cover/pairing that does this the best is Hurt by NIN that was covered by Johnny Cash. The song Just, even without knowing that it was a Radiohead song, you can still hear the chord progressions and the fill they tend to use on their songs bleed through the cover as well. What really drew me to this album was their cover of The Postal Service's Such Great Heights, there are thousands, I mean, thousands of covers of this song, but Streetlight actually managed to do the track in a different style so it feels different and unique but you can still see the soul. We've been having a great streak with the strong reviews, let's hope that trend continues.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.5,
      "TrackList": [
        "Birds Flying Away",
        3,
        "Hell",
        4,
        "Just",
        4,
        "Skyscraper",
        3,
        "Punk Rock Girl",
        4,
        "Linoleum",
        2,
        "Me and Julio Down by the Schoolyard",
        3,
        "They Provide the Paint for the Picture-Perfect Masterpiece That You Will Paint on the Insides of Your Eyelids",
        4,
        "Red Rubber Ball",
        3,
        "The Troubador",
        4,
        "Such Great Hieghts",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mayan Factor, The\\44\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Third-Wave Ska"
      ],
      "Blurb": "Imagine Tool, but Weirder",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-11T11:37:34.644246"
    },
    {
      "id": 17,
      "Title": "#501",
      "Artist": "MidiCronica",
      "ReviewBody": "So I was initally very interested in this album since Midicronica did the end track for Samurai Champloo. Samurai Champloo always had a fantastic soundtrack, blending a more traditional Japanese sound with the modern, at the time, hip hop sound. Unfortunately I am missing a few tracks on this album, but with my reception to the other tracks, I am not sure if they would have helped the score on this review overall. What gets me about this album is that I like the beats behind the tracks, but its one of the guys in the group has a really grating sound to me and they seem to feature him in every single song. This album also does the classic hip hop thing of including a ton of sample tracks or skits, which hurt this album overall in my opinion. Then you get to the track _San Francisco_ and it all comes back, the groovey nature of the track just puts you in a good mood. It might just be my initial bias towards the show, but this track would have made a fantastic closing track. Well here ends the streak of strong reviews, I have a few tracks that I will keep in mind going forward, but overall I think this album will stay buried in the library.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2,
      "TrackList": [
        "Operator To Help You",
        1,
        "g",
        2,
        "Blue Velvet",
        2,
        "Jet Set Radio",
        2,
        "Tanoshii Drive",
        2,
        "Star Drive feat. 893 aka La Melomania",
        3,
        "Missing",
        0,
        "Skit",
        1,
        "San Francisco",
        4,
        "Pillow Jam",
        3,
        "Steroid",
        1,
        "Kido feat. 967 aka Gumuna",
        1,
        "Missing",
        0,
        "S501",
        2,
        "Deep Blue feat. Con-NYC",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\MidiCronica\\#501\\Cover.jpg",
      "Genre": [
        "Hip Hop",
        "J/Hip Hop"
      ],
      "Blurb": "They did some of the Samurai Champloo music",
      "NextUpText": "NEXT UP:\n\nA Beautiful Lie by 30 Seconds to Mars\n\nMore alternative, its probably garbage, but I liked it 10 years ago!",
      "DatePosted": "2020-12-16T12:06:50.293507"
    },
    {
      "id": 18,
      "Title": "A Beautiful Lie",
      "Artist": "30 Seconds to Mars",
      "ReviewBody": "Now this is the album I was thinking of when I saw the first 30STM album pop up. The songs _The Kill_ and _From Yesterday_ were all over the radio when this album came out, like you couldn't escape them at all. While the first album from 30STM was a more progressive metal sound, this album seem to forgo both the metal and progressive stint from that album and move distinctly into the alternative realm; probably where the money is at compared to progressive and metal. The singles still definitely hold up, albeit not quite as high as I remember, but they were still very good. What this album does carry over from their first, is the spacey quality. The tracks sound very open, or airy, and that mixed with some of the oppressive riffs, really do a good job of setting the scene. Even though this album moves more into that alternative realm, in some ways its almost more ambitious than the first album. But with that ambition not every lands. So while not a fantastic album, still a pretty good one. This also marks the end of the **number/symbol** albums and we are now in the **A** territory.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Attack",
        3,
        "A Beautiful Lie",
        3,
        "The Kill",
        4,
        "Was It A Dream?",
        3,
        "The Fantasy",
        3,
        "Savior",
        3,
        "From Yesterday",
        4,
        "The Story",
        2,
        "R-Evolve",
        4,
        "A Modern Myth",
        3,
        "The Battle of One",
        3,
        "Hunter",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\30 Seconds To Mars\\30 Seconds To Mars\\Cover.jpg",
      "Genre": [
        "Alternative"
      ],
      "Blurb": "More alternative, its probably garbage, but I liked it 10 years ago!",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-18T10:15:03.670155"
    },
    {
      "id": 19,
      "Title": "'64-'95",
      "Artist": "Lemon Jelly",
      "ReviewBody": "A concept well shown is happening within this album. Each track is titled a year aka the title, the year is important here because that is when the sampled tracks were created. So basically this album is a showcase of specific samples how you can create something new with the old. This album generally starts off a little on the droning side for me, it has an unnecassary talking track to start it off, and then builds into a cosntant rising action to kind of set the tone for whats to come. But other than that the start of the album is rather slow. It does start to pick up after the halfway point with some tracks that will definitely be making it a more heavy rotation. The sole reason I bought this album years ago, was for _'64 aka Go_, this track has a groovey, mystical kind of quality to it. It feels as though you are on a quest traveling through the Desert. It might also not be instantly noticable, but the vocal sample is from William Shatner.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.2,
      "TrackList": [
        "It Was...",
        1,
        "'88 aka Come Down on Me",
        3,
        "'68 aka Only Time",
        3,
        "'93 aka Don't Stop Now",
        2,
        "'95 aka Make Things Right",
        3,
        "'79 aka The Shouty Track",
        3,
        "'75 aka Stay With You",
        4,
        "'76 aka The Slow Train",
        4,
        "'90 aka A Man Like Me",
        4,
        "'64 aka Go",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Lemon Jelly\\'64-'95\\Cover.jpg",
      "Genre": [
        "Electronica"
      ],
      "Blurb": "It's drug music!",
      "NextUpText": "NEXT UP:\n\nA Broken Frame by Depeche Mode\n\nlooking forward to diving back into this band",
      "DatePosted": "2020-12-21T10:00:02.072903"
    },
    {
      "id": 20,
      "Title": "A Broken Frame",
      "Artist": "Depeche Mode",
      "ReviewBody": "Oh Depeche Mode, the originators of synth pop as we know it and you can definitely see the origins here. The ablum starts out on a bit of a slow note with _Leave in Silence_, but it slowely builds throughout the track, not to some grand crescendo, but definitely enough to keep your interest throughout. The energy stays at that mellow, yet still dancy level in the next track _My Secret Garden_. _Monument_ starts out with this intrigueing beat to start off with. At this point I was starting to lose a bit of interest after multiple listens, feeling that there was something missing from the composition. Then _See You_ comes on, and picks up the pace by quite a lot. _Satallite_ almost feels like an electronic reggea song, its got the skanking bum-pause-bum-bum thing going one (there's got to be a better way to describe that). _The Meaning of Love_ is just a classic, right up there with _Just Can't Get Enough_. Now the following track _Further Excerpts From: My Secret Garden_ is rather interesting, it almost feels like a part 2 instead of a revisit of the main song. It really takes the melancholy this album has been brewing and takes it one notch darker instead. Its also interesting that it wasn't placed after the song is revisiting. Overall the album does a great job of being *A Mood*, but sometimes it leaves a little to be desired, even though its a solid album all around.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Leave in Silence",
        3,
        "My Secret Garden",
        3,
        "Monument",
        3,
        "Nothing to Fear",
        3,
        "See you",
        3,
        "Satalite",
        3,
        "The Meaning of Love",
        4,
        "Further Excerpts From: My Secret Garden",
        3,
        "A Photograph of You",
        4,
        "Shouldn't Have Done That",
        3,
        "The Sun & the Rainfall",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Depeche Mode\\A Broken Frame\\Cover.png",
      "Genre": [
        "New Wave",
        "Synth-Pop"
      ],
      "Blurb": "looking forward to diving back into this band",
      "NextUpText": "NEXT UP:\n\nA Deathgrip On Yesterday by Atreyu\n\noh fuck yeah, I haven't listed to this album in like 10 years",
      "DatePosted": "2020-12-25T10:05:57.597312"
    },
    {
      "id": 21,
      "Title": "A Deathgrip On Yesterday",
      "Artist": "Atreyu",
      "ReviewBody": "A classic album. I think I wore the cd out when I was in middle/high school. That first sharp intake of breath on _Creature_ always gets me in a mood. This album is full of angst, from the vocals to the guitars, to every fiber of every song. Even back when I first started listening to this album; I usually really dislike the more melodic-chanting type of chorus; I fell in love with choruses, they act as a nice break from the more heavy screaming centric verses. I think with _The Theft_, being the standout single from this album, always fell a bit short for me. I think the magic of the melodic/hardcore mashup didn't really work as well with this track as it has done with other tracks. Now _Ex's and Oh's_ on the other hand, what a catchy track. Everything about that track gets me absolutely pumped up. The song _My Fork in the Road..._ even though it got a three has a sick guitar solo that is defintiely worth checking out. Over all the album is just a bunhc of nostalgia for me, I still like it, but I don't know if I would like it as much if I didn't love it so much as a kid.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4,
      "TrackList": [
        "Creature",
        4,
        "Shameful",
        4,
        "Our Sick Story (Thus Far)",
        3,
        "The Theft",
        3,
        "We Stand Up",
        3,
        "Ex's And Oh's",
        5,
        "Your Private War",
        4,
        "My Fork In The Road (Your Knife In My Back)",
        3,
        "Untitled Finale",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Atreyu\\A Deathgrip On Yesterday\\Cover.jpg",
      "Genre": [
        "Melodic Metalcore"
      ],
      "Blurb": "oh fuck yeah, I haven't listed to this album in like 10 years",
      "NextUpText": "NEXT UP:\n\nA Jacknife to a Swan by The Mighty Mighty Bosstones\n\nWoo more ska!",
      "DatePosted": "2020-12-28T12:46:57.932689"
    },
    {
      "id": 22,
      "Title": "A Jacknife to a Swan",
      "Artist": "The Mighty Mighty Bosstones",
      "ReviewBody": "Oh The Mighty Mighty Bosstones, a ska classic. I don't think I had ever actually listened to this album all the way through before. It definitely has that early 2000's feel to it, got some slightly pop-punkier vibes than some of their earlier work. The album starts out strong with _A Jackknight to a Swan_. _Mr. Moran_ opens with a sample from some old movie or something, and I don't know why but I am always a sucker for those. _You Gotta Go!_ is: \"Pick it up, Pick it up, Pick it up!\" the song. The ablum definitely sllows down quite a bit with _Everybody's Better_. This song defintely has a kind of rocksteady vibe to it. The next two tracks, _Sugar Free_ and _I Want My City Back_, both take it back up to the ska punk that you would expect of the Bosstones. Nothing really much to say, they are solid tracks but don't really change, or mix anything up. I will say the mix of the ska punk sound with the rocksteady vibes does do a good job of breaking the album the album. I personally am not such a big fan of the rocksteady but it is nice in small doses. The opening of _The Old School Off the Bright_ starts out as kind of a bepop beat, I wish it stuck with it a bit longer before transitioning into the punk banger. _The Punch Line_ is definetly one of the highs of this album, just a classic Bosstones track. The Organ on _Shit Outta Luck_ is always a highlight for me, I don't know what it is about that organ sound but I can't get enough of it. Overall this album is a ska classic, it doesn't really do anything special but its by no means bad.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "A Jackknife To A Swan",
        4,
        "Mr. Moran",
        3,
        "You Gotta Go!",
        4,
        "Everybody's Better",
        2,
        "Sugar Free",
        3,
        "I Want My City Back",
        3,
        "Chasing The Sun Away",
        3,
        "You Can't Win",
        3,
        "THe Old School Off The Bright",
        3,
        "The Punch Line",
        4,
        "Go Big",
        3,
        "Shit Outta Luck",
        3,
        "7-Ways to Sunday",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mighty Mighty Bosstones, The\\A Jackknife To A Swan\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Third-Wave Ska"
      ],
      "Blurb": "Woo more ska!",
      "NextUpText": "NEXT UP:\n\nA Lesson in the Abuse of Information Technology by The Menzingers\n\nWhile this isn't my favorite album from them, the album is still pretty good",
      "DatePosted": "2021-01-01T10:00:11.425381"
    },
    {
      "id": 23,
      "Title": "A Lesson in the Abuse of Information Technology",
      "Artist": "The Menzingers",
      "ReviewBody": "The first full length album from Pennsylvania based Menzingers. This album is a classic example of mid 2000's punk. The album definitely starts out strong, but really comes into it's own during the titular track. You can definitely see the roots of some of their most popular tracks beginning to take hold here. _Ave Maria_ my favorite track off the album, it has this nostalgic quality to it. _Coal City Blues_ just drops the pace of the album, I know its basically a requirment for punk bands to have atleast one or two slow songs but they are always my least favorite on the album. The next track, _Keychain_, brings us right back to the action. that first line always gets me hyped \"I feel my teeth turning black...\". _Even for an Eggshell_ is rather interesting as well, its a song about Hamlet, and its a really cool take. _Richard Coury_ is the second of like four slow tracks on this album, this songs saving grace is that it gets really good about halfway through. _Straight to Hell_ has got the early markings of _I don't want to be an Asshole Anymore_ written all over it. _Cold Weather Gear_ is really just a sample over some acoustic strumming, there is some actual track in here but its doewsn't have enough going on for me. The last hurrah of the album, _Clap Hands Two Guns_, tries to get us back to the highs of the earlier portion of the album, but with a harder edge to it. Overall this album is fantastic, it has a few rough spots which should probably drop it to a three, but I think the highs are worth the jump to a four.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "Alpha Kappa Fall Of a Balcony",
        3,
        "Sir Yes Sir",
        3,
        "A Lesson In The Abuse Of Information Technology",
        4,
        "Ave Maria",
        5,
        "Coal City Blues",
        2,
        "Keychain",
        4,
        "Even For an Eggshell",
        3,
        "Richard Coury",
        3,
        "Straight to Hell",
        3,
        "Victory Gin",
        3,
        "Cold Weather Gear",
        1,
        "Clap Hands Two Guns",
        3,
        "No Ticket",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Menzingers, The\\A Lesson in the Abuse of Information Technology\\Cover.jpg",
      "Genre": [
        "Punk Rock",
        "Post-Hardcore"
      ],
      "Blurb": "While this isn't my favorite album from them, the album is still pretty good",
      "NextUpText": "NEXT UP:\n\nA Picture of Finn Farting by Renard\n\nOh boy, some more lapfox trax. Lets hope I like this better than Bandetto",
      "DatePosted": "2021-01-04T10:00:20.228157"
    },
    {
      "id": 24,
      "Title": "A Picture of Finn Farting",
      "Artist": "Renard",
      "ReviewBody": "I believe this album is a bunch of unreleased/unfinished tracks that I donloaded from Renard for free. Typically I don't like the commentary on songs like these but _THE RETRO COMEBACK BAD EXPERIENCE_ has a commentary intro that I don't particularily mind. I believe this is more about the fact that the song is really fucking oitherwise. I think the track _GOT MY PONY SPAM FOR YOU_ would have easiliy jumped to a 4 if it didn't have such a long intro about hand farts. Besides the talking portions this album is a fast paced gem. _WHO'S READY FOR THE BASEMENT_ has quite the littany of samples throughout, it's almost a game in and of itself to try and pick out all the samples. The track _VS PSYCHOLOGY_ which is a stevie wonder cover, has this really cool spooky, ambient sound to it. The next few tracks are good, but you c an defitely see their unfinished nature. Everything starts to pick back up for me when _YOU GOT CURVES, SHE GOT CURVES_ starts playing. The final track, _DARK TONY HAWK IS BORN_ is the gem on this album. It is such a great track, featuring a sample from Adventure Time of Marceline singing about her father. Overall its a solid little mixtape featuring some uncut/unfinished work but I think the pieces themselves are good enough hold their own.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "THE RETRO COMEBACK BAD EXPERIENCE",
        4,
        "GOING TO RIP ON THE BUTT",
        2,
        "GOT MY PONY SPAM FOR YOU",
        3,
        "WHO GIVES A FUCK",
        3,
        "WHO'S READY FOR THE BASEMENT",
        3,
        "VS PSYCHOSHY",
        3,
        "BURGIN.........",
        3,
        "DAGGONE BIEBERON",
        3,
        "TAGALOG LIKE IT WAS BEYON WORTH",
        2,
        "TUMBLR GOT SOUL",
        1,
        "YOU GOT CURVES, SHE GOT CURVES",
        3,
        "WI-FI BRIDGE",
        3,
        "DARK TONY HAWK IS BORN",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Renard\\A Picture of Finn Farting\\Cover.jpg",
      "Genre": [
        "Electronic"
      ],
      "Blurb": "Oh boy, some more lapfox trax. Lets hope I like this better than Bandetto",
      "NextUpText": "NEXT UP:\n\nA Place Where the Sun is Silent by Alesana\n\nNow this... this is a Grade-A lowus band. I remember falling off after the first few albums but still really good",
      "DatePosted": "2021-01-08T10:00:18.022232"
    },
    {
      "id": 25,
      "Title": "A Place Where the Sun is Silent",
      "Artist": "Alesana",
      "ReviewBody": "We have another rock opera style album. This is a post-hardcore edition with the premise focusing on Dante's inferno. The album starts out, _The Dark Wood of Error_, with a lilting melody featuring a duet between the male and female singers. Almost haunting in a way, it really sets the mood for the rest of the album. The first actual track of the album is, _A Forbidden Dance_, they definitely toned down the screaming for this album, its still there for sure, but just not as often as some previous albums. I'm changing my opinion on _Hand in Hand with the Damned_ this track fucking rocks. The build up for the next track, _Beyond the Sacred Glass_ is mindblowing as well. The guitar solo pretty much makes this song. The next track _The Temptress_ has this chorus that I cannot stand in this kind of genre, thats the reason for the low star rating. Another stand out is _Circle VII: Sins of the Lion_, the chorus on this song just gets me so hyped up. The next Track _Vestige_ is a nice break from the hardcore sound, although I think the instrumental version is better. _Lullaby of the Crucified_ marks a fantastic end to Act One, being a rock opera this album is broken up into two eight song acts. After a bit of a lull, _Lybyrinth_ brings us right back to the action. The hardcore screaming a nice compliment to some of the softer elements. After _Welcome to the Vanity Faire_ the album starts to shift towards a more carnival-esque sound, there has to be a better descriptor than that. Overall this is another great album, I think this might be my favorite Alesana album period.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "The Dark Wood Of Error",
        2,
        "A Forbidden Dance",
        3,
        "Hand In Hand With the Damned",
        3,
        "Beyond the Sacred Glass",
        4,
        "The Temptress",
        2,
        "Circle VII: Sins of the Lion",
        4,
        "Vestige",
        3,
        "Lullaby of the Crucified",
        4,
        "Before Him all Shall Scatter",
        1,
        "Labryinth",
        4,
        "The Fiend",
        3,
        "Welcome to the Vanity Faire",
        4,
        "The Wanderer",
        2,
        "A Gilded Masquerade",
        3,
        "The Best Laid Plans of Mice and Marionettes",
        4,
        "And Now for the Final Illision",
        3,
        "The Dark Wood of Error (Score)",
        3,
        "Vestige (Score)",
        3,
        "Lullaby of the Crucified (Score)",
        4,
        "Before Him All Shall Scatter (Score)",
        4,
        "The Wanderer (Score)",
        3,
        "A Gilded Masquerade (Score)",
        4,
        "The Best Laid Plans of Mice and Marionettes (Score)",
        4,
        "And Now for the Final Illusion (Score)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Alesana\\A Place Where the Sun is Silent\\Cover.jpg",
      "Genre": [
        "Post-Hardcore",
        "Symphonic Rock"
      ],
      "Blurb": "Now this... this is a Grade-A lowus band. I remember falling off after the first few albums but still really good",
      "NextUpText": "NEXT UP:\n\nA Series of Sneaks by Spoon\n\nclassic Texas Indie",
      "DatePosted": "2021-01-11T10:00:22.732692"
    },
    {
      "id": 26,
      "Title": "A Series of Sneaks",
      "Artist": "Spoon",
      "ReviewBody": "The second full length album by Spoon. Classic indie rock at it's finest. Spoon is unironically the soundtrack to the years 2000-2005 for me. I think this is one of those albums that you can play anywhere and people will get into it. This is one of those albums thats hard to get into specifics with, since all the tracks feel the same, but are distinctly different. But tracks like _Reservations_ are really a standout. It's such a groovey track. _30 Gallon Tank_ is just rising action the song. All the songs on the album are just fun songs. We see things slowing down a bit when we get to _Metal Detektor_. I actually changed my mind on _June's Foreign Spell_ while listening to it for the review. That song is actually a four and not a three. Overall not much to say, but give this album a listen if you get a chance.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Utilitarian",
        3,
        "The Minor Tough",
        3,
        "Execution",
        3,
        "Reservations",
        4,
        "30 Gallon Tank",
        4,
        "Car Radio",
        3,
        "Metal Detektor",
        3,
        "June's Foreign Spell",
        4,
        "Chloroform",
        3,
        "Metal School",
        3,
        "Staring At The Board",
        3,
        "No You're Not",
        3,
        "Quincy Punk Episode",
        4,
        "Advance Cassette",
        3,
        "Laffitte Don't Fail Me Now",
        3,
        "The Agony Of Laffitte",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Spoon\\A Series of Sneaks\\Cover.jpg",
      "Genre": [
        "Indie Rock"
      ],
      "Blurb": "classic Texas Indie",
      "NextUpText": "NEXT UP:\n\nA Thousand Leaves by Sonic Youth\n\nIt's not their best album, but its not bad",
      "DatePosted": "2021-01-15T10:00:22.732692"
    },
    {
      "id": 27,
      "Title": "A Thousand Leaves",
      "Artist": "Sonic Youth",
      "ReviewBody": "This is one of the sonic youth albums I never really got around too, Their earlier albums are the ones I've spent the most time on. The album does start out a little rough for me with _Contre Le Sexisme_, being mostly a silence/noise track. Things start picking up with _Sunday_, definitely harkens a lot to the 90s indie sound but does a nice job of not feeling too repetitive. When the bridge kicks back up towards the middle of _Wildflower Soul_ I feel it. I think this album definitely has some high highs, but also some low lows. I guess that is one of the issues with Art Rock, you can find some really cool sounds but you can never really stick with them for too long. Most of the songs do a nice job of jumping between a softer side and then a harder edgier side. Overall I think the album has some good pieces, but I don't think it will make it as an everyday staple.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.7,
      "TrackList": [
        "Contre Le Sexisme",
        1,
        "Sunday",
        3,
        "Female Mechanic Now on Duty",
        3,
        "Wildflower Soul",
        4,
        "Hoarfrost",
        3,
        "French Tickler",
        3,
        "Hits of Sunshine (For Allen Ginsberg)",
        3,
        "Karen Koltrane",
        3,
        "The Ineffable Me",
        3,
        "Snare, Girl",
        2,
        "Heather Angel",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Sonic Youth\\A Thousand Leaves (1998)\\Cover.jpg",
      "Genre": [
        "Post-Rock",
        "Experimental Rock"
      ],
      "Blurb": "It's not their best album, but its not bad",
      "NextUpText": "NEXT UP:\n\nA Weird Exits by Thee Oh Sees\n\nThe second half of a 2 part ep, The album art is by Robert Beaty and is awesome",
      "DatePosted": "2021-01-18T10:00:16.344679"
    },
    {
      "id": 28,
      "Title": "A Weird Exits",
      "Artist": "Thee Oh Sees",
      "ReviewBody": "I have probably listened to this album about thrity times before I ever bought it. Such a wild and fun ride. This is still on the more lofi-gargey side before they moved in a more progressive route for their later albums. The first track _Dead Man's Gun_ definitely sets the stage, it's nice and jammy with sick solo right in the middle. _Ticklish Warrior_ carries the momentum and kind of adds a Wall of Sound type ascetic. The next track _Jammed Entrance_ is this albums jam track. It's a good jam, but nothing special as well. _Plastic Plant_ kicks everything into overdrive. That guitar riff at the beginning just makes you want to mosh. _Gelatinous Cube_ keeps that energy high, I think I just like loud and fast guitars, which is waht this album is mostly. The album generall slows down quite a bit after that last track. _Unwrap the Friend, Pt.2_ is another jam track, still fun but more carries the energy rather than build it up or down. The jamming continues with _Crawl Out From the Fall Out_; it's more of a noise-y thing than a jammy track, but about halfway through it starts to get a bit more instrumental. Finally _The Axis_ almost has a religious quality to it. Feels like the end of an acid trip when your ramblings are starting to sound prophetic. The organ defintely helps in that regard. Overall I think this is a fucking fantastic album, not for everyone but for a fan of Dwyer or Oh Sees its a must listen.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.75,
      "TrackList": [
        "Dead Man's Gun",
        5,
        "Ticklish Warrior",
        4,
        "Jammed Entrance",
        3,
        "Plastic Plant",
        4,
        "Gelatinous Cube",
        5,
        "Unwrapt The Friend, Pt.2",
        3,
        "Crawl Out From The Fall Out",
        2,
        "The Axis",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thee Oh Sees\\A Weird Exits\\Cover.jpg",
      "Genre": [
        "Garage Rock",
        "Psychedelic Rock"
      ],
      "Blurb": "The second half of a 2 part ep, The album art is by Robert Beaty and is awesome",
      "NextUpText": "NEXT UP:\n\nabout by HYI\n\nI remember this album being hyped up, but I never got around to it",
      "DatePosted": "2021-01-22T10:00:16.593834"
    }
  ]
}