{
  "Completed": [
    {
      "id": 0,
      "Title": "When Your Heart Stops Beating",
      "Artist": "+44",
      "ReviewBody": "The first and only album from +44, starts off rather strong with _Lycanthrope_. The Energy of this song tells you that that you are in for a classic pop punk album, and it continues for a couple songs until you remember that half of the band is [Blink-182](../../Blink-182/Blink-182_Artist_Review.md) and their last album was [Blink-182](../../Blink-182/Blink-182/Blink-182_Album_Review.md)... The album drops off after _When your Heart Stops Beating_ moving into the more slow, experimental nature that is featured on _Blink-182_. The songs _Little Death_ and _No It Isn't_ are both about the breakup of _Blink-182_, while _Little Death_ isn't a bad song by any means it can start to drag a bit on repeat listens. _No It Isn't_ on the other hand is fantastic build from the more experimental tracks back to the higher energy the album started with. _Make You Smile_ is the absolute best song on the album, the duet nature makes this song an absolute joy.\n\nOverall I think the album is a solid mix of pre-breakup _Blink-182_ and a new evolution of pop punk. The album starts high then dips, but on the oathg the end starts to ramp, in my opinion, higher than the start. Sometimes the more experimental nature feels to drag, but overall I think the album is a solid 3 out of 5",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Lycanthrope",
        3,
        "Baby, Come On",
        3,
        "When Your Heart Stops Beating",
        2,
        "Little Death",
        2,
        "155",
        2,
        "Lillian",
        2,
        "Cliff Diving",
        3,
        "Interlude",
        2,
        "Weatherman",
        2,
        "No It Isn't",
        4,
        "Make You Smile",
        4,
        "Chapter 13",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\+44\\When Your Heart Stops Beating\\Cover.jpg",
      "Genre": [
        "Pop Punk"
      ],
      "Blurb": "",
      "NextUpText": "Oh and Next weeks album is a blast from the past\n\nJustice - (Cross)",
      "DatePosted": "2020-09-27T10:00:00,000",
      "Listen1": "2020-09-22",
      "Listen2": "2020-09-23",
      "Listen3": "2020-09-24"
    },
    {
      "id": 1,
      "Title": "(Cross)",
      "Artist": "Justice",
      "ReviewBody": "Justice, I haven't thought about this band or this album in years, coming back to it though it doesn't really hold the same place for me. The album starts out with _Genesis_ its a nice buildup, telling you what to expect for the next 48 minutes, but feels as though it takes a bit too long to get to its point, this was a tough one since I do like it with the album as a whole but I don't think it holds up on its own merits. _Let There Be Light_ has some interesting charactists, but the extended distorted organ starts to wear thing fairly quickly. The transition between the previous and the next track, _D.A.N.C.E_ is also a little wonky. The radio changing effect between songs is always a little jarring for me, but I guess its not a bad way to transiiton from a slower song to a classic pop bop. Probably the only actual song people know off this album, it is quite the fun dance track bringing in funk elements with a classic 4 on the flour house beat. I do n the whole enjoy this song, but it can be a bit saccharine at times.\nNext up is _Newjack_ and while it does fit with the ascethitic of the album; the consistant high pass filters make it a fairly annoying listen on its own. _Phantom_ is a bit on the noise-y side, which I typically like, but it felt almost a little Jam-y which is not quite what the rest of the album feels like. What else needs to be said about _Phantom Part II_ that hasn't been covered by _Phantom_, it is just a continuation of the previous track and really should just be combined. _Valentine_ is a nice palette cleanser from the previous blocks of tracks. I feel its needed, but the song on its own is not really that great.\nThis album so far might sound like a big miss rather than a nice trip down memory lane, that is until it hits with the next block of tracks, starting with _TThhee PPaarrttyy_. I have mixed feelings about this song, it is quite a great buildup to the next block of tracks, but as a solo play it doesn't really hold its own. _DVNO_ on the other hand, is a straight up jam. Such a fun bop, it almost jumped itself up a whole place. I know what I said about the previous noise-y, jam-y track, but _Stress_ owns it. It almost has a sythwave vibe, even though this album is about 15 years to young for that genre. _Waters Of Nazareth_ continues on the trend of the previous track, but picks up the pace a bit. The ending few tracks of this album are really what solidify the entire albums rating. Finally _One Minute to Midnight_ closes the album out, a nice respite from the last few tracks. Would be a lot higher if it didn't do that stupid minute of dead space at the end.\nOverall I do enjoy the album but it is on the low end of 3 out of 5. The strength of the last half of the album really carries it higher.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.5,
      "TrackList": [
        "Genesis",
        2,
        "Let There Be Light",
        2,
        "D.A.N.C.E.",
        3,
        "Newjack",
        2,
        "Phantom",
        2,
        "Phantom Part II",
        2,
        "Valentine",
        2,
        "TThhee PPaarrttyy",
        3,
        "DVNO",
        4,
        "Stress",
        3,
        "Waters Of Nazareth",
        3,
        "One Minute To Midnight",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Justice\\(Cross)\\Cover.jpg",
      "Genre": [
        "House",
        "Nu-Disco"
      ],
      "Blurb": "Oh and Next weeks album is a blast from the past",
      "NextUpText": "NEXT UP:\n\nits (ONe) by The Panic Channel\n\nWoo, get ready for some but rock",
      "DatePosted": "2020-10-05T10:00:00,000",
      "Listen1": "2020-09-28",
      "Listen2": "2020-09-29",
      "Listen3": "2020-09-30"
    },
    {
      "id": 2,
      "Title": "(ONe)",
      "Artist": "The Panic Channel",
      "ReviewBody": "This album is absolutely atrocious. `But Rock` at its... finest? Do you listen to [_Foo Fighters_](../../Foo%20Fighters/Foo_Fighters_Artist_Review.md) and wish they were more Generic? Then this is the band for you. Unlike most reviews where I listen 3-4 times to get ratings and really see what I think about the album, this time I think 2 listens is really enough. Ranging anywhere from \"this is fine\" to \"please make it stop\" this is not an album I will ever revisit. Its so bad in fact that I am seriously contemplating removing it from my library entirely.",
      "AlbumRating": 1,
      "AlbumFeelingRating": 1,
      "SongAvg": 1,
      "TrackList": [
        "Teahouse Of The Spirits",
        2,
        "Left To Lose",
        2,
        "Bloody Mary",
        2,
        "Why Cry",
        1,
        "Awake",
        2,
        "She Won't Last",
        1,
        "Said You'd Be",
        2,
        "Outsider",
        1,
        "Blue Bruises",
        1,
        "Night One (From Planchette)",
        1,
        "Listen",
        1,
        "Lie Next To Me",
        1,
        "Untitled",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Panic Channel, The\\(ONe)\\Cover.jpg",
      "Genre": [
        "Rock",
        "Alternative",
        "But Rock"
      ],
      "Blurb": "Woo, get ready for some but rock",
      "NextUpText": "NEXT UP:\n\n*.WAV SLAVE by BANDETTO",
      "DatePosted": "2020-10-12T10:00:00,000",
      "Listen1": "2020-10-05",
      "Listen2": "2020-10-06",
      "Listen3": "2020-10-07"
    },
    {
      "id": 3,
      "Title": "*.WAV SLAVE",
      "Artist": "BANDETTO",
      "ReviewBody": "It turns out that I do not have as high a tolerance for Breakcore as I thought I did. The album overall isn't bad but I would like it better if I had a dance pad or some other foux instrument to go along with it. I feel like I don't have too much to say about each of the individual tracks since they blend together so much. With few standouts like _barf city_ and _amnesiac_ the album is fun but its really nothing special. A good listen if you are in the mood to party, but as an album to just listen to its just mediocre. ",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2,
      "TrackList": [
        "bouncy castle boogie",
        2,
        "disco bombing",
        2,
        "gameshark",
        2,
        "barf city",
        3,
        "fierce fortune",
        3,
        "amnesiac",
        3,
        "need u",
        2,
        "scorch shuffle",
        2,
        "on the hunt",
        2,
        "rhythm guide",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\BANDETTO\\-.WAV SLAVE\\BANDETTO - -.WAV SLAVE - cover.png",
      "Genre": [
        "Experimental Breakcore"
      ],
      "Blurb": "I never wrote a blurb for this one",
      "NextUpText": "NEXT UP:\n\n...And Out Come the Wolves by Rancid",
      "DatePosted": "2020-10-19T10:00:00,000",
      "Listen1": "2020-10-15",
      "Listen2": "2020-10-16",
      "Listen3": "2020-10-17"
    },
    {
      "id": 4,
      "Title": "...And Out Come The Wolves",
      "Artist": "Rancid",
      "ReviewBody": "This album hops from absolute banger to banger. Not a dead spot to be found. Starts out strong with _Maxwell Murder_, pulling into the power chord chorus of _The 11th Hour_. The ablum starts to really pick up with _Time Bomb_, its got that catchy chorus that breaks right into that classic ska breakdown. _Olympia WA_ has that shredding solo to prove that they can do more than just power chords. You can really feel the punk roots showing in _Lock, Step & Gone_, sounds just like a Clash song turned just a little more modern. And the titular track of the album, _Junkie Man_, even though the title is just part of of the outro of the song. _Listed M.I.A._ brings home how different, yet the same every track on this album is. I am definitely showing my bias towards loud, fast, punk music here. _Ruby Soho_ The best track on the album, even though Punk isn't supposed to be chorus heavy, Ska is on the other hand. So far this also marks the first 5 star song rating I have given out, hopefully got some more coming. The next few songs: _Daily City Train_, _Journey to the End of East Bay_, and _She's Automatic_; are all not bad songs, but nothing worth really pointing out. _Old Friend_ really starts to brings back the classic ska stroke.  _Disorder and Disarray_ Is in my opinion the last hurrah of this album, everything after is still good but nothing super memorable.\n\nOverall this has been my favorite album of the relisten so far. This album hits every chord for a fun, ska-punk, album should. This album is definitely going back into heavy rotation.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "Maxwell Murder",
        3,
        "The 11th Hour",
        3,
        "Roots Radicals",
        3,
        "Time Bomb",
        4,
        "Olympia WA",
        3,
        "Lock, Step & Gone",
        4,
        "Junkie Man",
        3,
        "Listed M.I.A.",
        4,
        "Ruby Soho",
        5,
        "Daily City Train",
        3,
        "Journey to the end of the East Bay",
        3,
        "She's Automatic",
        3,
        "Old Friend",
        3,
        "Disorder and Disarray",
        4,
        "The Wars End",
        3,
        "You Don't Care Nothin'",
        3,
        "As Wicked",
        3,
        "Avenues & Alleyways",
        3,
        "The Way I Feel",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Rancid\\And Out Come the Wolves\\Cover.jpg",
      "Genre": [
        "Punk Rock",
        "Ska Punk"
      ],
      "Blurb": "",
      "NextUpText": "NEXT UP:\n\n[ Movements ] by Solar Fields\n\nI think this is a video game soundtrack, idk?",
      "DatePosted": "2020-10-26T10:00:00,000",
      "Listen1": "2020-10-22",
      "Listen2": "2020-10-23",
      "Listen3": "2020-10-24"
    },
    {
      "id": 5,
      "Title": "[ Movements ]",
      "Artist": "Solar Fields",
      "ReviewBody": "So Heres the hard part about reviewing Ambient Albums, I like ambient but only in certain situations and moods. So while I do enjoy this album, it is not something I could see myself really listening to all that often. The Album does start strong with a nice long build on _Sol_, then kind of chills out and meanders a while for tracks like _Circles of Motion_ and _Discovering_. _The Stones are not too Busy_ starts to pick it back up over its 10 minute duration, but then again starts to chill out again. I have a hard time of coming up with new things to say about an ambient track, becuase you aren't really supposed to _Listen_ to them, so much as they are supposed to be background noise to help you focus or put you in a mood. Its the same way with a lot of Post rock for me as well. _Das Bungalow_ is pulling me back in, I like a bit of up-tempo with my ambient. I could very easily see this album being the OST for a space puzzle game. Its got that nice open sound while still holding you in the moment, it has a nice air-y breath-y sound qualities as well.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2,
      "TrackList": [
        "Sol",
        3,
        "Circles of Motion",
        2,
        "Discovering",
        2,
        "Sky Trees",
        2,
        "The Stones are not too Busy",
        3,
        "Dust",
        2,
        "Das Bungalow",
        3,
        "Feeling (Album edit)",
        2,
        "Patterns",
        2,
        "The Road to Nothingness",
        3,
        "Breeze",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Solar Fields\\[ Movements ]\\Cover.jpg",
      "Genre": [
        "Ambient"
      ],
      "Blurb": "I think this is a video game soundtrack, idk?",
      "NextUpText": "NEXT UP:\n\n10,000 Days by Tool\n\ny'all are seriously sleeping on Tool",
      "DatePosted": "2020-11-02T10:00:00,000",
      "Listen1": "2020-10-29",
      "Listen2": "2020-10-30",
      "Listen3": "2020-10-31"
    },
    {
      "id": 6,
      "Title": "10,000 Days",
      "Artist": "Tool",
      "ReviewBody": "This album was my introduction to Tool. I liked it at the time but I didn't quite appreciate it until I got older. The way they bend progressive tendancies with metal is jaw dropping. The opening track, _Vicarious_, has this awesome slow build until it gets into the song proper. I think a lot of people just associate Tool with the people who like Tool, instead of necassarily appreciating the music for what it is. The album meanders a bit for a few tracks, it has an interesting build with _Wings For Marie_ but the payoff in _10,000 Days_ isn't quite enough for me. The Everything changes when we get to the song _The Pot_ this song is fantastic, and the first Tool song I ever heard. remember how I said everything was changing, that was wishful thinking. The next two tracks _Lipan Conjuring_ and _Lost Keys (Blame Hofmann)_, are just noise/intermission tracks. Have I ever mentioned how much I hate when artists do this. HOOO BOYYY. Next up is _Rosetta Stoned_, eleven minutes and eleven seconds of pure jam, if it was shorter it might get the coveted five out of five. The album keeps doing this flip flop of really solid tracks with just noise, it would be different if the noise tracks led into the others, but they seem to be there just to be there. _Right in Two_ brings the album back right into that groove. The last track on the album, _Viginti Tres_, is another just noise track.\n\nI really like the album overall, but the noise tracks really hamper it from being a fantastic album.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 4,
      "SongAvg": 2.6,
      "TrackList": [
        "Vicarious",
        3,
        "Jambi",
        3,
        "Wings For Marie (Part 1)",
        3,
        "10,000 Days (Wings Part 2)",
        2,
        "The Pot",
        5,
        "Lipan Conjuring",
        1,
        "Lost Keys (Blame Hofmann)",
        1,
        "Rosetta Stoned",
        4,
        "Intension",
        2,
        "Right In Two",
        4,
        "Viginti Tres",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Tool\\10,000 Days\\Cover.jpg",
      "Genre": [
        "Progressive Metal"
      ],
      "Blurb": "y'all are seriously sleeping on Tool",
      "NextUpText": "NEXT UP:\n\n1039 SMoothed Out Slappy Hours by Green Day\n\nit's basically a compilation of all their early albums and eps",
      "DatePosted": "2020-11-06T10:00:00,000",
      "Listen1": "2020-10-29",
      "Listen2": "2020-10-30",
      "Listen3": "2020-10-31"
    },
    {
      "id": 7,
      "Title": "1039 Smoothed Out Slappy Hours",
      "Artist": "Green Day",
      "ReviewBody": "This album is a compilation of Green Days Frist album and a few of their early EPs. As far as it goes it is a great listen, theres a few notable tracks, but for the most part it is just bog standard Punk. _The Judge's Daughter_ is a notable standout for me, the shredding solo at the end really kicks the song up a notch. HOLY SHIT, I take it all back. The second half of this album fucking kicks ass, _Dry Ice_ to _The One I Want_ are absolute bangers, this album might skew higher than my initial reactions. Nice mix of catchy but also in your face. You can definitely see how Green Day will transition to pop punk as they get older, but right now this album is exactl waht Late 80s, early 90s punk was about. This album really shows the musicianship of the group, it starts off with power chord after power chord, but then it evolves over the course of the album and you can see those roots and then see how it grows past them.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "At the Library",
        3,
        "Don't Leave Me",
        3,
        "I was There",
        3,
        "Disappearing Boy",
        2,
        "Green Day",
        3,
        "Going to Pasalacqua",
        2,
        "16",
        3,
        "Road to Acceptance",
        3,
        "Rest",
        1,
        "The Judge's Daughter",
        4,
        "Paper Lanters",
        3,
        "Why do you Want Him",
        4,
        "409 in Your Coffeemaker",
        3,
        "Knowledge",
        2,
        "1000 Hours",
        3,
        "Dry Ice",
        4,
        "Only of You",
        4,
        "The One I Want",
        4,
        "I Want to Be Alone",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Green Day\\1039 Smoothed Out Slappy Hours\\Cover.jpg",
      "Genre": [
        "Punk Rock"
      ],
      "Blurb": "it's basically a compilation of all their early albums and eps",
      "NextUpText": "NEXT UP:\n\n13 by Blur\n\nthis is not the album with Track 2",
      "DatePosted": "2020-11-09T10:00:00,000",
      "Listen1": "2020-11-05",
      "Listen2": "2020-11-06",
      "Listen3": "2020-11-07"
    },
    {
      "id": 8,
      "Title": "13",
      "Artist": "Blur",
      "ReviewBody": "I've never actually listened to this Blur album all the way through before. I can't say I've ever really found myself so wishy washy on an album before. I seemed to alternate every track, with either liking it or hating it. _Coffee & TV_ was surprising hit on the album for me, but apart from that it was pretty touch and go. _Optigan 1_ was your standard noise interlude, which I hate, and then _Tender_, seven minutes of a boring slow song, no thank you. Overall I didn't hate this album, but I didn't really find anything special in it that I really liked.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2.3,
      "TrackList": [
        "Tender",
        1,
        "Bugman",
        3,
        "Coffee & TV",
        3,
        "Swamp Song",
        3,
        "1992",
        2,
        "B.L.U.R.E.M.I.",
        3,
        "Battle",
        2,
        "Mellow Song",
        2,
        "Trailerpark",
        3,
        "Caramel",
        2,
        "Trimm Trabb",
        2,
        "No Distance Left To Run",
        3,
        "Optigan 1",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Blur\\13\\Cover.jpg",
      "Genre": [
        "Art Rock",
        "Experimental Rock"
      ],
      "Blurb": "this is not the album with Track 2",
      "NextUpText": "NEXT UP:\n\n18 by Moby\n\nI wonder if this is the album with the Bourne Theme Song (it is)",
      "DatePosted": "2020-11-13T10:00:00,000",
      "Listen1": "2020-11-05",
      "Listen2": "2020-11-06",
      "Listen3": "2020-11-07"
    },
    {
      "id": 9,
      "Title": "18",
      "Artist": "Moby",
      "ReviewBody": "I've listened to a bunch of moby tracks before this, never a full album, and liked what I've listened too. This album feels very swing-y too me; in the sense that it swings from good to bad throughout the album. It starts out pretty space-y with _We Are All Made of Stars_ but slowely transitions to another just boring slow track _The Great Escape_. After this track the album starts to build up again until it gets to _Extreme Ways_ this was the Bourne trilogy theme song and what initially got me into Moby, and its followed up with _Jam for the Ladies_ which I really like but doesn't fit the theme of the album at all. Unfortunately after this the album really drops off for me. If it wasn't for the two songs I mentioned above this album would be a solid 2, but with those additions it just barely eeks out a 3.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.3,
      "TrackList": [
        "We Are All Made of Stars",
        3,
        "In This World",
        2,
        "In My Heart",
        2,
        "The Great Escape",
        1,
        "Signs of Love",
        2,
        "One of These Mornings",
        3,
        "Another Woman",
        3,
        "Fireworks",
        2,
        "Extreme Ways",
        4,
        "Jam for the Ladies",
        4,
        "Sunday (the Day before My Birthday)",
        3,
        "18",
        2,
        "Sleep Alone",
        2,
        "At Least We Tried",
        1,
        "Harbour",
        1,
        "Look Back In",
        2,
        "The Rafters",
        2,
        "I'm Not Worried At All",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Moby\\18\\Cover.jpg",
      "Genre": [
        "Electronica",
        "Downtempo"
      ],
      "Blurb": "I wonder if this is the album with the Bourne Theme Song (it is)",
      "NextUpText": "NEXT UP:\n\n1983 by Flying Lotus\n\nThe first album, arguably one of the greatest showings of his raw talent",
      "DatePosted": "2020-11-16T10:00:00,000",
      "Listen1": "2020-11-12",
      "Listen2": "2020-11-13",
      "Listen3": "2020-11-14"
    },
    {
      "id": 10,
      "Title": "1983",
      "Artist": "Flying Lotus",
      "ReviewBody": "The first full length album for Flying Flotus. It shows off his talent, but still leaves some room to grow. Overall this album has clear space-y connatations. This album is a mix of finding a groove and then leaving the groove when it starts to get boring. The titular track, _1983_, is a build on the groove, it takes its time to find it and then slowely builds and adds new elements to it over the course of its duration. The complex beat structure with the glitch like fill; makes for a very interesting listen. As soon as you think you understand the tracks, you find something new to enjoy. _Babble_, while not a bad track, I feel is just too short and doesn't really accomplish what it sets out to. One of my few issues with the album is some of the transistions are a little too hard. _Unexpected Delight_ really lives up to its name. The volicity of the backing track makes combined with the haunting vocals by Laura; make for a hypnotic track that doesn't let go of your attention.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "1983",
        3,
        "Sao Paulo",
        3,
        "Bad Actors",
        3,
        "Orbit Brazil",
        3,
        "Shifty",
        3,
        "Babble",
        2,
        "Pet Monster Shotglass",
        3,
        "Hello",
        3,
        "Untitled #7",
        3,
        "Unexpected Delight (Feat. Laura Darlington)",
        4,
        "1983 (Daedulus's Odd-Dance Party Remix)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Flying Lotus\\1983\\Cover.jpg",
      "Genre": [
        "Trip Hop"
      ],
      "Blurb": "The first album, arguably one of the greatest showings of his raw talent",
      "NextUpText": "NEXT UP:\n\n200 Million Thousand by The Black Lips\n\nI've never listened to this album in its entirety before",
      "DatePosted": "2020-11-20T10:07:00,000",
      "Listen1": "2020-11-12",
      "Listen2": "2020-11-13",
      "Listen3": "2020-11-14"
    },
    {
      "id": 11,
      "Title": "200 Million Thousand",
      "Artist": "The Black Lips",
      "ReviewBody": "I had never listened to this album all the way through before. Its a great entry to the garage rock genre in my library. On my first listen I found myself really liking the album. I think on the whole it does better than the individual tracks would suggest, which I don't think is uncommon for this genre. What is a misnomer on this album is the songs I gave a 2 star too. While I enjoyed all these tracks I feel like on a shuffle I would most likely skip them. But this album is fuzzy, warm, and a great jam album. Every track gets you in a groove and then just holds you there until it decides its time to move on. _Short Fuse_ is very reminiscient of a [The Hives](../../Hives,%20TheHives_Artist_Review.md) track, but a little more on the lo-fi side. _Meltdown_, the hidden track on the album (based MusicBee filters out the minutes of silence), would have been a lot lower if I couldn't have filterd the white noise out.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Take My Heart",
        3,
        "Drugs",
        4,
        "Starting Over",
        2,
        "Let It Grow",
        2,
        "Trapped In A Basement",
        3,
        "Short Fuse",
        4,
        "I'll Be With You",
        2,
        "Big Black Jesus of Today",
        3,
        "Again & Again",
        4,
        "Old Man",
        3,
        "The Drop I Hold",
        3,
        "Body Combat",
        4,
        "Elijah",
        4,
        "I Saw God",
        2,
        "Meltdown (Hidden Track)",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Black Lips, The\\200 Million Thousand\\Cover.jpg",
      "Genre": [
        "Garage Punk",
        "Psychedelic Rock"
      ],
      "Blurb": "I've never listened to this album in its entirety before",
      "NextUpText": "NEXT UP:\n\n30 Seconds to Mars by 30 Seconds to Mars\n\nDOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "DatePosted": "2020-11-23T10:00:08.413456",
      "Listen1": "2020-11-19",
      "Listen2": "2020-11-20",
      "Listen3": "2020-11-21"
    },
    {
      "id": 12,
      "Title": "30 Seconds to Mars",
      "Artist": "30 Seconds to Mars",
      "ReviewBody": "Going into this album, I could really only remember their single off their next album [A Beautiful Life](../A%20Beautiful%20Lie/A_Beautiful_Lie_Album_Review.md), _the Kill_, and its more alternative leanings. This album on the other hand has much more of a progressive blend to its sound than I remember of the next album. The song _Edge of the Earth_ is the first track that makes me realize that this album is something special. They managed to make the sound very open, while still keeping that heaviness associated with metal. _Fallen_ really amps up on the space theme. For a first showing from 30 Seconds to Mars, this is a great showing. While not as much to talk about since the album fits the theme it sets pretty well. Overall this album is fantastic and is definitely going back into the rotation.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Capricorn (A Brand New Name)",
        3,
        "Edge of the Earth",
        4,
        "Fallen",
        3,
        "Oblivion",
        3,
        "Buddha for Mary",
        4,
        "Echelon",
        3,
        "Welcome to the Universe",
        4,
        "The Mission",
        4,
        "End of the Beginning",
        3,
        "93 Million Miles",
        3,
        "Year Zero",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\30 Seconds To Mars\\30 Seconds To Mars\\Cover.jpg",
      "Genre": [
        "Progressive Metal"
      ],
      "Blurb": "DOOOOOONNN''''''TTTT BRRREEEAAAKKK MMEEEE DOOOWWNNNN, MMMARRRYYY MMMEEE (turns out this is not that album)",
      "NextUpText": "NEXT UP:\n\n21st Century Breakdown by Green Day\n\nI hate 21 guns, but let's do this",
      "DatePosted": "2020-11-29T09:36:41.363882",
      "Listen1": "2020-11-26",
      "Listen2": "2020-11-27",
      "Listen3": "2020-11-28"
    },
    {
      "id": 13,
      "Title": "21st Century Breakdown",
      "Artist": "Green Day",
      "ReviewBody": "This album should have been called `Billie Armstrong Wants to Make The Black Parade`. I think this album was so supposed to be reminiscient of the the entire 2000-2010 decade. Listening through you can tell the obvious influences with _Murder City_ being something off of [The Black Parade](../../My%20Chemical%20Romance/The%20Black%20Parade/The_Black_Parade_Album_Review.md). Off the same album _21st Century Breakdown_ feels like it wants to be that bombastic anthem that _Welcome to the Black Parade_ is. _Know Your Enemy_ is reminiscient of some of their own earlier work, like something off of [Warning](../Warning/Warning_Album_Review.md). Even the next track _Viva La Gloria!_ sounds familair to their older work, specifically [American Idiot](../American%20Idiot/American_Idiot_Album_Review.md). Skipping a bit ahead _Last of the American Girls_ sounds like the intro song to a mid 2000s teen girl movie. _Restless Heart Syndrome_, even though it has such a ripping solo, it just takes too long to get anywhere that I don't find myself wanting to wait to get to the good part. _Horseshoes and Handgrenades_ feels like a straight rip off of [The Hives](../../Hives,%20The/The_Hives_Artist_Review.md).\n\tThis is the second album by Green Day that is supposed to be a \"Punk Rock Opera\", the first being _American Idiot_, but this album feels a bit disengenous to me. Maybe I am being too harsh on this album; if you think it about it another way this album came out at the end of the decade so maybe they were just trying to highlight the previous decades punk, emo, and emo anthems into a rock opera. To me though I think it feels more like they are apeing the sounds they are trying to pay homage too.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 1.9,
      "TrackList": [
        "Song of the Century",
        1,
        "21st Century Breakdown",
        2,
        "Know Your Enemy",
        2,
        "Viva La Gloria!",
        2,
        "Before the Lobotomy",
        1,
        "Christian's Inferno",
        3,
        "Last Night on Earth",
        1,
        "East Jesus Nowhere",
        3,
        "Peacemaker",
        2,
        "Last of the American Girls",
        2,
        "Murder City",
        3,
        "Viva La Gloria? (Little Girl)",
        1,
        "Restless Heart Syndrome",
        2,
        "Horseshoes and Handgrenades",
        3,
        "The Static Age",
        2,
        "21 Guns",
        1,
        "American Eulogy: Mass Hysteria/Modern World",
        2,
        "See the Light",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Green Day\\21st Century Breakdown\\Cover.jpg",
      "Genre": [
        "Pop Punk",
        "Alternative"
      ],
      "Blurb": "I hate 21 guns, but let's do this",
      "NextUpText": "NEXT UP:\n\n40oz. to Freedom by Sublime\n\nThis is not the one with all the bangers",
      "DatePosted": "2020-11-30T10:00:07.132488",
      "Listen1": "2020-11-26",
      "Listen2": "2020-11-27",
      "Listen3": "2020-11-28"
    },
    {
      "id": 14,
      "Title": "40oz. to Freedom",
      "Artist": "Sublime",
      "ReviewBody": "The first album from Sublime. Who knew they would be such a break out hit after this. The album doesn't feel very cohesive throughout, seeing as the genre shifts each track. This album did a few standouts that I don't think I had listened too before, such as: _We're Only Gonna Die for our Arrogance_, _54-46 That's My Number/Ball and Chain_, and _What Happened_. The mix of sampling on this album is a reall interesting, typically somethign I really enjoy and that holds true here as well. It was fun to relisten to this album and hear some tracks I haven't listened to in years. Although songs like _Badfish_ or _Smoke Two Joints_ have just been played so many times growing up that Idk if I can really listen to them anymore. But this album deserves it's four star rating not much to say other than who hasn't listened to this album and who doesn't think it's good.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.2,
      "TrackList": [
        "Waiting for My Ruca",
        2,
        "40oz. to Freedom",
        3,
        "Smoke Two Joints",
        3,
        "We're Only Gonna Die for Our Arrogance",
        5,
        "Don't Push",
        4,
        "54-46 That's My Number/Ball and Chain",
        4,
        "Badfish",
        2,
        "Let's Go Get Stoned",
        3,
        "New Thrash",
        4,
        "Scarlet Begonias",
        3,
        "Live at E's",
        3,
        "D.J.s",
        3,
        "Chica Me Tipo",
        4,
        "Right Back",
        3,
        "What Happened",
        4,
        "New Song",
        3,
        "Ebin",
        4,
        "Date Rape",
        3,
        "Hope",
        3,
        "KRS-One",
        3,
        "Rivers of Babylon",
        2,
        "Thanx",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Sublime\\40oz. to Freedom\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Reggae Rock"
      ],
      "Blurb": "This is not the one with all the bangers",
      "NextUpText": "NEXT UP:\n\n44 by The Mayan Factor\n\nImagine Tool, but Weirder",
      "DatePosted": "2020-12-04T10:00:02.889284",
      "Listen1": "2020-11-26",
      "Listen2": "2020-11-27",
      "Listen3": "2020-11-28"
    },
    {
      "id": 15,
      "Title": "44",
      "Artist": "The Mayan Factor",
      "ReviewBody": "My intial thoughts on the album was that it was just another Tool clone, but that is not entirely true. The album has a more experimental feel to it, then even Tool does. The whole album has a really ancient feel to it, with the chanting and marracas. in some songs it has this nice blend of the progressive with some alternative bent to it. Some songs almost feel like Tool x R.E.M.. _44_ is definitely stronger in the first half then the second half. While I don't have a ton to say about this album, I think it's really good and is definitely worth checking out.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.9,
      "TrackList": [
        "To Kill a Priest",
        4,
        "Terrorist",
        4,
        "Propaganda",
        3,
        "Hopi Elders",
        3,
        "Ventriloquist",
        3,
        "Gosia",
        2,
        "Yesterdays Son",
        2,
        "Bondage",
        4,
        "A Red Gone Blue",
        3,
        "Jack Nicholson",
        2,
        "Recon",
        2,
        "Self Storage",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mayan Factor, The\\44\\Cover.jpg",
      "Genre": [
        "Progressive Rock",
        "Art Rock"
      ],
      "Blurb": "Imagine Tool, but Weirder",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-11T11:37:34.644246",
      "Listen1": "2020-12-03",
      "Listen2": "2020-12-04",
      "Listen3": "2020-12-05"
    },
    {
      "id": 16,
      "Title": "99 songs of Revolution, Vol 1",
      "Artist": "Streetlight Manifesto",
      "ReviewBody": "An Album of Covers, the project was initally started by Bandits of the Acoutstic Revolution. Seeing as this album was called Volume 1 I was kind of assuming there would be a volume 2 but I have not read anything about a potential volume 2 anywhere. Each track on this album is a cover, redone in the signature stye of Streetlight Manifesto. The covers are, in order: Mason Jennings, Squirrel Nut Zippers, Radiohead, Bad Religion, The Dead Milkmen, NOFX, Paul Simon, Bandits of the Acoustic Revolution, Paul Simon, Luis Jordan, and The Postal Service. The Cover of the Bad Religion song will be really interesting to compare to the orignal since I have that track in the library somehwere. What's really interesting about this album is they do a good job of making the covers sound different, but they still have the soul of the original. I think the cover/pairing that does this the best is Hurt by NIN that was covered by Johnny Cash. The song Just, even without knowing that it was a Radiohead song, you can still hear the chord progressions and the fill they tend to use on their songs bleed through the cover as well. What really drew me to this album was their cover of The Postal Service's Such Great Heights, there are thousands, I mean, thousands of covers of this song, but Streetlight actually managed to do the track in a different style so it feels different and unique but you can still see the soul. We've been having a great streak with the strong reviews, let's hope that trend continues.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.5,
      "TrackList": [
        "Birds Flying Away",
        3,
        "Hell",
        4,
        "Just",
        4,
        "Skyscraper",
        3,
        "Punk Rock Girl",
        4,
        "Linoleum",
        2,
        "Me and Julio Down by the Schoolyard",
        3,
        "They Provide the Paint for the Picture-Perfect Masterpiece That You Will Paint on the Insides of Your Eyelids",
        4,
        "Red Rubber Ball",
        3,
        "The Troubador",
        4,
        "Such Great Hieghts",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Streetlight Manifesto\\99 Songs of Revolution, Vol 1\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Third-Wave Ska"
      ],
      "Blurb": "Imagine Tool, but Weirder",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-11T11:37:34.644246",
      "Listen1": "2020-12-03",
      "Listen2": "2020-12-04",
      "Listen3": "2020-12-05"
    },
    {
      "id": 17,
      "Title": "#501",
      "Artist": "MidiCronica",
      "ReviewBody": "So I was initally very interested in this album since Midicronica did the end track for Samurai Champloo. Samurai Champloo always had a fantastic soundtrack, blending a more traditional Japanese sound with the modern, at the time, hip hop sound. Unfortunately I am missing a few tracks on this album, but with my reception to the other tracks, I am not sure if they would have helped the score on this review overall. What gets me about this album is that I like the beats behind the tracks, but its one of the guys in the group has a really grating sound to me and they seem to feature him in every single song. This album also does the classic hip hop thing of including a ton of sample tracks or skits, which hurt this album overall in my opinion. Then you get to the track _San Francisco_ and it all comes back, the groovey nature of the track just puts you in a good mood. It might just be my initial bias towards the show, but this track would have made a fantastic closing track. Well here ends the streak of strong reviews, I have a few tracks that I will keep in mind going forward, but overall I think this album will stay buried in the library.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2,
      "TrackList": [
        "Operator To Help You",
        1,
        "g",
        2,
        "Blue Velvet",
        2,
        "Jet Set Radio",
        2,
        "Tanoshii Drive",
        2,
        "Star Drive feat. 893 aka La Melomania",
        3,
        "Missing",
        0,
        "Skit",
        1,
        "San Francisco",
        4,
        "Pillow Jam",
        3,
        "Steroid",
        1,
        "Kido feat. 967 aka Gumuna",
        1,
        "Missing",
        0,
        "S501",
        2,
        "Deep Blue feat. Con-NYC",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\MidiCronica\\#501\\Cover.jpg",
      "Genre": [
        "Hip Hop",
        "J/Hip Hop"
      ],
      "Blurb": "They did some of the Samurai Champloo music",
      "NextUpText": "NEXT UP:\n\nA Beautiful Lie by 30 Seconds to Mars\n\nMore alternative, its probably garbage, but I liked it 10 years ago!",
      "DatePosted": "2020-12-16T12:06:50.293507",
      "Listen1": "2020-12-10",
      "Listen2": "2020-12-11",
      "Listen3": "2020-12-12"
    },
    {
      "id": 18,
      "Title": "A Beautiful Lie",
      "Artist": "30 Seconds to Mars",
      "ReviewBody": "Now this is the album I was thinking of when I saw the first 30STM album pop up. The songs _The Kill_ and _From Yesterday_ were all over the radio when this album came out, like you couldn't escape them at all. While the first album from 30STM was a more progressive metal sound, this album seem to forgo both the metal and progressive stint from that album and move distinctly into the alternative realm; probably where the money is at compared to progressive and metal. The singles still definitely hold up, albeit not quite as high as I remember, but they were still very good. What this album does carry over from their first, is the spacey quality. The tracks sound very open, or airy, and that mixed with some of the oppressive riffs, really do a good job of setting the scene. Even though this album moves more into that alternative realm, in some ways its almost more ambitious than the first album. But with that ambition not every lands. So while not a fantastic album, still a pretty good one. This also marks the end of the **number/symbol** albums and we are now in the **A** territory.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Attack",
        3,
        "A Beautiful Lie",
        3,
        "The Kill",
        4,
        "Was It A Dream?",
        3,
        "The Fantasy",
        3,
        "Savior",
        3,
        "From Yesterday",
        4,
        "The Story",
        2,
        "R-Evolve",
        4,
        "A Modern Myth",
        3,
        "The Battle of One",
        3,
        "Hunter",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\30 Seconds To Mars\\A Beautiful Lie\\Cover.jpg",
      "Genre": [
        "Alternative"
      ],
      "Blurb": "More alternative, its probably garbage, but I liked it 10 years ago!",
      "NextUpText": "NEXT UP:\n\n'64-'95 by Lemon Jelly\n\nIt's drug music!",
      "DatePosted": "2020-12-18T10:15:03.670155",
      "Listen1": "2020-12-10",
      "Listen2": "2020-12-11",
      "Listen3": "2020-12-12"
    },
    {
      "id": 19,
      "Title": "'64-'95",
      "Artist": "Lemon Jelly",
      "ReviewBody": "A concept well shown is happening within this album. Each track is titled a year aka the title, the year is important here because that is when the sampled tracks were created. So basically this album is a showcase of specific samples how you can create something new with the old. This album generally starts off a little on the droning side for me, it has an unnecassary talking track to start it off, and then builds into a cosntant rising action to kind of set the tone for whats to come. But other than that the start of the album is rather slow. It does start to pick up after the halfway point with some tracks that will definitely be making it a more heavy rotation. The sole reason I bought this album years ago, was for _'64 aka Go_, this track has a groovey, mystical kind of quality to it. It feels as though you are on a quest traveling through the Desert. It might also not be instantly noticable, but the vocal sample is from William Shatner.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.2,
      "TrackList": [
        "It Was...",
        1,
        "'88 aka Come Down on Me",
        3,
        "'68 aka Only Time",
        3,
        "'93 aka Don't Stop Now",
        2,
        "'95 aka Make Things Right",
        3,
        "'79 aka The Shouty Track",
        3,
        "'75 aka Stay With You",
        4,
        "'76 aka The Slow Train",
        4,
        "'90 aka A Man Like Me",
        4,
        "'64 aka Go",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Lemon Jelly\\'64-'95\\Cover.jpg",
      "Genre": [
        "Electronica"
      ],
      "Blurb": "It's drug music!",
      "NextUpText": "NEXT UP:\n\nA Broken Frame by Depeche Mode\n\nlooking forward to diving back into this band",
      "DatePosted": "2020-12-21T10:00:02.072903",
      "Listen1": "2020-12-17",
      "Listen2": "2020-12-18",
      "Listen3": "2020-12-19"
    },
    {
      "id": 20,
      "Title": "A Broken Frame",
      "Artist": "Depeche Mode",
      "ReviewBody": "Oh Depeche Mode, the originators of synth pop as we know it and you can definitely see the origins here. The ablum starts out on a bit of a slow note with _Leave in Silence_, but it slowely builds throughout the track, not to some grand crescendo, but definitely enough to keep your interest throughout. The energy stays at that mellow, yet still dancy level in the next track _My Secret Garden_. _Monument_ starts out with this intrigueing beat to start off with. At this point I was starting to lose a bit of interest after multiple listens, feeling that there was something missing from the composition. Then _See You_ comes on, and picks up the pace by quite a lot. _Satallite_ almost feels like an electronic reggea song, its got the skanking bum-pause-bum-bum thing going one (there's got to be a better way to describe that). _The Meaning of Love_ is just a classic, right up there with _Just Can't Get Enough_. Now the following track _Further Excerpts From: My Secret Garden_ is rather interesting, it almost feels like a part 2 instead of a revisit of the main song. It really takes the melancholy this album has been brewing and takes it one notch darker instead. Its also interesting that it wasn't placed after the song is revisiting. Overall the album does a great job of being *A Mood*, but sometimes it leaves a little to be desired, even though its a solid album all around.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Leave in Silence",
        3,
        "My Secret Garden",
        3,
        "Monument",
        3,
        "Nothing to Fear",
        3,
        "See you",
        3,
        "Satalite",
        3,
        "The Meaning of Love",
        4,
        "Further Excerpts From: My Secret Garden",
        3,
        "A Photograph of You",
        4,
        "Shouldn't Have Done That",
        3,
        "The Sun & the Rainfall",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Depeche Mode\\A Broken Frame\\Cover.png",
      "Genre": [
        "New Wave",
        "Synth-Pop"
      ],
      "Blurb": "looking forward to diving back into this band",
      "NextUpText": "NEXT UP:\n\nA Deathgrip On Yesterday by Atreyu\n\noh fuck yeah, I haven't listed to this album in like 10 years",
      "DatePosted": "2020-12-25T10:05:57.597312",
      "Listen1": "2020-12-17",
      "Listen2": "2020-12-18",
      "Listen3": "2020-12-19"
    },
    {
      "id": 21,
      "Title": "A Death-grip On Yesterday",
      "Artist": "Atreyu",
      "ReviewBody": "A classic album. I think I wore the cd out when I was in middle/high school. That first sharp intake of breath on _Creature_ always gets me in a mood. This album is full of angst, from the vocals to the guitars, to every fiber of every song. Even back when I first started listening to this album; I usually really dislike the more melodic-chanting type of chorus; I fell in love with choruses, they act as a nice break from the more heavy screaming centric verses. I think with _The Theft_, being the standout single from this album, always fell a bit short for me. I think the magic of the melodic/hardcore mashup didn't really work as well with this track as it has done with other tracks. Now _Ex's and Oh's_ on the other hand, what a catchy track. Everything about that track gets me absolutely pumped up. The song _My Fork in the Road..._ even though it got a three has a sick guitar solo that is defintiely worth checking out. Over all the album is just a bunhc of nostalgia for me, I still like it, but I don't know if I would like it as much if I didn't love it so much as a kid.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4,
      "TrackList": [
        "Creature",
        4,
        "Shameful",
        4,
        "Our Sick Story (Thus Far)",
        3,
        "The Theft",
        3,
        "We Stand Up",
        3,
        "Ex's And Oh's",
        5,
        "Your Private War",
        4,
        "My Fork In The Road (Your Knife In My Back)",
        3,
        "Untitled Finale",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Atreyu\\A Death-Grip On Yesterday\\Cover.jpg",
      "Genre": [
        "Melodic Metalcore"
      ],
      "Blurb": "oh fuck yeah, I haven't listed to this album in like 10 years",
      "NextUpText": "NEXT UP:\n\nA Jacknife to a Swan by The Mighty Mighty Bosstones\n\nWoo more ska!",
      "DatePosted": "2020-12-28T12:46:57.932689",
      "Listen1": "2020-12-24",
      "Listen2": "2020-12-25",
      "Listen3": "2020-12-26"
    },
    {
      "id": 22,
      "Title": "A Jackknife to a Swan",
      "Artist": "The Mighty Mighty Bosstones",
      "ReviewBody": "Oh The Mighty Mighty Bosstones, a ska classic. I don't think I had ever actually listened to this album all the way through before. It definitely has that early 2000's feel to it, got some slightly pop-punkier vibes than some of their earlier work. The album starts out strong with _A Jackknight to a Swan_. _Mr. Moran_ opens with a sample from some old movie or something, and I don't know why but I am always a sucker for those. _You Gotta Go!_ is: \"Pick it up, Pick it up, Pick it up!\" the song. The ablum definitely sllows down quite a bit with _Everybody's Better_. This song defintely has a kind of rocksteady vibe to it. The next two tracks, _Sugar Free_ and _I Want My City Back_, both take it back up to the ska punk that you would expect of the Bosstones. Nothing really much to say, they are solid tracks but don't really change, or mix anything up. I will say the mix of the ska punk sound with the rocksteady vibes does do a good job of breaking the album the album. I personally am not such a big fan of the rocksteady but it is nice in small doses. The opening of _The Old School Off the Bright_ starts out as kind of a bepop beat, I wish it stuck with it a bit longer before transitioning into the punk banger. _The Punch Line_ is definetly one of the highs of this album, just a classic Bosstones track. The Organ on _Shit Outta Luck_ is always a highlight for me, I don't know what it is about that organ sound but I can't get enough of it. Overall this album is a ska classic, it doesn't really do anything special but its by no means bad.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "A Jackknife To A Swan",
        4,
        "Mr. Moran",
        3,
        "You Gotta Go!",
        4,
        "Everybody's Better",
        2,
        "Sugar Free",
        3,
        "I Want My City Back",
        3,
        "Chasing The Sun Away",
        3,
        "You Can't Win",
        3,
        "THe Old School Off The Bright",
        3,
        "The Punch Line",
        4,
        "Go Big",
        3,
        "Shit Outta Luck",
        3,
        "7-Ways to Sunday",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mighty Mighty Bosstones, The\\A Jackknife To A Swan\\Cover.jpg",
      "Genre": [
        "Ska Punk",
        "Third-Wave Ska"
      ],
      "Blurb": "Woo more ska!",
      "NextUpText": "NEXT UP:\n\nA Lesson in the Abuse of Information Technology by The Menzingers\n\nWhile this isn't my favorite album from them, the album is still pretty good",
      "DatePosted": "2021-01-01T10:00:11.425381",
      "Listen1": "2020-12-24",
      "Listen2": "2020-12-25",
      "Listen3": "2020-12-26"
    },
    {
      "id": 23,
      "Title": "A Lesson in the Abuse of Information Technology",
      "Artist": "The Menzingers",
      "ReviewBody": "The first full length album from Pennsylvania based Menzingers. This album is a classic example of mid 2000's punk. The album definitely starts out strong, but really comes into it's own during the titular track. You can definitely see the roots of some of their most popular tracks beginning to take hold here. _Ave Maria_ my favorite track off the album, it has this nostalgic quality to it. _Coal City Blues_ just drops the pace of the album, I know its basically a requirment for punk bands to have atleast one or two slow songs but they are always my least favorite on the album. The next track, _Keychain_, brings us right back to the action. that first line always gets me hyped \"I feel my teeth turning black...\". _Even for an Eggshell_ is rather interesting as well, its a song about Hamlet, and its a really cool take. _Richard Coury_ is the second of like four slow tracks on this album, this songs saving grace is that it gets really good about halfway through. _Straight to Hell_ has got the early markings of _I don't want to be an Asshole Anymore_ written all over it. _Cold Weather Gear_ is really just a sample over some acoustic strumming, there is some actual track in here but its doewsn't have enough going on for me. The last hurrah of the album, _Clap Hands Two Guns_, tries to get us back to the highs of the earlier portion of the album, but with a harder edge to it. Overall this album is fantastic, it has a few rough spots which should probably drop it to a three, but I think the highs are worth the jump to a four.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "Alpha Kappa Fall Of a Balcony",
        3,
        "Sir Yes Sir",
        3,
        "A Lesson In The Abuse Of Information Technology",
        4,
        "Ave Maria",
        5,
        "Coal City Blues",
        2,
        "Keychain",
        4,
        "Even For an Eggshell",
        3,
        "Richard Coury",
        3,
        "Straight to Hell",
        3,
        "Victory Gin",
        3,
        "Cold Weather Gear",
        1,
        "Clap Hands Two Guns",
        3,
        "No Ticket",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Menzingers, The\\A Lesson in the Abuse of Information Technology\\Cover.jpg",
      "Genre": [
        "Punk Rock",
        "Post-Hardcore"
      ],
      "Blurb": "While this isn't my favorite album from them, the album is still pretty good",
      "NextUpText": "NEXT UP:\n\nA Picture of Finn Farting by Renard\n\nOh boy, some more lapfox trax. Lets hope I like this better than Bandetto",
      "DatePosted": "2021-01-04T10:00:20.228157",
      "Listen1": "2020-12-31",
      "Listen2": "2021-01-01",
      "Listen3": "2021-01-02"
    },
    {
      "id": 24,
      "Title": "A Picture of Finn Farting",
      "Artist": "Renard",
      "ReviewBody": "I believe this album is a bunch of unreleased/unfinished tracks that I donloaded from Renard for free. Typically I don't like the commentary on songs like these but _THE RETRO COMEBACK BAD EXPERIENCE_ has a commentary intro that I don't particularily mind. I believe this is more about the fact that the song is really fucking oitherwise. I think the track _GOT MY PONY SPAM FOR YOU_ would have easiliy jumped to a 4 if it didn't have such a long intro about hand farts. Besides the talking portions this album is a fast paced gem. _WHO'S READY FOR THE BASEMENT_ has quite the littany of samples throughout, it's almost a game in and of itself to try and pick out all the samples. The track _VS PSYCHOLOGY_ which is a stevie wonder cover, has this really cool spooky, ambient sound to it. The next few tracks are good, but you c an defitely see their unfinished nature. Everything starts to pick back up for me when _YOU GOT CURVES, SHE GOT CURVES_ starts playing. The final track, _DARK TONY HAWK IS BORN_ is the gem on this album. It is such a great track, featuring a sample from Adventure Time of Marceline singing about her father. Overall its a solid little mixtape featuring some uncut/unfinished work but I think the pieces themselves are good enough hold their own.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "THE RETRO COMEBACK BAD EXPERIENCE",
        4,
        "GOING TO RIP ON THE BUTT",
        2,
        "GOT MY PONY SPAM FOR YOU",
        3,
        "WHO GIVES A FUCK",
        3,
        "WHO'S READY FOR THE BASEMENT",
        3,
        "VS PSYCHOSHY",
        3,
        "BURGIN.........",
        3,
        "DAGGONE BIEBERON",
        3,
        "TAGALOG LIKE IT WAS BEYON WORTH",
        2,
        "TUMBLR GOT SOUL",
        1,
        "YOU GOT CURVES, SHE GOT CURVES",
        3,
        "WI-FI BRIDGE",
        3,
        "DARK TONY HAWK IS BORN",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Renard\\A Picture of Finn Farting\\Cover.jpg",
      "Genre": [
        "Electronic"
      ],
      "Blurb": "Oh boy, some more lapfox trax. Lets hope I like this better than Bandetto",
      "NextUpText": "NEXT UP:\n\nA Place Where the Sun is Silent by Alesana\n\nNow this... this is a Grade-A lowus band. I remember falling off after the first few albums but still really good",
      "DatePosted": "2021-01-08T10:00:18.022232",
      "Listen1": "2020-12-31",
      "Listen2": "2021-01-01",
      "Listen3": "2021-01-02"
    },
    {
      "id": 25,
      "Title": "A Place Where the Sun is Silent",
      "Artist": "Alesana",
      "ReviewBody": "We have another rock opera style album. This is a post-hardcore edition with the premise focusing on Dante's inferno. The album starts out, _The Dark Wood of Error_, with a lilting melody featuring a duet between the male and female singers. Almost haunting in a way, it really sets the mood for the rest of the album. The first actual track of the album is, _A Forbidden Dance_, they definitely toned down the screaming for this album, its still there for sure, but just not as often as some previous albums. I'm changing my opinion on _Hand in Hand with the Damned_ this track fucking rocks. The build up for the next track, _Beyond the Sacred Glass_ is mindblowing as well. The guitar solo pretty much makes this song. The next track _The Temptress_ has this chorus that I cannot stand in this kind of genre, thats the reason for the low star rating. Another stand out is _Circle VII: Sins of the Lion_, the chorus on this song just gets me so hyped up. The next Track _Vestige_ is a nice break from the hardcore sound, although I think the instrumental version is better. _Lullaby of the Crucified_ marks a fantastic end to Act One, being a rock opera this album is broken up into two eight song acts. After a bit of a lull, _Lybyrinth_ brings us right back to the action. The hardcore screaming a nice compliment to some of the softer elements. After _Welcome to the Vanity Faire_ the album starts to shift towards a more carnival-esque sound, there has to be a better descriptor than that. Overall this is another great album, I think this might be my favorite Alesana album period.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "The Dark Wood Of Error",
        2,
        "A Forbidden Dance",
        3,
        "Hand In Hand With the Damned",
        3,
        "Beyond the Sacred Glass",
        4,
        "The Temptress",
        2,
        "Circle VII: Sins of the Lion",
        4,
        "Vestige",
        3,
        "Lullaby of the Crucified",
        4,
        "Before Him all Shall Scatter",
        1,
        "Labryinth",
        4,
        "The Fiend",
        3,
        "Welcome to the Vanity Faire",
        4,
        "The Wanderer",
        2,
        "A Gilded Masquerade",
        3,
        "The Best Laid Plans of Mice and Marionettes",
        4,
        "And Now for the Final Illision",
        3,
        "The Dark Wood of Error (Score)",
        3,
        "Vestige (Score)",
        3,
        "Lullaby of the Crucified (Score)",
        4,
        "Before Him All Shall Scatter (Score)",
        4,
        "The Wanderer (Score)",
        3,
        "A Gilded Masquerade (Score)",
        4,
        "The Best Laid Plans of Mice and Marionettes (Score)",
        4,
        "And Now for the Final Illusion (Score)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Alesana\\A Place Where the Sun is Silent\\Cover.jpg",
      "Genre": [
        "Post-Hardcore",
        "Symphonic Rock"
      ],
      "Blurb": "Now this... this is a Grade-A lowus band. I remember falling off after the first few albums but still really good",
      "NextUpText": "NEXT UP:\n\nA Series of Sneaks by Spoon\n\nclassic Texas Indie",
      "DatePosted": "2021-01-11T10:00:22.732692",
      "Listen1": "2021-01-07",
      "Listen2": "2021-01-08",
      "Listen3": "2021-01-09"
    },
    {
      "id": 26,
      "Title": "A Series of Sneaks",
      "Artist": "Spoon",
      "ReviewBody": "The second full length album by Spoon. Classic indie rock at it's finest. Spoon is unironically the soundtrack to the years 2000-2005 for me. I think this is one of those albums that you can play anywhere and people will get into it. This is one of those albums thats hard to get into specifics with, since all the tracks feel the same, but are distinctly different. But tracks like _Reservations_ are really a standout. It's such a groovey track. _30 Gallon Tank_ is just rising action the song. All the songs on the album are just fun songs. We see things slowing down a bit when we get to _Metal Detektor_. I actually changed my mind on _June's Foreign Spell_ while listening to it for the review. That song is actually a four and not a three. Overall not much to say, but give this album a listen if you get a chance.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Utilitarian",
        3,
        "The Minor Tough",
        3,
        "Execution",
        3,
        "Reservations",
        4,
        "30 Gallon Tank",
        4,
        "Car Radio",
        3,
        "Metal Detektor",
        3,
        "June's Foreign Spell",
        4,
        "Chloroform",
        3,
        "Metal School",
        3,
        "Staring At The Board",
        3,
        "No You're Not",
        3,
        "Quincy Punk Episode",
        4,
        "Advance Cassette",
        3,
        "Laffitte Don't Fail Me Now",
        3,
        "The Agony Of Laffitte",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Spoon\\A Series of Sneaks\\Cover.jpg",
      "Genre": [
        "Indie Rock"
      ],
      "Blurb": "classic Texas Indie",
      "NextUpText": "NEXT UP:\n\nA Thousand Leaves by Sonic Youth\n\nIt's not their best album, but its not bad",
      "DatePosted": "2021-01-15T10:00:22.732692",
      "Listen1": "2021-01-07",
      "Listen2": "2021-01-08",
      "Listen3": "2021-01-09"
    },
    {
      "id": 27,
      "Title": "A Thousand Leaves",
      "Artist": "Sonic Youth",
      "ReviewBody": "This is one of the sonic youth albums I never really got around too, Their earlier albums are the ones I've spent the most time on. The album does start out a little rough for me with _Contre Le Sexisme_, being mostly a silence/noise track. Things start picking up with _Sunday_, definitely harkens a lot to the 90s indie sound but does a nice job of not feeling too repetitive. When the bridge kicks back up towards the middle of _Wildflower Soul_ I feel it. I think this album definitely has some high highs, but also some low lows. I guess that is one of the issues with Art Rock, you can find some really cool sounds but you can never really stick with them for too long. Most of the songs do a nice job of jumping between a softer side and then a harder edgier side. Overall I think the album has some good pieces, but I don't think it will make it as an everyday staple.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.7,
      "TrackList": [
        "Contre Le Sexisme",
        1,
        "Sunday",
        3,
        "Female Mechanic Now on Duty",
        3,
        "Wildflower Soul",
        4,
        "Hoarfrost",
        3,
        "French Tickler",
        3,
        "Hits of Sunshine (For Allen Ginsberg)",
        3,
        "Karen Koltrane",
        3,
        "The Ineffable Me",
        3,
        "Snare, Girl",
        2,
        "Heather Angel",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Sonic Youth\\A Thousand Leaves\\Cover.jpg",
      "Genre": [
        "Post-Rock",
        "Experimental Rock"
      ],
      "Blurb": "It's not their best album, but its not bad",
      "NextUpText": "NEXT UP:\n\nA Weird Exits by Thee Oh Sees\n\nThe second half of a 2 part ep, The album art is by Robert Beaty and is awesome",
      "DatePosted": "2021-01-18T10:00:16.344679",
      "Listen1": "2021-01-14",
      "Listen2": "2021-01-15",
      "Listen3": "2021-01-16"
    },
    {
      "id": 28,
      "Title": "A Weird Exits",
      "Artist": "Thee Oh Sees",
      "ReviewBody": "I have probably listened to this album about thrity times before I ever bought it. Such a wild and fun ride. This is still on the more lofi-gargey side before they moved in a more progressive route for their later albums. The first track _Dead Man's Gun_ definitely sets the stage, it's nice and jammy with sick solo right in the middle. _Ticklish Warrior_ carries the momentum and kind of adds a Wall of Sound type ascetic. The next track _Jammed Entrance_ is this albums jam track. It's a good jam, but nothing special as well. _Plastic Plant_ kicks everything into overdrive. That guitar riff at the beginning just makes you want to mosh. _Gelatinous Cube_ keeps that energy high, I think I just like loud and fast guitars, which is waht this album is mostly. The album generall slows down quite a bit after that last track. _Unwrap the Friend, Pt.2_ is another jam track, still fun but more carries the energy rather than build it up or down. The jamming continues with _Crawl Out From the Fall Out_; it's more of a noise-y thing than a jammy track, but about halfway through it starts to get a bit more instrumental. Finally _The Axis_ almost has a religious quality to it. Feels like the end of an acid trip when your ramblings are starting to sound prophetic. The organ defintely helps in that regard. Overall I think this is a fucking fantastic album, not for everyone but for a fan of Dwyer or Oh Sees its a must listen.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.75,
      "TrackList": [
        "Dead Man's Gun",
        5,
        "Ticklish Warrior",
        4,
        "Jammed Entrance",
        3,
        "Plastic Plant",
        4,
        "Gelatinous Cube",
        5,
        "Unwrapt The Friend, Pt.2",
        3,
        "Crawl Out From The Fall Out",
        2,
        "The Axis",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thee Oh Sees\\A Weird Exits\\Cover.jpg",
      "Genre": [
        "Garage Rock",
        "Psychedelic Rock"
      ],
      "Blurb": "The second half of a 2 part ep, The album art is by Robert Beaty and is awesome",
      "NextUpText": "NEXT UP:\n\nabout by HYI\n\nI remember this album being hyped up, but I never got around to it",
      "DatePosted": "2021-01-22T10:00:16.593834",
      "Listen1": "2021-01-14",
      "Listen2": "2021-01-15",
      "Listen3": "2021-01-16"
    },
    {
      "id": 29,
      "Title": "about",
      "Artist": "HYI",
      "ReviewBody": "Two weeks in a row we have albums starting with nothing/noise tracks at the beggining. For the most part _about_ is a rather chill affair. _ephemera_ takes a couple minutes to pick up, but when it does, holy shit does it pick up. We ride that high from the last minute or so right into _she spoke of it_; a banger all the way through, I think it's my favorite song on the album overall. We slow things down a bit when move to _inside out star tree_ and amp up the glitchiness when we get to _end of ice_. I really like _end of ice_ but I wish it would go someplace instead of just building a mood. THe track _animal crossing_ has this really interesting eastern sound to it. I really can't decide if _animal crossing_ or _she spoke of it_ are my favorites but defintiely two standouts of the album. Overall I think this is a good entry point for the new fursona, hyi, but I really can't wait to see what happens in their second album.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.9,
      "TrackList": [
        "regardless",
        1,
        "ephemera",
        3,
        "she spoke of it",
        4,
        "inside out star tree",
        3,
        "end of ice",
        3,
        "centaur",
        3,
        "sniper gazing upon the sun",
        2,
        "animal crossing",
        4,
        "take care, lady legs",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\hyi\\about\\Cover.png",
      "Genre": [
        "Glitch"
      ],
      "Blurb": "I remember this album being hyped up, but I never got around to it",
      "NextUpText": "NEXT UP:\n\nAcid Intraveneous by Renard + Adraen\n\nmore Lapfox trax, bring them on",
      "DatePosted": "2021-01-25T10:00:04.185081",
      "Listen1": "2021-01-21",
      "Listen2": "2021-01-22",
      "Listen3": "2021-01-23"
    },
    {
      "id": 30,
      "Title": "Acid Intraveneous",
      "Artist": "Renard vs Adraen",
      "ReviewBody": "More Lap Fox Trax (or whatever it's going by now). Always a good time, I believe Renard is the sample, straight electronic fursona, but I don't remember what Adraen is off the top of my head. _Night Ride_ lives up to its name, this song would make a great addition to a driving game. The song is basically all rising action. The drum and base is strong with _Not So Bad_, it starts out a little slow for my taste but it definitely picks up the action. The next two tracks _You Goddamn Fish_ and _Way High_ are both a little on the slow side for me. _Physicallity_ is a really interesting track that uses a System of a Down sample. Really fun track. Overall the album is a short and fun, sample/jungle get down.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "Night Ride",
        3,
        "Not So Bad",
        3,
        "You Goddamn Fish",
        2,
        "Way High",
        3,
        "Better Than Real",
        4,
        "Physicality",
        4,
        "Happy Where it Counts",
        3,
        "Punk Anthem Track",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Renard vs Adraen\\Acid Intravenous\\Cover.jpg",
      "Genre": [
        "Electronic"
      ],
      "Blurb": "more Lapfox trax, bring them on",
      "NextUpText": "NEXT UP:\n\nThe Adolescents by The Adolescents\n\nclassic socal punk, this album is fantastic",
      "DatePosted": "2021-01-29T10:12:21.296241",
      "Listen1": "2021-01-21",
      "Listen2": "2021-01-22",
      "Listen3": "2021-01-23"
    },
    {
      "id": 31,
      "Title": "Adolescents",
      "Artist": "Adolescents",
      "ReviewBody": "The first Album from Adolescents. This is **the** Socal Punk album. One of the greatest of all time. Every track is a fast throwdown that just makes you want to mosh. The first few tracks _I Hate Children_, _Who Is Who?_, _Wrecking Ball_, and _L.A. Girl_ are all great tracks, a little on the samesies side for most of them. They all feature that fast as a whip thrash sound. The album startes to really pick up for me during _Kids of the Black Hole_. The sound changes up a bit, its quite a bit longer at five and half minutes versus the one and half minute tracks preceding it. The slow build of the track, that leads into that solo is really something else, not something you were seeing out of a ton of punk bands at the time. _No Way_ starts out with that guitar solo to really bring the energy back up in preperation for the next track. _Amoeba_ is the track that got them famous. The track so good a record store named themselves after it. Such a catchy jam, I don't know a person that couldn't get it into. When you say thrash punk, you think Amoeba. Skipping a few tracks, _Democracy_ turns out to be really timeless, the same sentiments exist fourty years after this album came out. _No Friends_ is the next track on the list. This song got a four strictly for that solo towards the end. _Creatures_ has this energy, another fun track. Overall this album is one of the greatest, a little on the samesies side to warrent a five, but this is definitely going in heavy rotation",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.3,
      "TrackList": [
        "I Hate Children",
        3,
        "Who Is Who?",
        3,
        "Wrecking Crew",
        3,
        "L.A. Girl",
        3,
        "Self Destruct",
        2,
        "Kids of the Black Hole",
        4,
        "No Way",
        4,
        "Amoeba",
        5,
        "Word Attack",
        3,
        "Rip It Up",
        3,
        "Democracy",
        3,
        "No Friends",
        4,
        "Creatures",
        4,
        "Welcome to Reality",
        3,
        "Losing Battle",
        3,
        "Things Start Moving",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Adolescents\\Adolescents\\Cover.png",
      "Genre": [
        "Punk Rock"
      ],
      "Blurb": "classic socal punk, this album is fantastic",
      "NextUpText": "NEXT UP:\n\n(Knight) by RQ\n\nI wonder if this character is going to register correctly. THe answer is no",
      "DatePosted": "2021-02-01T10:00:08.513808",
      "Listen1": "2021-01-28",
      "Listen2": "2021-01-29",
      "Listen3": "2021-01-30"
    },
    {
      "id": 32,
      "Title": "(Knight)",
      "Artist": "RQ",
      "ReviewBody": "RQ is the rebrand of Renard Queenstone, I think RQ is much catchier and was a good choice. First thing you might notice is that we are back in the symbols, well we actually have to jump back for a few albums till we fill out those sections. You also might notice that there is a thousand different symbols, this is what broke the bot a while ago. Starting off the first track is literally a second long, seriously why do artists do this stuff, it's not like there is a track quota on albums. For the most part this album is _fine_, nothing special and nothing terrible. That being said there are two tracks in particular that are really good. _THE DEMONS_ has this really interesting sample, presumadly from a televangelist, that plays throughout it. The followup up track _[Rush Coil]_, is also worth noting here. The mix of an organ with a trap beat is something I never knew I needed before now. Other than those two, the other tracks aren't bad, just nothing else worth saying. Overall it's a fun album that is definitely worth a listen.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "I",
        1,
        "II",
        3,
        "III",
        3,
        "IV",
        3,
        "V",
        3,
        "VI",
        3,
        "VII",
        4,
        "VIII",
        4,
        "IX",
        3,
        "X",
        3,
        "Bonus",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\RQ\\(Knight)\\Cover.jpg",
      "Genre": [
        "Trappy Hardcore",
        "Synth Jam"
      ],
      "Blurb": "I wonder if this character is going to register correctly. THe answer is no",
      "NextUpText": "NEXT UP:\n\n2YR, 40:28.649 by HALLEY LABS Associates\n\nAgain I have no idea what to expect",
      "DatePosted": "2021-02-05T10:00:09.393870",
      "Listen1": "2021-01-28",
      "Listen2": "2021-01-29",
      "Listen3": "2021-01-30"
    },
    {
      "id": 33,
      "Title": "2YR, 40:28.649",
      "Artist": "HALLEY LABS Associates",
      "ReviewBody": "I don't think I've ever listened to an \"experiental\" album before. To me it just seemed like almost ambient electronica. For the most part this album is pretty chill, whith some fun upticks. _Cat Tail Lake_ is very much like that, the first half is pretty chill and ambient, but then it morphs into this bouncy jam track. It eventually leads to the track, _Wasn't All There_, which I do like, in parts. I usually kind of like the effect of the radio static, as if you are changing stations; but it's used to such an extent that it actually does the opposite for me here. Then we get to _Tweesee Smiled_ and what a track to go out on. It's got some heavy Dnb vibes, that breaks down into like a vgm guitar riff. After that transition it becomes an airy, trance song. Overall I don't think I like this album that much, but there are a few tracks that definitely make it worth while.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.9,
      "TrackList": [
        "Rail Trail",
        2,
        "Bathing in Stygian Blue",
        3,
        "Carried to Our Grave",
        3,
        "Cat Tail Lake",
        4,
        "Pull Yourself Together",
        2,
        "Wasn't All There",
        1,
        "Driving Again, Blinding Blackness",
        3,
        "Eros' Gae; Ooze",
        3,
        "Cataclysm at Lakeshore",
        3,
        "Tweesee Smiled",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\HALLEY LABS Associates\\2YR, 40-28.649\\Cover.jpg",
      "Genre": [
        "Experiential"
      ],
      "Blurb": "Again I have no idea what to expect",
      "NextUpText": "NEXT UP:\n\nAdore by Smashing Pumpkins\n\n90s classic band, I don't think I actually like them that much",
      "DatePosted": "2021-02-08T10:00:11.973592",
      "Listen1": "2021-02-04",
      "Listen2": "2021-02-05",
      "Listen3": "2021-02-06"
    },
    {
      "id": 34,
      "Title": "Adore",
      "Artist": "Smashing Pumpkins",
      "ReviewBody": "I don't know if this was the best album to jump in to Smashing Pumpkins with. This album is very 90's alternative, but it does mix some electronic elements into it. The first two tracks _To Shiela_ and _Ava Adore_ are a little on the art house style for me, a little too slow as well. _Perfect_ is more inline with what I would expect from Smashing pumpkins. Then in _Daphne Descends_ it goes back to that moody electronic sound. The next series of tracks, aren't bad just a little on the boring side. This album feels very 90's at points, thats not necassarily a bad thing but it can be. The track _Appels + Oranjes_ leans very heavily into the electronic sound, almost going full on Moby Electronic. _Pug_ stays on the electronic bend that the previous track sets up, but is a lot more high enegery. _Annie-Dog_ starts out as a slow piano driven dirge, but slowely builds and builds over the course of its run time. Overall I don't think this album is bad, its just not really for me. The few standouts are the only thing holding this album at a three for me.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.8,
      "TrackList": [
        "To Shiela",
        2,
        "Ava Adore",
        3,
        "Perfect",
        4,
        "Daphne Descends",
        3,
        "Once Upon A Time",
        3,
        "Tear",
        3,
        "Crestfallen",
        1,
        "Appels + Oranjes",
        3,
        "Pug",
        4,
        "The Tale of Dusty & Pistol Pete",
        3,
        "Annie-Dog",
        4,
        "Shame",
        3,
        "Behold! The Night Mare",
        3,
        "For Martha",
        3,
        "Blank Page",
        2,
        "17",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Smashing Pumpkins\\Adore\\Cover.jpg",
      "Genre": [
        "Electronic Rock",
        "Art Rock"
      ],
      "Blurb": "90s classic band, I don't think I actually like them that much",
      "NextUpText": "NEXT UP:\n\nAdrenaline by Deftones\n\nI love this band, but I don't remember this album at all",
      "DatePosted": "2021-02-12T10:02:22.036130",
      "Listen1": "2021-02-04",
      "Listen2": "2021-02-05",
      "Listen3": "2021-02-06"
    },
    {
      "id": 35,
      "Title": "Adrenaline",
      "Artist": "Deftones",
      "ReviewBody": "The first album from Deftones. It definitely is a lot rougher around the edges than some of their new material. Still pretty good but could use a bit of refinement. The first track, _Bored_, is my favorite on the album, has a really nice chorus running through it. _One Weak_ is another track that has a pretty good chorus, not good enough to bump it up, but still pretty good. Some of the bass grooves on this album, are absolutely fantastic though. The next few tracks, _Nosebleed_ and _Lifter_, both are pretty overtly aggro tracks. _Lifter_ in particular does have a really good rising action through out it. _Root_ has a nice riff to as well. There isn't really a ton to say about most of these songs, they are all pretty samey. Which is not unexpected from a band like Deftones, especially in their early state. They do slow things down a bit in songs like, _Birthmark_ or _Fireal_, defintely when I think their sound gets real interesting. Overall I think this is a good enough showing from deftones but their later albums are definitely way better.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Bored",
        4,
        "Minus Blindfold",
        3,
        "One Weak",
        3,
        "Nosebleed",
        3,
        "Lifter",
        3,
        "Root",
        3,
        "7 Words",
        3,
        "Birthmark",
        3,
        "Engine No. 9",
        3,
        "Fireal",
        3,
        "Fist",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Deftones\\Adrenaline\\Cover.png",
      "Genre": [
        "Post-Hardcore",
        "Alternative Metal"
      ],
      "Blurb": "I love this band, but I don't remember this album at all",
      "NextUpText": "NEXT UP:\n\nAdventures With Tweesee by Darius + Rotteen\n\nWe got a whole lot of fusion going on here, Am Excite",
      "DatePosted": "2021-02-15T10:00:11.270471",
      "Listen1": "2021-02-11",
      "Listen2": "2021-02-12",
      "Listen3": "2021-02-13"
    },
    {
      "id": 36,
      "Title": "Adventures With Tweesee",
      "Artist": "Darius + Rotteen",
      "ReviewBody": "Holy shit there is a lot of fusion going on in this album. I forgot how much I like trance music, but this album 100% reminded me why I do. _Everblossom Train_ sounds like going to the arcade in 2005 to me. I think something almost exactly like this was coming out of the DDR machine. Everytime I try to sit down and write something, I get swept up in the music. It makes it very difficult to review the tracks. Overall every track is a sick build up, not much to say other than this is fucking awesome.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4.3,
      "TrackList": [
        "Why Wolves",
        3,
        "Wild Dog Watching",
        4,
        "Everblossom Train",
        4,
        "Mars Needs Ravers",
        5,
        "I Built The Tower To God With Motion",
        4,
        "Wilted Weeping PCB",
        4,
        "Two Cirrate Cubiforms",
        5,
        "Intimate With the Fire Bird",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Darius + Rotteen\\Adventures With Tweesee\\Cover.jpg",
      "Genre": [
        "Progressive Fusion",
        "Rave Fusion"
      ],
      "Blurb": "We got a whole lot of fusion going on here, Am Excite",
      "NextUpText": "NEXT UP:\n\nAenima by Tool\n\nWOO MORE TOOL!",
      "DatePosted": "2021-02-19T10:00:14.295863",
      "Listen1": "2021-02-11",
      "Listen2": "2021-02-12",
      "Listen3": "2021-02-13"
    },
    {
      "id": 37,
      "Title": "Aenima",
      "Artist": "Tool",
      "ReviewBody": "I think I've really only listened to the singles off this album. For whatever reason, they decided to cut the last minute or two off of one of their jam tracks and make it into a seperate track. Maybe it was to increase the track count but it drives me crazy. Now there are like five \"songs\" that have the potential to end up in a shuffle that is just noise. If those tracks were really necassary to the album then just keep them apart of the longer songs so they are \"unskippable\". Now back to the actual review. _Stinkfist_ starts off the album pretty strong. Definitely sets a good mood, with that mysterious sounding riff mixed with the bongos. _Eulogy_ keeps up the air of mystique that is prevalent throughout this album. The song doesn't really start picking up until about halfway through it's eight minute run time. Most of these songs are just shifting and changing the mood from a heady slow jam, into the more aggro metal portions. _H._ is definitely one of those tracks. The track _Hooker with a Penis_ kind of solidies this band as the frat band it kind of is. _Pushit_ is another one of the singles that I've heard before, this is definitely one of their better songs. While it is another slow build over its almost ten minute runtime, what's interesting is the call back to previous verses as it builds up. So it will go chorus, build, chorus, build a bit faster, so on and so forth. Now we get to the tracks that I really liked. _AEnema_ and _Third Eye_. Even though I called tool a frat band earlier, they are also very much hippy-ish as well, if you couldn't tell by the obvious drug references everywhere. Overall the album is good, it would be better without those five noise tracks, but I definitely think there is something to enjoy here.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.7,
      "TrackList": [
        "Stinkfist",
        3,
        "Eulogy",
        3,
        "H.",
        3,
        "Useful Idiot",
        1,
        "Forty Six & 2",
        3,
        "Message to Marry Manback",
        1,
        "Hooker with a Penis",
        3,
        "Intermission",
        1,
        "Jimmy",
        3,
        "Die Eier von Satan",
        1,
        "Pushit",
        3,
        "Cesaro Summability",
        1,
        "Aenema",
        4,
        "(-) Ions",
        1,
        "Third Eye",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Tool\\Aenima\\Cover.jpg",
      "Genre": [
        "Alternative Metal",
        "Progressive Metal"
      ],
      "Blurb": "WOO MORE TOOL!",
      "NextUpText": "NEXT UP:\n\n12 Bar Bruise by King Gizzard & The Lizard Wizard\n\nThe very first King Gizz album, excited to listen to this",
      "DatePosted": "2021-02-22T10:00:11.436469",
      "Listen1": "2021-02-18",
      "Listen2": "2021-02-19",
      "Listen3": "2021-02-20"
    },
    {
      "id": 38,
      "Title": "AFI [The Blood Album]",
      "Artist": "AFI",
      "ReviewBody": "This is the latest album from AFI. You can definitely hear a little bit of DECEMBERUNDERGROUND in the sound, but it does sound evolved in ways too. We start the album with _Dark Snow_, a nice brooding track that has a nice energy to carry it through. It almost has a new wave kind of quality to it as well. The next track _Still a Stranger_ has this acoustic guitar opening that I don't know how to place, but it always reminds me of anything kind of gothy like the self titled Blink-182 album. It does then immediately break down into a much faster riff structure. This song almost has a REM kind of vibe to it as well. _Hidden Knives_ has such a sick chorus on it. _So Beneath You_ is easily one of the best tracks on the album. _Dumb Kids_ is another really standout song to me. When it breaks into that \"Heeeeeyyyyyyyyy....\" part, gives me goosebumps. Such a fast fun track, very remiscent of some of their other fun tracks from Crash Love. _Pink Eyes_ on the other hand, has a chorus that kind of makes me groan a bit. _Feed From the Floor_ is the last track that I especially like, the rest of the tracks aren't bad, just not amazing. This album really feels like a love child between emo and new wave, I think _Feed From the Floor_ really accents that. Overall for being the second full length AFI album that I have listened to all the way through, it's really good. Kind of gets a bit too poppy in certain segments for me, but the songs that land; land fucking hard.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.6,
      "TrackList": [
        "Dark Snow",
        3,
        "Still a Stranger",
        4,
        "Aurelia",
        3,
        "Hidden Knives",
        4,
        "Get Hurt",
        3,
        "Above the Bridge",
        4,
        "So Beneath You",
        5,
        "Snow Cats",
        4,
        "Dumb Kinds",
        5,
        "Pink Eyes",
        3,
        "Feed From the Floor",
        4,
        "White Offerings",
        3,
        "She Speaks the Language",
        3,
        "The Wind That Carries Me Away",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\AFI\\AFI [The Blood Album]\\Cover.jpg",
      "Genre": [
        "Post-Punk",
        "Gothic Rock"
      ],
      "Blurb": "The newest Self titled from AFi, never listened to this before",
      "NextUpText": "NEXT UP:\n\nAgainst the Grain by Bad Religion\n\n90s bad religion, I don't remmber if this stuff is good (It is)",
      "DatePosted": "2021-02-26T10:03:17.916778",
      "Listen1": "2021-02-18",
      "Listen2": "2021-02-19",
      "Listen3": "2021-02-20"
    },
    {
      "id": 39,
      "Title": "12 Bar Bruise",
      "Artist": "King Gizzard & The Lizard Wizard",
      "ReviewBody": "The very first King Gizz album. I had really only listened to their crazy changing genre albums that they eventually evolveed into. But seeing as this album came out in 2012, I know for a fact this album would have been on all the time if I had known about it at that time. It's almost got the vocals of a fidlar track, but with a bit more production value. For the most part the album is pretty standard garage punk. Loud, Fast, and jammy. Until you get to _Sam Cherry's Last Shot_. It's a really interesting vocal clip of some old show (presumadly) backed by music. The track _Uh Oh, I Called Mom_ is another really fun track. Overall this is a fun album, even though its a 3 its still going on the normal listening routine.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.3,
      "TrackList": [
        "Elbow",
        3,
        "Muckraker",
        3,
        "Nein",
        3,
        "12 Bar Bruise",
        3,
        "Garage Liddiard",
        3,
        "Sam Cherry's Last Shot",
        4,
        "High Hopes Low",
        3,
        "Cut Throat Boogie",
        4,
        "Bloody Ripper",
        3,
        "Uh Oh, I Called Mom",
        4,
        "Sea Of Trees",
        3,
        "Footy Footy",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\King Gizzard & The Lizard Wizard\\12 Bar Bruise\\Cover.jpg",
      "Genre": [
        "Garage Punk"
      ],
      "Blurb": "The very first King Gizz album, excited to listen to this",
      "NextUpText": "NEXT UP:\n\n26 by Sithu Aye\n\nI've only really listened to one album from this guy, it was so good I spent $70 on his discography",
      "DatePosted": "2021-03-01T10:13:22.198276",
      "Listen1": "2021-02-25",
      "Listen2": "2021-02-26",
      "Listen3": "2021-02-27"
    },
    {
      "id": 40,
      "Title": "26",
      "Artist": "Sithu Aye",
      "ReviewBody": "Ahh _Sithu Aye_, a recent favorite of mine. I have spent most of the time listening to his album _Set Course for Andromeda_. This album is celebration of his recent birthday (at the time), graduating with his physics degree, and the 10 year anniversary of his first album that he released on September 26th while living in a house with a door plate numbered `26`. Sithu Aye describes himself as happy progressive genre, that definitely seems to track, although I would argue its more straight progressive myself. The first song on the ep is _Mandalay_. As the song hits it's climax, it gets into this really powerful solo. One of the things I really like about his music, is that it really feels like its taking you on a journey. The titular track _26_, almost has a post-hardcore vibe to it, feels almost like a solo medley from _Dance Gavin Dance_ or similar band. Overall a fantastic ep, currently one of my favs.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 5,
      "SongAvg": 5,
      "TrackList": [
        "Mandalay",
        5,
        "Eclipse",
        5,
        "26",
        5,
        "Hypatia (Bonus Track)",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Sithu Aye\\26\\Cover.jpg",
      "Genre": [
        "Djent",
        "Progressive Metal"
      ],
      "Blurb": "I've only really listened to one album from this guy, it was so good I spent $70 on his discography",
      "NextUpText": "NEXT UP:\n\nAgainst the Grain by Bad Religion\n\n90s bad religion, I don't remmber if this stuff is good (It is)",
      "DatePosted": "2021-03-05T10:00:15.897717",
      "Listen1": "2021-03-02",
      "Listen2": "2021-03-03",
      "Listen3": "2021-03-04"
    },
    {
      "id": 41,
      "Title": "Against the Grain",
      "Artist": "Bad Religion",
      "ReviewBody": "Oh man, I was a little worried going into this album, that it wouldn't be as good as I remember. Well consider me convinced, this album fucking rocks. That guitar solo that opens up the album on _Modern Man_, gets you ready to mosh. As individual songs there isn't too much to say. As with must punk, it seems as either you like it or you don't. I very much like this album, but I think for the first half of the album it does sound a bit samey. I did look up the lyrics and it seems as that is the much more important part on this album, but as I don't really listen to lyrics that does kind of hamper the album a bit. _21st Century Digital Boy_ on the other hand, is a classic. also one of the longest songs on the album at two minutes and fifty seconds. To me, this song is one of **The** songs I think of when I think of punk music. It's almost on the too melodic side to even be punk. Overall while I don't have much to say other than listen to this fucking album",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Modern Man",
        4,
        "Turn On the Light",
        3,
        "Get Off",
        3,
        "Blenderhead",
        3,
        "The Positive Aspect of Negative Thinking",
        3,
        "Anasthesia",
        3,
        "Flat Earth Society",
        3,
        "Faith Alone",
        3,
        "Entropy",
        3,
        "Against the Grain",
        3,
        "Operation Rescue",
        3,
        "God Song",
        3,
        "21st Century Digital Boy",
        4,
        "Misery and Famine",
        4,
        "Unnacceptable",
        3,
        "Quality or Quantity",
        4,
        "Walk Away",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Bad Religion\\Against The Grain\\Cover.jpg",
      "Genre": [
        "Punk Rock"
      ],
      "Blurb": "90s bad religion, I don't remmber if this stuff is good (It is)",
      "NextUpText": "NEXT UP:\n\nAirbag/How am I Driving? by Radiohead\n\nI think i don't like this album",
      "DatePosted": "2021-03-08T10:00:14.079288",
      "Listen1": "2021-03-03",
      "Listen2": "2021-03-04",
      "Listen3": "2021-03-06"
    },
    {
      "id": 42,
      "Title": "Airbag/How am I Driving?",
      "Artist": "Radiohead",
      "ReviewBody": "Oh a quick ep from Radiohead. I don't think I have ever really listened to too much Radiohead, dispite having a bunch of their albums. I think I might have listned to one of the tracks on this ep before hand and then just written the entire thing off. It's a little on the indie side for my tastes now-a-days but I still generally enjoy this ep. _Airbag_ starts off the album, this is one of those songs that I feel like to really enjoy it, you need to be really high. The next track, _Pearly_ picks up the pace slightly, it's a bit more jammy than the previous track as well. This is a quick review, I mean the ep is only seven songs after all. Overall I think this ep is good, I don't know how the rest of radiohead is going to go though.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Airbag",
        3,
        "Pearly",
        3,
        "Meeting in the Aisle",
        3,
        "A Reminder",
        2,
        "Polyethylene, Pts. 1 & 2",
        3,
        "Melatonin",
        3,
        "Palo Alto",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Radiohead\\Airbag_How Am I Driving_\\Cover.jpg",
      "Genre": [
        "Alternative Rock"
      ],
      "Blurb": "I think i don't like this album",
      "NextUpText": "NEXT UP:\n\nThe Alchemy Index, Vols. I, & II by Thrice\n\nParts I & II, fire & water, post-hardcore & Ambient Electronic",
      "DatePosted": "2021-03-12T10:00:16.137013",
      "Listen1": "2021-03-04",
      "Listen2": "2021-03-05",
      "Listen3": "2021-03-06"
    },
    {
      "id": 43,
      "Title": "The Alchemy Index, Vols. I, & II",
      "Artist": "Thrice",
      "ReviewBody": "Now I've been really looking forward to this album and the followup as well. This album and the following all concept albums, 4 eps split into 2 albums covering the four basic elements; Fire, Water, Air, and Earth. This first album takes the elements of fire and water. The fire is symbolized by their former style of \"post-hardcore\" and water is symbolized by an ambient kind of electronica. The second track on the album, _The Messenger_, starts out with this beat that sounds like the \"Showcase\" splash screen music, the thing before _Trailer Park Boys_. _The Arsonist_ has this really sick breakdown, \"I Love this city, enough that I'll set it ablaze\" over and over as the music builds, makes for a really cool effect. The first half is definitely my personal favorite of all 4 eps, but as you'll read in the next review, there are definitely some really cool tracks in the other elements, I just think fire is the most consistant. The second half of this album, Water, is interesting. I can't really say that I've heard Thrice do much with electronic elements before. The ambient electronic sound definitely works to make this sound very ocean-y. Too bad ambient music can be very hard to listen to if you are not in the mood for it. I don't have much to say for the second half; It's not bad, it just doesn't quite hold my interest like the first part does. Overall I think this is a good album, definitely the better of the two, but it doesn't feel like an album that you play all the time more listen to a couple times and think \"Yeah this is a cool concept\" and then don't touch it anymore.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.8,
      "TrackList": [
        "Firebreather",
        3,
        "The Messenger",
        4,
        "Backdraft",
        3,
        "The Arsonist",
        4,
        "Burn the Fleet",
        3,
        "The Flame Deluge",
        2,
        "Digital Sea",
        3,
        "Open Water",
        2,
        "Lost Continent",
        2,
        "Night Diving",
        3,
        "The Whaler",
        3,
        "Kings Upon the Main",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thrice\\The Alchemy Index, Vols. 1 & 2_ Fire & Water\\Cover.jpg",
      "Genre": [
        "Post-Hardcore",
        "Ambient",
        "Electronic"
      ],
      "Blurb": "Parts I & II, fire & water, post-hardcore & Ambient Electronic",
      "NextUpText": "NEXT UP:\n\nThe Alchemy Index, Vols. III, & IV by Thrice\n\nParts III & IV, Air & Earth, Atmospheric & Americana",
      "DatePosted": "2021-03-15T10:00:14.720602",
      "Listen1": "2021-03-05",
      "Listen2": "2021-03-08",
      "Listen3": "2021-03-13"
    },
    {
      "id": 44,
      "Title": "The Alchemy Index, Vols. III, & IV",
      "Artist": "Thrice",
      "ReviewBody": "The second of the Thrice element concept albums. This album features Air and Earth, Atmospheric and Folk. What's really tough about these albums is that I think the highs are much higher than album one, but the lows are ever so much lower. The opening track _Broken Lungs_ is just this kind of boring ballad that I can barely sit through. Unlike the next track _The Sky Is Falling_ which features this groovy sound and sax chord carrying the melody, this one is a bop. _Daedelus_ is my favorite of all the tracks on both albums, it's a retelling of the myth of Icarus but from his father's perspective. The second half of this album is the Earth portion, based on folk and americana sounding; because those genres are \"down to earth\" get it? While this portion of the album is fine, it's not really my thing, a lot of it feels like the slow portion in a ska album. Overall this half of the two-part album is definitely not my favorite, the highs are high, but other than that it's a snooze fest.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2.3,
      "TrackList": [
        "Broken Lungs",
        2,
        "The Sky is Falling",
        3,
        "A Song for Milly Michaelson",
        2,
        "Daedalus",
        4,
        "As the Crow Flies",
        2,
        "Silver Wings",
        1,
        "Moving Mountains",
        3,
        "Digging My Own Grave",
        3,
        "The Earth Isn't Humming",
        3,
        "The Lion and The Wolf",
        2,
        "Come All You Weary",
        2,
        "Child of Dust",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thrice\\The Alchemy Index, Vol. 3 & 4_ Air & Earth\\Cover.jpg",
      "Genre": [
        "Atmospheric Rock",
        "Americana",
        "Folk"
      ],
      "Blurb": "Parts III & IV, Air & Earth, Atmospheric & Americana",
      "NextUpText": "NEXT UP:\n\nAll Hail Bright Futures by And So I Watch You From Afar\n\nA band I have recently fallen in love with, This album is a fucking jam",
      "DatePosted": "2021-03-19T10:00:17.134691",
      "Listen1": "2021-03-08",
      "Listen2": "2021-03-09",
      "Listen3": "2021-03-13"
    },
    {
      "id": 45,
      "Title": "All Hail Bright Futures",
      "Artist": "And So I Watch You From Afar",
      "ReviewBody": "Now I have been looking forward to this album for a long time. I had a magical experience listening to this album high as fuck. I can say that sober it definitely holds up as well. The first track _Eonia_ while basically an extended intro for the next track, its still bumping. _Big Thinks Do Remarkable_ is the next track and definitely my favorite on the album. About halfway through when it starts hitting with that \"The Sun, The Sun, The Sun, Is in our eyes\" bit is epic. One of the cool things about ASIWYFA is that each of their albums feel wildly different from eachother, but still the same. This album has a definite upbeat-positive vibe to it. The tracks, _Stay Golden Pt. 1-3_, feel like a giant rising action. _Mend And Make Safe_ has this really cool panflute on the track, I feel like a lot of bands have been using the panflute lately. It also has this glitchy vibe tgo it as well. Since this is the digital deluxe version of this album it does come with two bonus tracks, _Gum_ and _Spiderbox_, both of which are awesome tracks. Overall this album is fantastic and is definitely worth the listen.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4,
      "TrackList": [
        "Eunoia",
        3,
        "Big Thinks Do Remarkable",
        5,
        "Like A Mouse",
        4,
        "Ambulance",
        4,
        "The Stay Golden Pt. 1",
        4,
        "The Stay Golden Pt. 2 (Rats on a Rock)",
        4,
        "The Stay Golden Pt. 3 (Trails...)",
        3,
        "Mend And Make Safe",
        5,
        "Ka Ba Ta Bo Da Ka",
        4,
        "Things Amazing",
        3,
        "All Hail Bright Futures",
        4,
        "Young Brave Minds",
        3,
        "Gum (Bonus Track)",
        4,
        "Spiderbox (Bonus Track)",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\And So I Watch You From Afar\\All Hail Bright Futures\\Cover.jpg",
      "Genre": [
        "Math Rock",
        "Experimental Rock"
      ],
      "Blurb": "A band I have recently fallen in love with, This album is a fucking jam",
      "NextUpText": "NEXT UP:\n\nAll's Well That Ends Well by Chiodos\n\nScreamy, emo, music",
      "DatePosted": "2021-03-22T10:00:19.836071",
      "Listen1": "2021-03-09",
      "Listen2": "2021-03-10",
      "Listen3": "2021-03-20"
    },
    {
      "id": 46,
      "Title": "All's Well That Ends Well",
      "Artist": "Chiodos",
      "ReviewBody": "When I first saw this was the album next up, I was thinking \"what if this is just bad edgy music from when I was a teenager\". Then it startup up and my thoughts were \"This is just good edgy music from when I was a teen\". Ignoring the prelude track and the two interludes, this album is a fucking bop. The higher pitch harmonies combined with the heavy-ness of the guitars and screaming compliment each other really well. The album also has this thread of a victorian opera going through it as well, that adds just another layer of depth to the music. The first track that really stands out is _Baby, You Wouldn't Last a Minute on the Creek_. The album also features this weird carnival synth that is layered on some of the tracks. It's such a weird mishmash of moods. This album has been a lost gem for me. Overall this album is great, give it a listen.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Prelude",
        1,
        "All Nereids Beware",
        4,
        "One Day Women Will All Become Monsters",
        3,
        "Expired In Goreville",
        3,
        "Baby, You Wouldn't Last A Minute On The Creek",
        5,
        "The Words 'Best Friend' Become Redefined",
        4,
        "Interlude Pt 1",
        2,
        "There's No Penguins In Alaska",
        4,
        "Interlude Pt 2",
        1,
        "We're Gonna Have Us A Champagne Jam",
        4,
        "No Hardcore Dancing In The Living Room",
        4,
        "Who's Sandie Jenkins",
        3,
        "To trixie And Reptile, Thanks For Everything",
        3,
        "Baby, You Wouldn't Last A Minute On The Creek (Acoustic)",
        3,
        "Queen Of Diamonds (Live Acoustic)",
        3,
        "Lindsey Quit Lollygagging (Acoustic)",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Chiodos\\All's Well That Ends Well (Deluxe Edition)\\Cover.jpg",
      "Genre": [
        "Post-Hardcore",
        "Screamo"
      ],
      "Blurb": "Screamy, emo, music",
      "NextUpText": "NEXT UP:\n\nAloha Moon by Magic Wands\n\nI think I've seen them live, I don't remember",
      "DatePosted": "2021-03-26T10:00:17.038463",
      "Listen1": "2021-03-10",
      "Listen2": "2021-03-11",
      "Listen3": "2021-03-20"
    },
    {
      "id": 47,
      "Title": "Aloha Moon",
      "Artist": "Magic Wands",
      "ReviewBody": "I remember really liking the song _Space_ off this album, but I don't think I had listened to the entire thing before this. It starts out very pop-y, theres a bit of shoegaze to some of the tracks but for the most part its a little bubblegum-y. There are a few standouts like: _Crystals_ and _Kaleidoscope Hearts_ and a few amazing songs like: _Black Magic_ and _Space_, but for the most part the album is pretty mediocre. Songs like _Treasure_ have this airy 80s sound to them, but they can start to feel very samey pretty quickly. Overall I do like the album, but it feels like it is just one or two albums away from really being something great.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.5,
      "TrackList": [
        "Aloha Moon",
        3,
        "Teenage Love",
        3,
        "Kaleidoscope Hearts",
        4,
        "Crystals",
        4,
        "Warrior",
        3,
        "Black Magic",
        5,
        "Treasure",
        2,
        "Wolves",
        3,
        "Kiss Me Dead",
        3,
        "Space",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Magic Wands\\Aloha Moon\\Cover.jpg",
      "Genre": [
        "Dream Pop"
      ],
      "Blurb": "I think I've seen them live, I don't remember",
      "NextUpText": "NEXT UP:\n\nDAMN. by Kendrick Lamar\n\nI don't know if I've ever listened to this all the way through, but this ones for you @Supershibe",
      "DatePosted": "2021-03-29T10:00:21.117316",
      "Listen1": "2021-03-11",
      "Listen2": "2021-03-12",
      "Listen3": "2021-03-27"
    },
    {
      "id": 48,
      "Title": "DAMN.",
      "Artist": "Kendrick Lamar",
      "ReviewBody": "When Nathan suggested that I take a crack at this album, I was excited, I remember really liking _HUMBLE._ and some other tracks on the album. I don't think I had ever listened to the entire album before though. Right off the bat, Kendrick's producing work really stands out. It's rare for me to actually like the intros on albums, but _BLOOD._ really does a good job of setting the tone for the rest of the album. I think one thing that has me at a disadvantage on this album review, and ultimately hurt it's score, is that I sometimes have a hard time comprehending lyrics on tracks. _DNA._ is a good example of this, from the sound clips spliced into the track I can tell the general message of the song, but for most of the track the actual spoken word portion just flies by me. The next track on the album, _YAH._, is definitely a big miss for me. I find it very repetitive, and it was just on the cusp of getting a lower score, but the chorus saved it for me. Not that I'm a huge Kendrick scholar or anything, but I think one of the things that was really missing for me on this album was his usual jazz-esque beats. There are some elements of jazz built into _ELEMENT._, but as with most of the tracks the beat seems to go more for a Trap ascetic. I don't dislike Trap as a genre, just for me I really, really like the jazz beats. As soon as I say my previous statement; the next track, _FEEL._, comes on and immediately shifts more to a jazz ascetic. It feels very rare for an artist at the top of the game, to speak so candidly about his anxieties and fears about being at the top of the game. _PRIDE._ is another jam on the album; a nice break between the first and second half of the album. I'm skipping over _DAMN._ I don't think, at this point, there is anything I can add that will change the discourse of what people are already saying. _LUST._ on the other hand, is another slow banger. The second half of the album, minus _DAMN._, is so very different from the first half. It's much more mellow and slow. Overall this is a solid album, only hampered by my own inability to understand lyrics in songs.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.6,
      "TrackList": [
        "BLOOD.",
        3,
        "DNA.",
        4,
        "YAH.",
        3,
        "ELEMENT.",
        4,
        "FEEL.",
        4,
        "LOYALTY. (FEAT. RIHANNA.)",
        3,
        "PRIDE.",
        3,
        "HUMBLE.",
        4,
        "LUST.",
        4,
        "LOVE. (FEAT. ZACARI.)",
        3,
        "XXX. (FEAT. U2.)",
        4,
        "FEAR.",
        4,
        "GOD.",
        4,
        "DUCKWORTH.",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Kendrick Lamar\\DAMN\\Cover2.jpg",
      "Genre": [
        "Conscious Hip-Hop"
      ],
      "Blurb": "I don't know if I've ever listened to this all the way through, but this ones for you @Supershibe",
      "NextUpText": "NEXT UP:\n\nLove What Survives by Mount Kimbie\n\nFucking _Blue Train Lines_ is too good, this one is also for @Supershibe",
      "DatePosted": "2021-04-02T10:06:08.437778",
      "Listen1": "2021-03-12",
      "Listen2": "2021-03-15",
      "Listen3": "2021-03-27"
    },
    {
      "id": 49,
      "Title": "Love What Survives",
      "Artist": "Mount Kimbie",
      "ReviewBody": "Another Nathan reccomendation. I knew I had listened to _Blue Train Lines_ before, but I don't think I had listened to the entire album before. I love Mount Kimbie's production work, they always somehow make songs that have a glitchy ascetic to them without going over board. _Four Years and One Day_ acts as a great opener for the album. _Blue Train Lines_ is a modern classic, King Krule supplies the vocals for this track, while Kimbie does the haunting melody backing the track. It has a very DUB feel to it, with the high hat rolls, topped with the sustained key presses. When the full track hits halfway through is something special. _Audition_ is another fabulous track as well; with some really good rising action tempered int he middle a bit before it is brought back in full. The next track, _Marilyn_, really slows things down a bit. _SP12 Beat_ is a very interesting listen, there are so many layers going. Everytime I listen to it I think I hear something new. The end rising action though always gets me hyped up. I really like the vocalist on the next track, _You Look Certain (I'm Not So Sure)_, Andrea Balency, I think I might go check out some of her stuff after this. _Poison_ acts as a bit of a palette cleanser between the next and previous tracks. _Delta_ is another one of those tracks that has something new to find on every listen. _T.A.M.E.D_ is one of the few tracks that does not have credited vocalists, I really like it but I wish I knew who was on the track. Overall a short but sweet album, dips in a few places, but I think the highs are definitely high enough to keep this album at a five.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 5,
      "SongAvg": 4.2,
      "TrackList": [
        "Four Years and One Day",
        3,
        "Blue Train Lines",
        5,
        "Audition",
        5,
        "Marilyn",
        4,
        "SP12 Beat",
        5,
        "You Look Certain (I'm Not So Sure)",
        5,
        "Poison",
        3,
        "We Go Home Together",
        3,
        "Delta",
        5,
        "T.A.M.E.D",
        4,
        "How We Got By",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mount Kimbie\\Love What Survives\\Cover.jpg",
      "Genre": [
        "Future Garage",
        "_Intelligent Dance Music_"
      ],
      "Blurb": "Fucking _Blue Train Lines_ is too good, this one is also for @Supershibe",
      "NextUpText": "NEXT UP:\n\nAlone in a Crowd by Catch 22\n\nMore ska greatness. Its the genre thats the most fun!",
      "DatePosted": "2021-04-05T10:00:15.850973",
      "Listen1": "2021-03-12",
      "Listen2": "2021-03-15",
      "Listen3": "2021-03-27"
    },
    {
      "id": 50,
      "Title": "Alone in a Crowd",
      "Artist": "Catch 22",
      "ReviewBody": "Cath-22, I think I just downloaded a bunch of ska and never really got around to listening to all of it. This album has some really fun brass diddies. Especially on _It Takes Some Time_. What I really like about _Catch 22_ is that they are not afraid to let their brass do the talking. You can hear some really nuts trumpet solos on some of the songs. For the most part this is pretty bog standard Ska, nothing wrong with that, just nothing special either. Overall I really like the album but I don't have much to say that I haven't already said.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.1,
      "TrackList": [
        "Intro",
        1,
        "Point the Blame",
        3,
        "Sounds Good, But I Don't Know",
        3,
        "It Takes Some Time",
        4,
        "What Goes Around Comes Around",
        4,
        "Arm to Arm",
        4,
        "Guilty Pleasures",
        4,
        "Bloomfield Ave.",
        3,
        "Hard To Impress",
        3,
        "San Francisco Payophone",
        3,
        "Wreck Of The Sleep John B.",
        3,
        "Neverending Story",
        3,
        "Thinking About Things",
        4,
        "Alone In A Crowd",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Catch 22\\Alone In A Crowd\\Cover.jpg",
      "Genre": [
        "Third-Wave Ska"
      ],
      "Blurb": "More ska greatness. Its the genre thats the most fun!",
      "NextUpText": "NEXT UP:\n\nAmalgamation by Trapt\n\nI don't think this is the album with Headstrong",
      "DatePosted": "2021-04-09T10:00:17.246700",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-04-03"
    },
    {
      "id": 51,
      "Title": "Amalgamation",
      "Artist": "Trapt",
      "ReviewBody": "Oh _Trapt_, memories of an angsty-er youth. This is not the album with _Headstrong_ on it, it is however their first album. You can definitely see their Nu Metal roots here, before they moved to a more hard rock sound. There is actually quite a bit to like here, if you can get past the angry grunts. A bunch of the tracks, like _Can This Be_ actaully have quite a bit of introspection to them. Overall this album isn't pushing any boundaries, it's also not super derivative, so its a totally fine listen if you want to be mad.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Who I Am",
        3,
        "Can This Be",
        3,
        "No One",
        3,
        "Riddle",
        3,
        "Control Me",
        3,
        "Leaving Behind",
        3,
        "Sick",
        3,
        "Perfect",
        3,
        "Instra",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Trapt\\Amalgamation\\Cover.jpg",
      "Genre": [
        "Nu Metal",
        "Alternative Metal"
      ],
      "Blurb": "I don't think this is the album with Headstrong",
      "NextUpText": "NEXT UP:\n\nAmbient by Moby\n\nI wonder if this is his ambient album?",
      "DatePosted": "2021-04-12T10:00:21.400895",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-04-03"
    },
    {
      "id": 52,
      "Title": "Ambient",
      "Artist": "Moby",
      "ReviewBody": "This Moby album really fell flat for me. I gave the album a feeling rating of `3` because I do like what is going on, but being an ambient album I can't really listen to it all the time so while I normally round up I will round down in this case. Its one of those albums that you really have to be in the mood for, you can't just listen to it whenever you want. If I could get through this album a third time I think I'd have more to say. I do want to stress that I like the album, just not this many times in row.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 3,
      "SongAvg": 2,
      "TrackList": [
        "My Beautiful Blue Sky",
        2,
        "Heaven",
        2,
        "Tongues",
        2,
        "J Breas",
        2,
        "Myopia",
        2,
        "House of Blue Leaves",
        2,
        "Bad Days",
        2,
        "Piano & String",
        2,
        "Sound",
        2,
        "Dog",
        2,
        "80",
        2,
        "Lean On Me",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Moby\\Ambient\\Cover.jpg",
      "Genre": [
        "Ambient"
      ],
      "Blurb": "I wonder if this is his ambient album?",
      "NextUpText": "NEXT UP:\n\nAmnesiac by Radiohead\n\nMore Radiohead that I haven't listened too lol",
      "DatePosted": "2021-04-16T10:00:18.412888",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-04-10"
    },
    {
      "id": 53,
      "Title": "Amnesiac",
      "Artist": "Radiohead",
      "ReviewBody": "I have never really listened to _Radiohead_ before this album rating endeavor started. Sure I had listened to the singles, but whenever songs would pop up in shuffle I would invariably skip them. I think I might have figured out my issue, I wasn't sitting down and listening to the full album, or maybe I just hadn't listened to this one. The previous _Radiohead_ ep _Airbag..._ didn't do them any favors in my book eiher. But when I started this album up with _Packt..._ that all changed. It's really moody, got this electronic bent to it, its really interesting. _Pyramid Song_ flips the script, it has this orchestral quality to it and slows the pace way down. _Pulk/Pull Revolving Doors_ has a very hard electronic bent to it, the use of the sub bass really makes all the drum hits feel very punchy. _You and Whose Army?_ is what I think of when I think radiohead, but this track is something different. It starts out very mellow and simple, but when the full band hits, it almost brought a tear to my eye. _Knives Out_ is probably my favorite track off the album. The richness of the soundscapes in some of these songs are absolutely mind blowing. The use of echo and and many layers on _Dollars & Cents_ continue the haunting aesthetic of the rest of the album. The final track on the album, _Life in a Glasshouse_, has a very 20's noir jazz vibe to it. Overall the album is fantastic, and it has defintiely given me a new look on Radiohead; very excited to listen to more of their stuff",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4.2,
      "TrackList": [
        "Packt Like Sardines in a Crushd Tin Box",
        4,
        "Pyramid Song",
        4,
        "Pulk/Pull Revolving Doors",
        4,
        "You and Whose Army?",
        4,
        "I MIght Be Wrong",
        4,
        "Knives Out",
        5,
        "Morning Bell/Amnesiac",
        4,
        "Dollars & Cents",
        4,
        "Hunting Bears",
        4,
        "Like Spinning Plates",
        4,
        "Life in a Glasshouse",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Radiohead\\Amnesiac\\Cover.jpg",
      "Genre": [
        "Experimental Rock",
        "Alternative Rock"
      ],
      "Blurb": "More Radiohead that I haven't listened too lol",
      "NextUpText": "NEXT UP:\n\nAfraid of Heights by Wavves\n\nCan't believe I didn't own this album, really excited to listen to it again",
      "DatePosted": "2021-04-19T10:00:19.306327",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-04-10"
    },
    {
      "id": 54,
      "Title": "Afraid of Heights",
      "Artist": "Wavves",
      "ReviewBody": "I remember when this album first came out, I was a little wary on it. The singles were pretty different to the last album, _King of the Beach_ that I really liked. After listening to this album, idk thousands of times at this point, I can confidently say this album is fantastic. I think it's better than _King of the Beach_ overall. The album starts with the track _Sail to the Sun_, which I think makes a great intro. Got a nice slow build up into this really catchy 'surf' riff. _Demon to Lean On_ was their big single off this album and I'll be the first to admit it is very 'Nirvana' inspired'; at least the main riff is. When it slips into the chorus it becomes a lot more Wavves like. The next track, _Mystic_, is a bit more mellow, feels more like a transitionary track than anything else. _Lunge Forward_ is a pretty standard punk song, with that classic Wavves jangle to it. _Dog_ slows the pace down again, have to include the one slow song on the album. The titular track, _Afraid of Heights_, is up next. It's got this whiny quality to it, almost bratty in a way. It sounds like a negative but I actually think it works quite well for for that 2010s punk scene. The album takes a bit of a dip, the tracks _Paranoid_, _Cop_, and _Beat Me Up_ all don't quite hit as well as the first and half of the album. For me the album picks up after this little block. After that bit of a break the album really starts picking up again. _That's on Me_ is another one of those grungy tracks that this album seems to be imitating. That's actually one of the complaints for this album, is that it sounds a little too grungy or that it feels too commercial. I think it makes for an interesting take, you can definitely see the style shifts between the grunge sound and the, at the time, modern/surf punk sound. I know that grunge sound is pretty much the only reason that KROQ was playing anything off this album. Overall I think this album is really solid, although that might just be nostalgia talking. There are a few dips that as singular tracks I could do without, but as a whole I think this album is definitely one of their best.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 5,
      "SongAvg": 4.4,
      "TrackList": [
        "Sail to the Sun",
        5,
        "Demon to Lean On",
        5,
        "Mystic",
        4,
        "Lunge Forward",
        5,
        "Dog",
        4,
        "Afraid of Heights",
        5,
        "Paranoid",
        4,
        "Cop",
        3,
        "Beat Me Up",
        4,
        "Everything Is My Fault",
        5,
        "That's on Me",
        5,
        "Gimme a Knife",
        5,
        "I Can't Dream",
        3,
        "Hippies is Punks",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Wavves\\Afraid of Heights\\Cover.jpg",
      "Genre": [
        "Alternative Rock",
        "Pop Punk"
      ],
      "Blurb": "Can't believe I didn't own this album, really excited to listen to it again",
      "NextUpText": "NEXT UP:\n\namo by Bring Me The Horizon\n\nOH FUCK YEAH, GET HYPE Luis! Finally some recent-ish music as well",
      "DatePosted": "2021-04-23T10:00:21.129315",
      "Listen1": "2021-03-30",
      "Listen2": "2021-03-31",
      "Listen3": "2021-04-17"
    },
    {
      "id": 55,
      "Title": "amo",
      "Artist": "Bring Me The Horizon",
      "ReviewBody": "Now this is an album. I remember when it first crossed my radar, I was not expecting that huge shift in style from their previous albums. Although the album before this one did use some of the same electronic stylings, just not quite to the degree of _amo_. The first track _i apologise if you feel something_ I think works as a great intro to the album. It has this great mystique that really pulls you in. Also lets you know upfront to expect some electronic production. _MANTRA_ is up next. First time I heard this track was at SGDQ 2019 at Pat's House on vinyl. This is the song that really sold me on the entire album. Next up is the track with Grimes, _nihilist blues_. The song almost has this club-like feel to it, liek you should be trapped in a hot, wet basement moshing to this song. _in the dark_ has a nice riff running through the majority of the song, for me it doesn't really work in the album. _ouch_ is a really cool song, its got some heavy dub vibes. Really reminds me of some _Nero_ tracks, fuck that is an artist I haven't thought about in years. _sugar honey ice & tea_ is another classic banger on this album. _why you gotta kick me when i'm down?_ has some fucking great production quality to it. In some parts it really nails that big soundstage sound. _mother tongue_ might just be my favorite track on the album, When the chorus hits, it hits good. Overall I think the album is fucking great, definitely one of my favorites from _Bring Me The Horizon_.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 4.6,
      "SongAvg": 5,
      "TrackList": [
        "i apolgise if you feel something",
        4,
        "MANTRA",
        5,
        "nihilist blues (feat. Grimes)",
        5,
        "in the dark",
        3,
        "wonderful life (feat. Dani Filth)",
        5,
        "ouch",
        5,
        "medicine",
        4,
        "sugar honey ice & tea",
        5,
        "why you gotta kick me when i'm down?",
        5,
        "fresh bruises",
        4,
        "mother tongue",
        5,
        "heavy metal (feat. Rahzel)",
        5,
        "i don't know what to say",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Bring Me the Horizon\\amo\\Cover.jpg",
      "Genre": [
        "Electronic Rock"
      ],
      "Blurb": "OH FUCK YEAH, GET HYPE Luis! Finally some recent-ish music as well",
      "NextUpText": "NEXT UP:\n\nAmplified: A Decade of Reinventing the Cello by Apocalyptica\n\nThere is a lot of metal covers here",
      "DatePosted": "2021-04-26T10:00:19.183830",
      "Listen1": "2021-02-04",
      "Listen2": "2021-02-05",
      "Listen3": "2021-04-17"
    },
    {
      "id": 56,
      "Title": "Amplified: A Decade of Reinventing the Cello",
      "Artist": "Apocalyptica",
      "ReviewBody": "Hey remember when that neoclassical cover of _Enter Sandman_ came out? and how it was only popular for like a month or so. Well 2009 me thought that song rocked and got the whole album it came on. After listening through the album a few times, while not bad, it just makes me want to listen to the actual Metalica songs they are covering. They do have a cover of _Hall of the Mountain King_ which is really good, definitely a classical song that works quite well in the metal genre. This album is essentially a \"best of\" of Apocalyptica's previous works. Broken up into 2 discs, the first is all instrumental and basically all of the covers, disc 2 is all of their featured vocalist tracks. Unsurprisingly I prefer the instrumental tracks over the voiced tracks. Overall this album is fine, just not something I forsee myself really going back to that often.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Enter Sandman",
        3,
        "Harmageddon",
        3,
        "Nothing Else Matters",
        3,
        "Refuse / Resist",
        3,
        "Somehwere Around Nothing",
        3,
        "Betrayal / Forgiveness",
        3,
        "Farewell",
        3,
        "Master of Puppets",
        3,
        "Hall of the Mountain King",
        4,
        "One",
        3,
        "Heat",
        3,
        "Cohkka",
        3,
        "Kamos",
        3,
        "Deathzone",
        3,
        "Angel of Death",
        3,
        "Repressed",
        3,
        "Path, Vol. 2",
        4,
        "Bittersweet",
        2,
        "Hope, Vol. 2",
        2,
        "En Vie",
        3,
        "Faraway, Vol. 2",
        2,
        "Life Burns!",
        3,
        "Seemann",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Apocalyptica\\Amplified_ A Decade of Reinventing the Cello\\Cover.jpg",
      "Genre": [
        "Neoclassical Metal"
      ],
      "Blurb": "There is a lot of metal covers here",
      "NextUpText": "NEXT UP:\n\nAn American Prayer by The Doors\n\nI Think this is a spoken word album... ooof",
      "DatePosted": "2021-04-30T10:00:20.343405",
      "Listen1": "2021-02-05",
      "Listen2": "2021-02-07",
      "Listen3": "2021-04-24"
    },
    {
      "id": 57,
      "Title": "An American Prayer",
      "Artist": "The Doors",
      "ReviewBody": "This album is an interesting mix of Jim Morrison's spoken word poetry backed by some of The Doors' popular tracks. There is some really interesting sounds on this album, but for the most part I just find it to be a bit boring inbetween the interesting bits. The standout track for me on this album is _The Hitchhiker_, but that is mainly because it is backed by my favorite Doors track, _Riders on the Storm_. Overall this album is probably really cool for some people, but for me its a pass.",
      "AlbumRating": 2,
      "AlbumFeelingRating": 2,
      "SongAvg": 2,
      "TrackList": [
        "Awake",
        1,
        "Ghost Song",
        3,
        "Dawn's Highway",
        2,
        "Newborn Awakening",
        2,
        "To Come Of Age",
        1,
        "Black Polished Chrome",
        2,
        "Latino Chrome",
        2,
        "Angels And Sailors",
        2,
        "Stoned Immaculate",
        2,
        "The Movie",
        1,
        "Curses, Invocations",
        2,
        "American Night",
        1,
        "Roadhouse Blues",
        3,
        "The World On Fire",
        1,
        "Lament",
        2,
        "The Hitchhiker",
        2,
        "An American Prayer",
        4,
        "Hour For Magic",
        2,
        "Freedom Exists",
        2,
        "A Feast Of Friends",
        2,
        "Babylon Fading",
        2,
        "Bird Of Prey",
        1,
        "The Ghost Song",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Doors, The\\An American Prayer\\Cover.jpg",
      "Genre": [
        "Spoken Word",
        "Poetry"
      ],
      "Blurb": "I Think this is a spoken word album... ooof",
      "NextUpText": "NEXT UP:\n\nAmputechture by The Mars Volta\n\nThe Album before Bedlam, probably their best album",
      "DatePosted": "2021-05-03T10:28:09.859072",
      "Listen1": "2021-02-08",
      "Listen2": "2021-02-09",
      "Listen3": "2021-04-24"
    },
    {
      "id": 58,
      "Title": "Amputechture",
      "Artist": "The Mars Volta",
      "ReviewBody": "Man what a band, Discovered them from that fucking movie, _Get him to the Greek_. Who knew I would have fallen in love with them. The Album opens up with this mysterious, slow solo. The guitar work is just impeccable. The whole track gives me this \"sitting in a dark smokey room\" vibe that I really dig. You really get that feeling when the piano kicks in close to runtime. One thing I have always found a bit strange is the drastic shift between _Vicarious Atonement_ and _Tratragrammaton_. _Tetragrammaton_ basically starts in a full on solo. But just in general, what a ride this song is, basically an ep within the larger album, sitting at sixteen minutes. _Vermicide_ is the shortest track on the album, sitting at 4:15 and acts as a really nice palatte cleanser between Tetra and Mecca. _Asilos Magdalena_ is what really introduced me to the flamenco style of guitar, I've always wanted to learn but never got around to it. Despite the entire song being in spanish, and me not speaking a lick, I think this song might be one of my favorites on the album. When the full band kicks in during _Viscera Eyes_ is really something cool to hear, then it breaks into an almost Blue Oyster Cult like breakdown. Overall this album is fucking fantastic, and if you want to go on a wild ride then I suggest you give it a listen.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 5,
      "SongAvg": 4.6,
      "TrackList": [
        "Vicarious Atonement",
        5,
        "Tetragrammaton",
        5,
        "Vermicide",
        5,
        "Meccamputechture",
        4,
        "Asilos Magdelena",
        5,
        "Viscera Eyes",
        5,
        "Days of the Baphomets",
        4,
        "El Ciervo Vulnerado",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Mars Volta, The\\Amputechture\\Cover.jpg",
      "Genre": [
        "Progressive Rock"
      ],
      "Blurb": "The Album before Bedlam, probably their best album",
      "NextUpText": "NEXT UP:\n\nAn Odd Entrances by Thee Oh Sees\n\nThe first half of a two part ep, the other half was _A Weird Exits_",
      "DatePosted": "2021-05-07T10:00:22.414684",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-05-01"
    },
    {
      "id": 59,
      "Title": "An Odd Entrances",
      "Artist": "Thee Oh Sees",
      "ReviewBody": "This album is actually the first half of a two part album series, the first being the previously review _A Weird Exits_. This album came out towards the end of the bands _Thee Oh Sees_ phase; for those unaware this band changes their name every couple of years, but only slightly. Typically when the band changes their name, they are indicating they are doing another slight style shift. Although by the time this album rolled around they had already begun shifting towards a more progressive styling. Most of the _Thee Oh Sees_ phase of the band was more garage rock/punk focused and definitely more upbeat moshpit kind of tunes. That's enough about the band in general, let's get to the actual album. I find this album to be a bit more chill than the follow up album. And with that in mind it makes a bit of sense, this is the buildup to some of the awesome payoffs in _Exits_. But taken as an individual album, for me it falls a little flat. Typically I really their jam tracks, but _Jammed Exit_ is on the short side. While the song is really interesting I don't find myself drawn to it. The use of flute in the track is appreciated though. Overall the album is pretty good, just not as good as some of their other albums or even the followup album.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 2.8,
      "SongAvg": 3,
      "TrackList": [
        "You Will Find It Here",
        3,
        "The Poem",
        3,
        "Jammed Exit",
        2,
        "At The End",
        3,
        "Unwrap The Fiend, Pt.1",
        3,
        "Nervous Tech (Nah John)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thee Oh Sees\\An Odd Entrances\\Cover.jpg",
      "Genre": [
        "Garage Rock",
        "Psychedelic Rock"
      ],
      "Blurb": "The first half of a two part ep, the other half was _A Weird Exits_",
      "NextUpText": "NEXT UP:\n\nAncient Artifact ARGOS-CCCIII by Rotteen\n\nWe got a whole lot of fusion going on here, Am Excite",
      "DatePosted": "2021-05-10T10:00:21.677030",
      "Listen1": "2021-02-09",
      "Listen2": "2021-02-10",
      "Listen3": "2021-04-24"
    },
    {
      "id": 60,
      "Title": "Ancient Artifact ARGOS-CCCIII",
      "Artist": "Rotteen",
      "ReviewBody": "Ah some more Rotteen. This is the kind of album you throw on when you just need background music, not a bad thing but not super analytical either. Beign rave the songs blend really well together, but there are a few standouts. _White Nuxxle Driver_ and _Arc_ are the two I particularily like on this album. There is some really interesting sounds on the other tracks. Like _Errorblasterz_ has an almost liquid quality to it as well. Overall I don't have too much to say other than its a fun album, but not world shattering.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "Like A Fuckin' Sun",
        3,
        "BOOM-000",
        3,
        "Crow",
        3,
        "Dopefish",
        3,
        "White Nuxxle Driver",
        4,
        "Errorblasterz",
        3,
        "UR Way",
        3,
        "HeadXplit",
        3,
        "Arc",
        4,
        "VEC+LEGGENDARIA",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Rotteen\\Ancient Artifact ARGOS-CCCIII\\Cover.jpg",
      "Genre": [
        "Rave Fusion"
      ],
      "Blurb": "We got a whole lot of fusion going on here, Am Excite",
      "NextUpText": "NEXT UP:\n\nAnd So I Watch You From Afar by And So I Watch You From Afar\n\nThe First album from ASIWYFA",
      "DatePosted": "2021-05-14T10:00:19.021990",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-05-01"
    },
    {
      "id": 61,
      "Title": "And So I Watch You From Afar",
      "Artist": "And So I Watch You From Afar",
      "ReviewBody": "The first album from _And So I Watch You From Afar_. From listening to all of their albums; they each feature a distinct yet similar soundscape. This album has an almost absurdist take on darker topics. Like you are meant to be seeing some irony in a seemingly bleak outlook. This album features no vocals, unlike some of their other albums which might feature chants or other phrases. Tracks like _Clench Fists, Grit Teeth...Go!_ really remind me of the feeling of listening to edgier music as a kid, but then its actually good so I'm not embarrased to be caught listening to this. This album definitely has an almost djent feel to it, more so than some of their other albums. Overall this album is great and definitely worth a listen even if you don't listen to much math rock.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4,
      "TrackList": [
        "Set Guitars to Kill",
        4,
        "A Little bit of Solidarity goes a Long Way",
        4,
        "Clench Fists, Grit Teeth... Go!",
        3,
        "I Capture Castles",
        5,
        "Start a Band",
        4,
        "Tip of the Hat, Punch in the Face",
        3,
        "If it ain't Broke... Break it",
        5,
        "These Riots are just the Beginning",
        5,
        "Don't Waste Time Doing Things You Hate",
        4,
        "The Voicelss",
        3,
        "Eat the City, Eat it Whole",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\And So I Watch You From Afar\\And So I Watch You From Afar\\Cover.jpg",
      "Genre": [
        "Post-Rock",
        "Math Rock"
      ],
      "Blurb": "The First album from ASIWYFA",
      "NextUpText": "NEXT UP:\n\nAnimal Magic by Bonobo\n\nI've listened to Black Sands the most, but I like Bonobo, very interesting stuff",
      "DatePosted": "2021-05-17T10:00:18.580396",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 62,
      "Title": "Animal Magic",
      "Artist": "Bonobo",
      "ReviewBody": "Ahh Bonobo, I remember liking his album _Black Sands_ so much that I went out and got his discography as well. This album, for the most part, is much more chill than then black sands even is. Well I guess that isn't saying much when the second track on the album is called _Sleepy Seven_. But even the next track _Dinosaurs_ is rather chill as well. I don't know what it is about using those grainy-old samples but it always reminds me of a specific period between 1998-2010. What's really interesting about this album is that you can see the growth between this and Black Sands, well one would hope considiring that they are 10 years apart. _Terrapin_ has a really interesting sitar through line, that comes in just when you feel you might be drifting off the song. _Shadowtricks_ is another favorite off the album, it has this smoky jazz room feel, feels like I should be sipping a glass of whiskey, in my detectives office, in the rain. Overall this album is a great vibe, perfect for a rainy day.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.8,
      "TrackList": [
        "Intro",
        1,
        "Sleepy Seven",
        3,
        "Dinosaurs",
        3,
        "Kota",
        3,
        "Terrapin",
        3,
        "The Plug",
        3,
        "Shadowtricks",
        3,
        "Gypsy",
        3,
        "Sugar Rhyme",
        3,
        "Silver",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Bonobo\\Animal Magic\\Cover.jpg",
      "Genre": [
        "Trip Hop",
        "Electronica"
      ],
      "Blurb": "I've listened to Black Sands the most, but I like Bonobo, very interesting stuff",
      "NextUpText": "NEXT UP:\n\nAnimal Rights by Moby\n\nDang what is this like the third Moby review?",
      "DatePosted": "2021-05-21T10:00:16.104805",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 63,
      "Title": "Animal Rights",
      "Artist": "Moby",
      "ReviewBody": "Oh boy here we go, Moby round three. I think this is the last Moby album for a long time. This is album is quite a bit different from the albums I've listened to so far. This album is almost a punk rock album instead of an electronic one, although you can find electronic elements on this album for sure. The album ebbs and flows through the more punk-alternative viens and then comes back to blend it with more calm electronic track, that still carries the momentum. Some standout tracks for me are, _Come on Baby_ and _That's When I Reach for My Revolver_. You might notice that I'm rounding down here, Even though I do like this album quite a bit, I just don't think I can confidently say its a \"4\". The album starts on a really high note for me, but it just slips away towards the end. Overall I do really like this album, and it has defnitely given me a bigger appreciation for Moby as an artist, but it just has a few sticking points for me that keep it from going higher.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 4,
      "SongAvg": 3,
      "TrackList": [
        "Dead Sun",
        2,
        "Someone to Love",
        3,
        "Heavy Flow",
        3,
        "You",
        4,
        "Now I Let It Go",
        3,
        "Come on Baby",
        4,
        "Soft",
        3,
        "Anima",
        3,
        "Say It's All Mine",
        3,
        "That's When I Reach for My Revolver",
        4,
        "Alone",
        3,
        "Face It",
        4,
        "Old",
        2,
        "Living",
        2,
        "Love Song for My Mom",
        3,
        "A Season in Hell",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Moby\\Animal Rights\\Cover.jpg",
      "Genre": [
        "Alternative Rock",
        "Hardcore Punk",
        "Ambient"
      ],
      "Blurb": "Dang what is this like the third Moby review?",
      "NextUpText": "NEXT UP:\n\nAnswer That and Stay Fashionable by AFI\n\nI think this is really early AFI",
      "DatePosted": "2021-05-24T10:00:13.984336",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 64,
      "Title": "Answer That and Stay Fashionable",
      "Artist": "AFI",
      "ReviewBody": "I don't have any experience with any AFI before _DECEMBERUNDERGROUND_, but I was intrigued to listen to some of the old catalogue though. I was not expecting straight up 80s-90s hardcore punk though, not that I'm complaining. Notable standouts for me are: _I Wanna Get a Mohawk_, _The Checkered Demon_, and _Don't Make Me Ill_. To be honest, with most hardcore punk, there isn't a ton to say that can't be said of one track. Overall I really like this album, just dumb fun.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4.2,
      "TrackList": [
        "Two of a Kind",
        4,
        "Half-Empty Bottle",
        4,
        "Yurf Rendenmein",
        4,
        "I Wanna Get a Mohawk (But Mom Won't Let Me Get One)",
        5,
        "Brownie Bottom Sundae",
        4,
        "The Checkered Demon",
        5,
        "Cereal Wars",
        4,
        "The Mother in Me",
        4,
        "Rizzo in the Box",
        4,
        "Kung-Fu Devil",
        4,
        "Your Name Here",
        4,
        "Ny-Quil",
        4,
        "Don't Make Me Ill",
        5,
        "Open your Eyes",
        4,
        "High School Football Hero",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\AFI\\Answer That and Stay Fashionable\\Cover.jpg",
      "Genre": [
        "Hardcore Punk"
      ],
      "Blurb": "I think this is really early AFI",
      "NextUpText": "NEXT UP:\n\nThe Anti Mother by Norma Jean\n\nOof got this album becuase the cover looked cool, the first time I stepped into Hot Topic",
      "DatePosted": "2021-05-28T10:00:11.266092",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 65,
      "Title": "The Anti Mother",
      "Artist": "Norma Jean",
      "ReviewBody": "I gotta say I was really nervous to come back to this album. Those fears were unfounded, this album fucking slaps, and hard too. I remember I first heard/got this album when I went into a Hot Topic buying clothes to go into freshman year of highschool. The album starts out a bit slower before building to it's full speed. The album does a really good job of setting this brooding soundscape. The real standouts on this album are _Robots 3 Humans 0_ and _Surrender Your Sons..._. I think this might be because they are a bit more melodic compared to the other tracks on the album. While I don't have much more to say, the album tends to feel really similiar all throughout, it does hold a special place in my heart. Overall a great listen, even ten years later.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 4.1,
      "TrackList": [
        "Vipers, Snakes, and Actors",
        3,
        "Self Employed Chemist",
        4,
        "Birth of the Anti Mother",
        4,
        "Robots 3 Humans 0",
        5,
        "Death of the Anti Mother",
        4,
        "Surrender Your Sons...",
        5,
        "Murphy Was an Optimist",
        3,
        "Opposite of Left and Wrong",
        4,
        "...Discipline Your Daughters",
        4,
        "And There Will be a Swarm of Hornets",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Norma Jean\\The Anti Mother\\Cover.jpg",
      "Genre": [
        "Metalcore",
        "Post-Hardcore"
      ],
      "Blurb": "Oof got this album becuase the cover looked cool, the first time I stepped into Hot Topic",
      "NextUpText": "NEXT UP:\n\nAntichamber by Siddhartha Barnhoorn\n\nThis is the soundtrack to a fucking rad game, Antichamber",
      "DatePosted": "2021-05-31T10:00:07.091895",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-05-22"
    },
    {
      "id": 66,
      "Title": "Antichamber",
      "Artist": "Siddhartha Barnhoorn",
      "ReviewBody": "While I think the music really works for the game, and is rather pleasent; in a vacuum it is nigh unlistenable. This is the second one star album though.",
      "AlbumRating": 1,
      "AlbumFeelingRating": 1,
      "SongAvg": 1,
      "TrackList": [
        "Beginnings I",
        1,
        "Beginnings II",
        1,
        "Antichamber Suite I",
        1,
        "Antichamber Suite II",
        1,
        "Black Tile",
        1,
        "The Final Puzzle",
        1,
        "The Core",
        1,
        "Dying World",
        1,
        "The Garden (bonus track)",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Siddhartha Barnhoorn\\Antichamber OST\\Cover.png",
      "Genre": [
        "Soundtrack",
        "Video Game"
      ],
      "Blurb": "This is the soundtrack to a fucking rad game, Antichamber",
      "NextUpText": "NEXT UP:\n\nAntics by Interpol\n\nThe Second Interpol album, this is not the album with their best known track",
      "DatePosted": "2021-06-04T10:00:23.829136",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-05-22"
    },
    {
      "id": 67,
      "Title": "Antics",
      "Artist": "Interpol",
      "ReviewBody": "Oh Interpol. Thanks to Rockband I started looking into them and found I band I really like. Interpol is definitely a product of the times, that almost nostalgic sound that a lot of the early 00's indie bands had. The standouts for me are _Evil_ and _NARC_. Both songs are a bit more upbeat, very dancable tracks, very fun. One of the issues I did have with this album is that some of the tracks start to blend together after a bit. Not quite as bad as the first Best Coast album, but still a bit noticable after a while. As a follow up to _Turn on the Bright Lights_ I think it's a bit weak, but Overall I do enjoy the album, just probably won't revisit it that often.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.2,
      "TrackList": [
        "Next Exit",
        3,
        "Evil",
        4,
        "NARC",
        4,
        "Take You on a Cruise",
        3,
        "Slow Hands",
        3,
        "Not Even Jail",
        3,
        "Public Pervert",
        3,
        "C'mere",
        3,
        "Length of Love",
        3,
        "A Time to Be So Small",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Interpol\\Antics\\Cover.jpg",
      "Genre": [
        "Indie Rock"
      ],
      "Blurb": "The Second Interpol album, this is not the album with their best known track",
      "NextUpText": "NEXT UP:\n\nAnytime At All by Banyan\n\nI think this might be more Janes Addiction, butt rock",
      "DatePosted": "2021-06-07T10:00:20.126436",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 68,
      "Title": "Anytime At All",
      "Artist": "Banyan",
      "ReviewBody": "Now this album was a real surprise for me. I for whatever reason, after deciding to download all of the Janes Addiction albums, then went on to find all the bands the members were in. Why I did this I will never know. I think I listened to a few of the bands and didn't really like them, but then kept them in my library (again for some reason), and so I never got to Banyan. Well I fucked up this is some great jazz fusion. It's the kind of jazz fusion that you get ripped and then sit outside in the hot sun listening to them jam, kind of Fusion. Since it's a moistly lyricless album it's great to just put on when you want some background noise. _Justine_ has a really nice funky breakdown at the halfway mark. I've never really thought much about it, but it turns out I am a fan of rapping in my fusion, _Steel Head_ is another standout. I just love the guitar sound in it. It reminds me of some of the knuckle's tracks in Sonic Adventure 2 Battle. I think my favorite track on the album is _Keep the Change_, I'm a sucker for the sultry, vocal-fried female singing in these types of songs. Overall I think the album is worth a listen, if you like fusion, Definitely surprised me.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.4,
      "TrackList": [
        "Buzzards & Worms",
        3,
        "Justine",
        4,
        "Steel Head",
        4,
        "Looped + Faded",
        3,
        "Grease The System",
        3,
        "La Sirena",
        3,
        "Cactus Soil",
        3,
        "Keep The Change",
        4,
        "Lovin' Them Pounds",
        4,
        "Early Bird",
        3,
        "Sputnik",
        4,
        "The Apple and the Seed",
        4,
        "New Old Hat",
        4,
        "Untitled",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Banyan\\Anytime At All\\Cover.jpg",
      "Genre": [
        "Fusion",
        "Rock"
      ],
      "Blurb": "I think this might be more Janes Addiction, butt rock",
      "NextUpText": "NEXT UP:\n\nApe Escape: Pumped & Primed by Soichi Terada\n\nI've never played this game, but I know the music is supposed to be good",
      "DatePosted": "2021-06-11T10:00:22.780727",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 69,
      "Title": "Ape Escape: Pumped & Primed",
      "Artist": "Soichi Terada",
      "ReviewBody": "I'll preface this with I have never played an Ape Escape game before. I've seen some gameplay of it, so I know what it's about. I will admit that I was bit daunted with the track listing, but it's not quite as bad as it looks, since the longest song is like two minutes and fifty seconds. _Prologue_ is definitely my favorite track. Gotta have all the spacy, airy, electronic music. I don't know what it is, that makes me love that type of sound so much, but I just can't ever get enough of it. _Stunclub_ is another really fun track on this album. It starts out very vibrant and bouncy, then kind of meshes in this meloncholy guitar riff, that you might find in a Drums song. I had a feeling this album was going to be good, but I think I was surprised by how much I actually ended up enjoying. Overall this album is worth the listen, give it a shot.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.4,
      "TrackList": [
        "Pipasaru Theme",
        3,
        "Saru Battle Theme",
        4,
        "Prologue",
        5,
        "Menu",
        3,
        "Select",
        4,
        "Stunclub",
        5,
        "Dragonfly",
        3,
        "Slingshot",
        3,
        "Boat",
        3,
        "Dash Hoop",
        4,
        "RC Car",
        4,
        "WaterMech",
        3,
        "Tank",
        3,
        "Result 1",
        3,
        "Crisis",
        3,
        "Nano Grid",
        3,
        "Mech Break",
        4,
        "Result 2",
        3,
        "Piposaru Theme (Tahiti Version)",
        3,
        "Kakeru's Theme",
        3,
        "Natsumi's Theme",
        3,
        "Professor's Theme",
        2,
        "Charu's Theme",
        3,
        "Haruka's Theme",
        4,
        "Rival's Theme",
        4,
        "Pipotron's Theme",
        4,
        "Terra Break",
        3,
        "Stolen Disc",
        4,
        "Last Boss Theme",
        4,
        "Final Battle",
        3,
        "Escape",
        3,
        "Relax Time",
        4,
        "Banana Relation",
        2,
        "Epilogue",
        4,
        "Afrosaur's Theme (aha Version)",
        3,
        "Afrosaru's Theme (oh yeah Version)",
        3,
        "Piposaru Theme (Karaoke)",
        4,
        "Jingle Collection",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Soichi Terada\\Ape Escape - Pumped & Primed OST\\Cover.jpg",
      "Genre": [
        "Soundtrack",
        "Video Game"
      ],
      "Blurb": "I've never played this game, but I know the music is supposed to be good",
      "NextUpText": "NEXT UP:\n\nAppleseed EP by Aesop Rock\n\nI haven't listened to Aesop Rock in almost 10 years now",
      "DatePosted": "2021-06-14T10:20:44.674660",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 70,
      "Title": "Appleseed EP",
      "Artist": "Aesop Rock",
      "ReviewBody": "Oh Aesop Rock, I saw them play at FYF in 2012, that was fun. I'm pretty picky when it comes to hip hop, and that holds true with Aesop as well. I think he has some of the best beats, but sometimes his voice just really throws me out of the music. _Dryspell_ is a good example of this. I really like the jazz backbeat but his rapping doesn't work, for me. I feel like I have to be in the right mood to listen to him. I'm always a sucker for a hip hop song with a sample in it. _Sick Friend_ got a bump in rating solely for that. I've been trying to think about why I like that so much and I can't come up with anything concrete. The beat on _1,000 Deaths_ is so good. I think it is easily my favorite track on the album. That saxophone that comes in on the chorus, just \\* _Chef's kiss_ \\*. Overall I think this Ep is pretty good, it feels rough compared to some of Aesop's other albums, but still good for what it is.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "Appleseed Intro",
        3,
        "Dryspell",
        3,
        "Same Space (Tugboat Complex Part 2)",
        3,
        "Sick Friend",
        4,
        "Hold the Cup",
        3,
        "1,000 Deaths",
        4,
        "Blue in the Face",
        3,
        "Odessa (feat Dose One)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Aesop Rock\\Appleseed EP\\Cover.jpg",
      "Genre": [
        "Abstract Hip Hop"
      ],
      "Blurb": "I haven't listened to Aesop Rock in almost 10 years now",
      "NextUpText": "NEXT UP:\n\nAqua Teen Hunger Force Colon Movie Film for Theaters Colon the Soundtrack by Various Artists\n\nI bought this album soley for the mastodon song",
      "DatePosted": "2021-06-18T16:08:27.432220",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 71,
      "Title": "Aqua Teen Hunger Force Colon Movie Film for Theaters Colon the Soundtrack",
      "Artist": "Various Artists",
      "ReviewBody": "What an album/movie. I only bought the album because I wanted _Cut You Up With a Linoleum Knife_ by Mastodon. I did find some other songs on here that I like, but with most mid 00's soundtracks, the tracklisting is kind of all over the place. I've actually been pretty interested in rewatching the movie, as I haven't seen it since it came out. This album is loaded with a bunch of skits, that are really more annoying that anything. I'm of the opinion, that if you are going to do a skit, just do a skit and make it a atleast a minute, fifteen seconds is just not worth it. Maybe their intention was that it's so short there is no reason to skip it, but at least for me, I just find it annoying. Overall I think this album has some shining spots, but all the skits and random songs take a bit away for me. ",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.6,
      "TrackList": [
        "Nude Love",
        2,
        "Groovy Time for a Movie Time",
        2,
        "Cut You Up With a Linoleum Knife",
        5,
        "More to Me Than Meat and Eyes",
        3,
        "ATHF Theme (Remix)",
        3,
        "Meatwad - Skit",
        1,
        "The Chosen",
        4,
        "Party Party Party",
        3,
        "Carl Brutananadilewski - Skit",
        1,
        "Carl's Theme",
        3,
        "Bookworm Resin",
        4,
        "Master Shake - Skit",
        1,
        "Blam Blam",
        2,
        "I Like Your Booty (But I'm Not Gay)",
        2,
        "I Want Candy",
        2,
        "Girls Like Status",
        3,
        "Nude Love (Reprise)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Various Artists\\Aqua Teen Hunger Force Colon Movie Film for Theaters Colon the Soundtrack\\Cover.jpg",
      "Genre": [
        "Soundtrack",
        "Movie"
      ],
      "Blurb": "I bought this album soley for the mastodon song",
      "NextUpText": "NEXT UP:\n\nArabia Mountain by The Black Lips\n\nModern Art was the track that got me into The Black Lips",
      "DatePosted": "2021-06-21T10:01:25.396938",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 72,
      "Title": "Arabia Mountain",
      "Artist": "The Black Lips",
      "ReviewBody": "We got another Black Lips album, right here. This is the album that introduced me to this band. _Modern Art_ specifically. This album marked a shift for the group towards a more surf rock sound, compared to their earlier garage rock aesthetic. While still having their garage roots, you can really hear the upgrade in production quality on this album. Most of the album is standout tracks, but _Modern Art_ is my favorite. Overall there isn't much to say, you kind of know exactly what you are getting with most of the tracks, but with an album like this that's kind of what you want anyway.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.6,
      "TrackList": [
        "Family Tree",
        3,
        "Modern Art",
        5,
        "Spidey's Curse",
        3,
        "Mad Dog",
        4,
        "Mr. Driver",
        3,
        "Bicentennial Man",
        4,
        "Go Out and Get It",
        4,
        "Raw Meat",
        3,
        "Bone Marrow",
        3,
        "The Lie",
        4,
        "Time",
        4,
        "Dumpster Dive",
        3,
        "New Direction",
        4,
        "Noc-a-Homa",
        3,
        "Don't Mess Up My Baby",
        3,
        "You Keep on Running",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Black Lips, The\\Arabia Mountain\\Cover.jpg",
      "Genre": [
        "Surf Rock",
        "Garage Rock"
      ],
      "Blurb": "Modern Art was the track that got me into The Black Lips",
      "NextUpText": "NEXT UP:\n\nArcadepunk by Klippa\n\nWtf is melodic dubstep",
      "DatePosted": "2021-06-28T10:00:25.599123",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 73,
      "Title": "Arcadepunk",
      "Artist": "Klippa",
      "ReviewBody": "This mini album was actually a bit of a surprise for me. I was not expecting to like it as much as I did. The sample work makes this feel glitchy in all the right places. _Scrapheap_ is just a touch to mellow for me, but other than that this entire album is pretty solid. _I'll wait_ uses a really gothic sounding keyboard that somehow feels right at home with the glitchy percussion. Overall this album is fifteen minutes long and definitely worth checking out.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.8,
      "TrackList": [
        "Arcadepunk",
        4,
        "Scrapheap",
        3,
        "I'll Wait",
        4,
        "Pectus Excavatum (feat. June LaLonde)",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Klippa\\Arcadepunk\\Cover.jpg",
      "Genre": [
        "Melodic Dubstep"
      ],
      "Blurb": "Wtf is melodic dubstep",
      "NextUpText": "NEXT UP:\n\nAre You Dead Yet? by Children Of Bodom\n\nLet's see what Melodic Death Metal has in store for me....",
      "DatePosted": "2021-07-02T10:01:14.444225",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 74,
      "Title": "Are You Dead Yet?",
      "Artist": "Children Of Bodom",
      "ReviewBody": "Anyone remember Valarie Alfaro? because she is the one who recomended me this album. I think the thing I find most surprising about it, is that I still like it all these years later. The album starts out on a really high note with _Living Dead Beat_. It has a really sick guitar solo that blends into a keyboard solo. That is something I find cool about this album. I was not expecting Keyboards in a Death Metal album. Despite what you all may think I don't actually listen to much metal that isn't also in some way progressive. So I think the most suprising thing to me about this album is just how melodic it actually is, sounds obvious with the genre being Melodic Death Metal, but considering some of the other death metal I have listened to, it suprised me. The titular track, _Are You Dead Yet?_ is a good example of this, it has a full on chorus that would feel welcome in any Avenged Sevenfold album. The guitar solo on _If You Want Peace... Prepare for War_ is fucking awesome, you should listen to this album solely for that. Overall this was such a surprising album, but I loved it for it. If you are even slightly tempted by anything I wrote, I think you should go for it, you might surprise yourself.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.5,
      "TrackList": [
        "Living Dead Beat",
        4,
        "Are You Dead Yet?",
        4,
        "If You Want Peace... Prepare for War",
        4,
        "Punch Me I Bleed",
        3,
        "In Your face",
        3,
        "Next in Line",
        4,
        "Bastards of Bodom",
        3,
        "Trashed, Lost & Strungout",
        4,
        "We're Not Gonna Fall",
        3,
        "Somebody Put Something in My Drink",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Children Of Bodom\\Are You Dead Yet\\Cover.jpg",
      "Genre": [
        "Melodic Death Metal"
      ],
      "Blurb": "Let's see what Melodic Death Metal has in store for me....",
      "NextUpText": "NEXT UP:\n\nAround the Fur by Deftones\n\nLmao I had this as a cd and I made my Mom listen to it for like 3 days straight when we drove to Tennessee one time.",
      "DatePosted": "2021-07-06T10:02:09.555595",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 75,
      "Title": "Around the Fur",
      "Artist": "Deftones",
      "ReviewBody": "What a great album. I probably haven't listened to it in forever, but I still know most of the songs so well. This album is definitely aggro teenager music. The first track _My Own Summer..._ really sets that point, and sets it hard. While the album on the whole is pretty faced paced and aggressive, it has moments of calm, with almost ballad like qualities. Such as _Mascara_. The real standout track for me on this album is: _Be Quiet adn Drive (Far Away)_. This song is what plays in my head whenever someone says \"Deftones\". Overall I like this album quite a bit, mainly for nostalgia reasons, but even so it's still a fun time.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.3,
      "TrackList": [
        "My Own Summer (Shove It)",
        4,
        "Lhabia",
        4,
        "Mascara",
        3,
        "Around the Fur",
        3,
        "Rickets",
        3,
        "Be Quiet and Drive (Far Away)",
        5,
        "Lotion",
        3,
        "Dai the Flu",
        4,
        "Headup (Feat. Max Cavalera)",
        3,
        "MX",
        1
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Deftones\\Around The Fur\\Cover.jpg",
      "Genre": [
        "Alternative Metal",
        "Nu Metal"
      ],
      "Blurb": "Lmao I had this as a cd and I made my Mom listen to it for like 3 days straight when we drove to Tennessee one time.",
      "NextUpText": "NEXT UP:\n\nThe Art of Drowning by AFI\n\nNeed to make sure I get the rest of the tracks",
      "DatePosted": "2021-07-09T10:01:16.674924",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 76,
      "Title": "The Art of Drowning",
      "Artist": "AFI",
      "ReviewBody": "Going into this album, I knew AFi had punk roots from doing the other album reviews. I also knew they had some goth/emo from the obvious Decemberunderground. It was pretty neat to see the shift forming with this album. I had ofcourse heard some of the singles off of this album before, but before this review process I had never listened to this album in it's entirety. The songs generally follow the same structrue, with hardcore punk drums and a chorus. Nothing special but also consistant throughout the album, so you really know what you are getting. There is some breaks to go into the more emo/goth-y sound that they are transitioning to. Overall it's a really solid album, a little repetitive but still a ton of fun all the way through.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.4,
      "TrackList": [
        "Initiation",
        3,
        "The Lost Souls",
        4,
        "The Nephilim",
        3,
        "Ever and a Day",
        3,
        "Sacrifice Theory",
        4,
        "Of Greetings and Goodbyes",
        3,
        "Smile",
        3,
        "A Story at Three",
        3,
        "Days of the Phoenix",
        4,
        "Catch a Hot One",
        4,
        "Wester",
        4,
        "6 to 8",
        3,
        "The Despair Factor",
        4,
        "Morningstar / Battled",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\AFI\\The Art of Drowning\\Cover.jpg",
      "Genre": [
        "Hardcore Punk",
        "Horror Punk"
      ],
      "Blurb": "Need to make sure I get the rest of the tracks",
      "NextUpText": "NEXT UP:\n\nThe Artist in the Ambulance by Thrice\n\nWooo this is THE Thrice album",
      "DatePosted": "2021-07-12T10:01:07.348119",
      "Listen1": "",
      "Listen2": "",
      "Listen3": "2021-07-03"
    },
    {
      "id": 77,
      "Title": "The Artist in the Ambulance",
      "Artist": "Thrice",
      "ReviewBody": "I was really excited to get to this album. I used to have part of this album on an Alarm playlist that would wake me up before school. I distinctly remember that weird whining sound that starts off _All That's Left_ being the first thing I heard in the morning for quite a while. This album fits very well into that mid 2000's kind of post-hardcore, kind of emo. This album in particular gives me _Story of the Year_ vibes, although I am almost pretty positive that, that came after this album. Overall this was a great blast from the past, can't wait to put it on a more consistant rotation.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.6,
      "TrackList": [
        "Cold Cash and Colder Hearts",
        3,
        "Under a Killing Moon",
        3,
        "All That's Left",
        4,
        "Silhouette",
        3,
        "Stare at the Sun",
        4,
        "Paper Tigers",
        4,
        "Hoods on Peregrine",
        3,
        "The Melting Point of Wax",
        3,
        "Blood CLots and Black Holes",
        3,
        "The Artist in the Ambulance",
        5,
        "The Abolition of Man",
        4,
        "Don't Tell and We Won't Ask",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Thrice\\The Artist In The Ambulance\\Cover.jpg",
      "Genre": [
        "Post-Hardcore"
      ],
      "Blurb": "Wooo this is THE Thrice album",
      "NextUpText": "NEXT UP:\n\nArtwork by The Used\n\nI don't really remember this album, I listened to their earlier albums more",
      "DatePosted": "2021-07-16T10:02:22.553802",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 78,
      "Title": "Artwork",
      "Artist": "The Used",
      "ReviewBody": "I remember this album kind of came out around the time I stopped listening to as much emo music. It also didn't help that compared to their earlier albums, this one is not quite as catchy. There are still a few standout tracks like _Blook on My Hands_ or _Empty with You_. In some places this album feels like a pop album, with some slight emo tendancies to it. Overall I think this album is ok. I much prefer their earlier work, but there is still some fun to be had here.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 2.8,
      "TrackList": [
        "Blood on My Hands",
        4,
        "Empty with You",
        3,
        "Born to Quit",
        3,
        "Kissing You Goodbye",
        2,
        "Sold My Soul",
        2,
        "Watered Down",
        3,
        "On the Cross",
        3,
        "Come Undone",
        2,
        "Meant to Die",
        3,
        "The Best of Me",
        3,
        "Men Are All the Same",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Used, The\\Artwork\\Cover.jpg",
      "Genre": [
        "Emo",
        "Post-Hardcore"
      ],
      "Blurb": "I don't really remember this album, I listened to their earlier albums more",
      "NextUpText": "NEXT UP:\n\nAs Daylight Dies by Killswitch Engage\n\nTHIS IS MY CURSE!!!!!",
      "DatePosted": "2021-07-26T10:01:18.098220",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 79,
      "Title": "As Daylight Dies",
      "Artist": "Killswitch Engage",
      "ReviewBody": "I always wanted to like Killswitch much more than I actually do like them. They have a really interesting mix of powerful vocals and growls (of which are more common to the genre). As you all might guess, _My Curse_ is the standout track on this album. Besides that track, everything else is fine. There's only a couple tracks that I outright dislike; _Holy Diver_ and _This Fire_. One of the reasons that I think Killswitch never fully sat with me is they feel a bit Hair Metal-y; they are definitely not hair metal, but inbetween the bits of metalcore I get that hair metal vibe. Overall I like the album, I don't think I'd really skip any track if it came on in a shuffle, but I'm going out of my way to listen to more of it.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.1,
      "TrackList": [
        "Daylight Dies",
        3,
        "This Is Absolution",
        2,
        "The Arms of Sorrow",
        3,
        "Unbroken",
        3,
        "My Curse",
        5,
        "For You",
        4,
        "Still Beats Your Name",
        3,
        "Eye of the Storm",
        3,
        "Break the Silence",
        3,
        "Desperate Times",
        3,
        "Reject Yourself",
        3,
        "Be One",
        4,
        "Let the Bridges Burn",
        4,
        "This Fire",
        2,
        "Holy Diver",
        2
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Killswitch Engage\\As Daylight Dies\\Cover.jpg",
      "Genre": [
        "Metalcore"
      ],
      "Blurb": "THIS IS MY CURSE!!!!!",
      "NextUpText": "NEXT UP:\n\nAscendancy by Trivium\n\nWhile not quite as good as their next album Shogun, this is still pretty solid",
      "DatePosted": "2021-07-30T10:03:55.191511",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 80,
      "Title": "Ascendancy",
      "Artist": "Trivium",
      "ReviewBody": "This album has a really interesting mix of goth, thrash, and metalcore. While I like their follow up album, _Shogun_, better this album is still a favorite of mine. Unlike the previous review; for _As Daylight Dies_, when I think of metalcore, this is much more what I think of. One of the things that really draws me to Trivium is their technical guitar work and solos. Even on tracks that I might not have liked as much, _Drowned and Torn Asunder_ for example, were almost bumped up to a four strictly for the solo. The solo on _Like Light to the Flies_ is a big standout, blending quite technical riffs for the majorit of the track, into a driving solo that brings everything back to the chorus. My favorite track on the album is _Dying in Your Arms_. Overall if you are a fan of early Metallica or metalcore in general I think you would also love this album.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.7,
      "TrackList": [
        "The End of Everything",
        4,
        "Rain",
        3,
        "Pull Harder on the String of Your Martyr",
        4,
        "Drowned and Torn Asunder",
        3,
        "Ascendancy",
        4,
        "A Gunshot to the Head of Trepidation",
        4,
        "Like Light to the Flies",
        5,
        "Dying in Your Arms",
        5,
        "The Deceived",
        4,
        "Suffocating Sight",
        5,
        "Departure",
        5,
        "Declaration",
        4,
        "Blinding Tears Will Break the Skies",
        3,
        "Washing Away Me in the Tides",
        3,
        "Master of Puppets",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Trivium\\Ascendancy\\Cover.jpg",
      "Genre": [
        "Metalcore",
        "Thrash Metal"
      ],
      "Blurb": "While not quite as good as their next album Shogun, this is still pretty solid",
      "NextUpText": "NEXT UP:\n\nAstro Coast by Surfer Blood\n\nThis album is solid, I haven't listened to it in years",
      "DatePosted": "2021-08-02T10:01:06.493857",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 81,
      "Title": "Astro Coast",
      "Artist": "Surfer Blood",
      "ReviewBody": "Now this album brings back some memories. I don't think I really got into surfer blood until around 2012, but this album was on repeat for me quite a bit at the time. The album is kind of a rocksteady take on surf rock, most songs are pretty laid back, but feature a nice groove that you can get into. The album is pretty strong all the way through, with _Twin Peaks_ being my favorite track, but kind of takes a small dip towards the end. It's not bad, just doesn't hit the highs that are set for most of the album. Overall I really like the album, it's got a few too many low points to make it really shine, but on the whole it is definitely an album I can listen to almost whenver I want to.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.7,
      "TrackList": [
        "Floating Vibes",
        3,
        "Swim",
        4,
        "Take it Easy",
        3,
        "Harmonix",
        4,
        "Neighbour Riffs",
        4,
        "Twin Peaks",
        5,
        "Fast Jabroni",
        4,
        "Slow Jabroni",
        3,
        "Anchorage",
        4,
        "Catholic Pagans",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Surfer Blood\\Astro Coast\\Cover.jpg",
      "Genre": [
        "Indie Rock",
        "Surf Rock"
      ],
      "Blurb": "This album is solid, I haven't listened to it in years",
      "NextUpText": "NEXT UP:\n\nAstro Lounge by Smash Mouth\n\nSOME BODY, ONCE TOLD ME",
      "DatePosted": "2021-08-06T10:00:02.487304",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 82,
      "Title": "Astro Lounge",
      "Artist": "Smash Mouth",
      "ReviewBody": "I was wondering when _All Star_ would show up in the album reviews. I'll be honest I've never actually listened to this album all the way through before, in fact I don't know if I have even heard any track on here that wasn't _All Star_. Ofcourse that is the best song on this album but I was pleasently surprised by it anyway. It's not quite as good as _Fush Yu Mang_ but it's still pretty good. The album starts off a bit slow for me, with _I Just Wanna See_ and _Waste_ being two tracks that I just can't stand. _I Just Wanna See_ is atleast listenable, but _Waste_ is just so slow and boring and not at all what I am looking for in Ska album. Now I don't think anymore needs to be said about _All Star_, everyone knows this song and everyone loves this song, and anybody who says otherwise is just lying (Looking at you Pat). _Satalite_ was big surprise for me, while being a bit slower, it's got such a nice groove to it, it's quite a fun track. When _Radio_ came on I had to double check that I hadn't switched to a _Wavves_ track. It has that upbeat surf-rock - surf-punk vibe to it, unfortunately the chorus really kills this song for me, a bit too poppy; the only thing holding it back from a much higher score really. _Then the Morning Comes_ is so good, minus that way too pop-y chorus. It's really a shame since I do really like the track quite a bit until the chorus hits. Wow the middle of this album is quite a slog luckily it picks back up starting with _Defeat You_. Overall this album is a lot more fun than I thought it was going to be, there are some genuinely good tracks that are ruined by going a little to on the pop side.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Who's There",
        3,
        "Diggin' Your Scene",
        3,
        "I Just Wanna See",
        2,
        "Waste",
        1,
        "All Star",
        5,
        "Satellite",
        4,
        "Radio",
        2,
        "Stoned",
        2,
        "The the Morning Comes",
        2,
        "Road Man",
        2,
        "Fallen Horses",
        2,
        "Defeat You",
        4,
        "Come on, Come On",
        5,
        "Home",
        4,
        "Can't get Enough of You Baby",
        4
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Smash Mouth\\Astro Lounge\\Cover.jpg",
      "Genre": [
        "Pop Rock",
        "Alternative Rock"
      ],
      "Blurb": "SOME BODY, ONCE TOLD ME",
      "NextUpText": "NEXT UP:\n\nAfter The Party by The Menzingers\n\nThe Album after Rented World, if I remember this album is just ok",
      "DatePosted": "2021-08-09T10:00:02.680841",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 83,
      "Title": "After The Party",
      "Artist": "The Menzingers",
      "ReviewBody": "This album came out a couple years after _Rented World_, and I had some high expectations for it. I can't say it totally lived up to them, but I think it's still pretty solid. The album starts out really strong with the track _Telling' Lies_. _Midwestern States_ is the next biggest highlight for me, after that. The album starts out pretty solid but it does start to dip after _Black Mass_, which I just can't stand, but it wouldn't be a Menzingers album without the required slow song. The only exception to the bad second half is _Bad Catholics_. Overall this album is pretty good, it has a few low points, but on the whole it's quite enjoyable.",
      "AlbumRating": 4,
      "AlbumFeelingRating": 4,
      "SongAvg": 3.4,
      "TrackList": [
        "Tellin' Lies",
        5,
        "Thick as Thieves",
        4,
        "Lookers",
        3,
        "Midwestern States",
        5,
        "Charlie's Army",
        4,
        "House on Fire",
        3,
        "Black Mass",
        1,
        "Roy Blue",
        3,
        "Bad Catholics",
        4,
        "Your Wild Years",
        3,
        "The Bars",
        3,
        "After the Party",
        3,
        "Livin' Ain't Easy",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Menzingers, The\\After The Party\\Cover.jpg",
      "Genre": [
        "Punk Rock",
        "Heartland Rock"
      ],
      "Blurb": "The Album after Rented World, if I remember this album is just ok",
      "NextUpText": "NEXT UP:\n\nASTROANTEDILUVIAN by Darius\n\nI am really excited to listen to this fursona",
      "DatePosted": "2021-08-13T10:00:04.077894",
      "Listen1": "2021-08-03",
      "Listen2": "2021-08-04",
      "Listen3": "2021-08-07"
    },
    {
      "id": 84,
      "Title": "ASTROANTEDILUVIAN",
      "Artist": "Darius",
      "ReviewBody": "When I read a bit more about this fursona I was pretty interested in the progressive fusion aspect of them. I was rewarded, this is a fun little album. I was not quite expecting the level of progressive fusion I got with this album, I was kind of expecting more electronic vibes, but this is just straight noodling for about 40 minutes. Unfortunely I don't have a ton to say about the album, other than I really enjoy.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.3,
      "TrackList": [
        "ornithopter",
        3,
        "affective",
        3,
        "driving logic",
        3,
        "disconnect Q1",
        3,
        "vanishing chameleon",
        4,
        "gigni;currency",
        4,
        "laminate phantom",
        4,
        "rejuvenation",
        3,
        "surface wellness",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Darius\\ASTROANTEDILUVIAN\\Cover.jpg",
      "Genre": [
        "Progressive Fusion",
        "Experimental Jazz"
      ],
      "Blurb": "I am really excited to listen to this fursona",
      "NextUpText": "NEXT UP:\n\nAt Play by Deadmau5\n\nGet ready for the Deadmua5 block",
      "DatePosted": "2021-08-16T10:01:43.690654",
      "Listen1": "",
      "Listen2": "",
      "Listen3": ""
    },
    {
      "id": 85,
      "Title": "At Play",
      "Artist": "Deadmau5",
      "ReviewBody": "Oh man this brings me back to the days of senior year when I was getting really into electronic music. I remember absolutely loving some of the edgier tracks on this album, that now I can barely stand to put on. Most of this album is pretty solid, just the kind of music you might throw on at a party. The notable highlight for me is _This is the Hook_, I don't know why but I am a sucker for \"instructional\" tracks or tracks that use an old instructional disc for the music. Overall there isn't a ton to say, if you have heard one deadmau5 song, you have pretty much heard them all.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Vanishing Point",
        3,
        "Sex, Lies, Audiotape",
        3,
        "Cocktail Queen",
        3,
        "Faxing Berlin",
        3,
        "Hey Baby (Adam K Dirty Remix)",
        3,
        "Turning Point",
        3,
        "This is the Hook",
        4,
        "1981",
        3,
        "Dr. Funkenstein",
        3,
        "Afterhours",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Deadmau5\\At Play\\Cover.jpg",
      "Genre": [
        "Progressive House"
      ],
      "Blurb": "Get ready for the Deadmua5 block",
      "NextUpText": "NEXT UP:\n\nAt Play 2 by Deadmau5\n\nMore Deadmau5, this might get repetitive",
      "DatePosted": "2021-08-20T10:00:03.854490",
      "Listen1": "2021-03-10",
      "Listen2": "2021-03-11",
      "Listen3": "2021-08-07"
    },
    {
      "id": 86,
      "Title": "At Play 2",
      "Artist": "Deadmau5",
      "ReviewBody": "Oh man this brings me back to the days of senior year when I was getting really into electronic music. I remember absolutely loving some of the edgier tracks on this album, that now I can barely stand to put on. Most of this album is pretty solid, just the kind of music you might throw on at a party. The notable highlight for me is _This is Also the Hook_, I don't know why but I am a sucker for \"instructional\" tracks or tracks that use an old instructional disc for the music. Overall there isn't a ton to say, if you have heard one deadmau5 song, you have pretty much heard them all.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Outta My Life (Touch Mix)",
        3,
        "Attention Whore",
        3,
        "Mr. G",
        3,
        "Reduction",
        3,
        "This Is Also The Hook",
        3,
        "Orca",
        3,
        "Tau V2",
        3,
        "Sex Slave",
        3,
        "This Noise",
        3,
        "R My Dreams",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Deadmau5\\At Play 2\\Cover.jpg",
      "Genre": [
        "Progressive House"
      ],
      "Blurb": "More Deadmau5, this might get repetitive",
      "NextUpText": "NEXT UP:\n\nAtomizer by Furries in a Blender\n\nWoo More GABBERSTAG",
      "DatePosted": "2021-08-23T10:00:02.376329",
      "Listen1": "2021-03-11",
      "Listen2": "2021-03-12",
      "Listen3": "2021-08-07"
    },
    {
      "id": 87,
      "Title": "Atomizer",
      "Artist": "Furries in a Blender",
      "ReviewBody": "Got some more Halley Labs tracks, this time its the fursona, Furries in a Blender. The songs are pretty fun and bouncy, but apart from that there really isn't that much too say. If you have listened to one furries in a blender album you have listened to them all. Now some might see that as a negative, but it could also just mean they are consistant. You know what you are getting every time you put on one of their albums. Overall this album is fine, nothing special, but also not bad to just throw on and have some fun.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Atomizer",
        3,
        "Lockdown",
        3,
        "Yellow RMX",
        3,
        "Slow Mover",
        3,
        "Wheels of Steel",
        3,
        "Great Expectations (FIAB RMX)",
        3,
        "GABBERSTÃ„G (FIAB RMX)",
        3,
        "I'm Alive 2012",
        3,
        "Wind Me Up",
        3,
        "Blue Deceiver (feat. Darius)",
        3,
        "Atomizer (The Living Tombstone RMX feat. Ibeabronyrapper)",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Furries in a Blender\\Atomizer\\Cover.jpg",
      "Genre": [],
      "Blurb": "Woo More GABBERSTAG",
      "NextUpText": "NEXT UP:\n\nAttack & Release by The Black Keys\n\nI Think this is the album right before Brothers",
      "DatePosted": "2021-08-27T10:01:20.079857",
      "Listen1": "2021-03-12",
      "Listen2": "2021-03-15",
      "Listen3": ""
    },
    {
      "id": 88,
      "Title": "Attack & Release",
      "Artist": "The Black Keys",
      "ReviewBody": "This is the album right before their big break. They still have their blues edge on this one. For the most part I am pretty iffy on this album. I keep going from, wow I really like this, to, dang I wish I was listening to _Brothers_ instead. There's nothign wrong with the album, it just dips a bit too slowely for me. The few standouts on this album are _I Got Mine_, _Strange Times_, and _Remember When (Side B)_. Overall it's a decent album with a few skips.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3.3,
      "TrackList": [
        "All You Ever Wanted",
        3,
        "I Got Mine",
        4,
        "Strange Times",
        4,
        "Psychotic Girl",
        3,
        "Lies",
        3,
        "Remember When (Side A)",
        3,
        "Remember When (Side B)",
        4,
        "Same Old Thing",
        3,
        "So He Won't Break",
        3,
        "Oceans & Streams",
        3,
        "Things Ain't Like They Used to Be",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Black Keys, The\\Attack & Release\\Cover.jpg",
      "Genre": [
        "Blues Rock"
      ],
      "Blurb": "I Think this is the album right before Brothers",
      "NextUpText": "NEXT UP:\n\nAttack On Memory by Cloud Nothings\n\nHoly shit this album is fucking fantastic, and I haven't listened to it in forever",
      "DatePosted": "2021-08-30T10:48:25.573285",
      "Listen1": "2021-03-15",
      "Listen2": "2021-03-16",
      "Listen3": ""
    },
    {
      "id": 89,
      "Title": "Attack On Memory",
      "Artist": "Cloud Nothings",
      "ReviewBody": "I was so excited when I rememebered that this album was coming up fairly early on in the rating adventure. This album marked a drastic shift for Cloud Nothings. Previously they were a bit of a shoegaze-y, indie kind of band; but this album shifted them directly in Noise Rock and Post-Hardcore. The album starts with a nice building track, _No Future No Past_, which I really like but I don't feel like it hits the same in isolation that it does when it leads into _Wasted Days_. Speaking of, the song is so good I wish I could give it six stars. It's actually so good I want to lower the ratings of the other songs just so this one sits higher. _Fall In_ brings back a touch of the old style energy, but keeps the high energy they are cultivating on this album. With _Stay Useless_ we fully pick back up to the tone set in _Wasted Days_. _No Sentiment_ is probably the most similar to their old stuff, but it somehow works well in the larger context of the album. Overall this is a fantastic album, I am shocked everytime I finish it to find out it's only thirty minutes long.",
      "AlbumRating": 5,
      "AlbumFeelingRating": 5,
      "SongAvg": 4.8,
      "TrackList": [
        "No Future No Past",
        4,
        "Wasted Days",
        5,
        "Fall In",
        5,
        "Stay Useless",
        5,
        "Seperation",
        4,
        "No Sentiment",
        5,
        "Our Plans",
        5,
        "Cut You",
        5
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Cloud Nothings\\Attack on Memory\\Cover.jpg",
      "Genre": [
        "Noise Rock",
        "Post-Hardcore"
      ],
      "Blurb": "Holy shit this album is fucking fantastic, and I haven't listened to it in forever",
      "NextUpText": "NEXT UP:\n\nAvatar: The Last Airbender by The Track Team\n\nSoundtrack for the amazing show",
      "DatePosted": "2021-09-03T10:05:39.106510",
      "Listen1": "2021-03-16",
      "Listen2": "2021-03-17",
      "Listen3": ""
    },
    {
      "ID": 90,
      "Title": "Avatar: The Last Airbender",
      "Artist": "The Track Team",
      "ReviewBody": "The Avatar soundtrack, so much good music for such a great show. I unfortunately seem to be missing about five tracks, but that's ok. While I really like the music for the show, everytime I listen to this album, I just want to watch the show instead. Overall the ost is definitely worth your time.",
      "AlbumRating": 3,
      "AlbumFeelingRating": 3,
      "SongAvg": 3,
      "TrackList": [
        "Avatar Premier Main Title",
        3,
        "The Final Blow",
        3,
        "The Avatar State",
        3,
        "Heart Charkra",
        4,
        "Dai Li Headquarters",
        3,
        "Agni Kai Avatar",
        3,
        "Into the Earth Kingdom",
        3,
        "Return to Omashu Night Sky",
        3,
        "Missing",
        0,
        "Missing",
        0,
        "Missing",
        0,
        "Missing",
        0,
        "Missing",
        0,
        "End Credit Music",
        3,
        "Entering Ba Sing Se",
        3,
        "Nomad Songs",
        2,
        "Panda Lily",
        3,
        "Swamp Fight",
        3,
        "YuYen Capture Aang",
        3,
        "Uncle's Tsungi Horn",
        3,
        "Water Monster",
        3,
        "Who's Destiny",
        3,
        "Yue Becomes Moon Spirit",
        3,
        "Zuko On the Mount",
        3,
        "Azula Intro",
        3,
        "Blue Spirit",
        3
      ],
      "AlbumArt": "\\\\OPENMEDIAVAULT\\Media\\Music\\Track Team, The\\Avatar The Last Airbender OST\\Cover.jpg",
      "Genre": [
        "Soundtrack",
        "TV Show"
      ],
      "Blurb": "Soundtrack for the amazing show",
      "NextUpText": "NEXT UP:\n\nAwesomenauts by SonicPicnic\n\nSoundtrack for the game, damn its a lot of tracks",
      "DatePosted": "2021-09-06T10:04:44.988573",
      "Listen1": "2021-03-17",
      "Listen2": "2021-03-18",
      "Listen3": ""
    }
  ]
}